      *****************************************************************
      *         I D E N T I F I C A T I O N   D I V I S I O N         *
      *****************************************************************
        IDENTIFICATION DIVISION.

        PROGRAM-ID.   US.
      * AUTHOR.       W CLAYTON.
      * INSTALLATION.  COMDATA NETWORK, INC.
      * DATE-WRITTEN. 11/23/80.

      * REMARKS.      ON-LINE FUEL TRANSACTION PROGRAM.
KB1007******************************************************************
KB1007*  COMPILE OPTIONS: LANG=ECC, DB2=Y, 2/CXXCMCD1/CXXCOW/UR, MQ=Y
      ******************************************************************
MB1112*  COMPILE US USING 5.1 INSTEAD OF COMPIT TO PICK UP SPEC CHAR
MB1112******************************************************************
      * FUNCTION....: ON-LINE FUEL TRANSACTION PROGRAM                 *
      * TRAN ID.....: 'FP'                                             *
      * LANG........: COBOL II (CICS)                                  *
      * DESCRIPTION.: THIS PROGRAM HAS SEVERAL FUNCTIONS, LISTED BELOW *
      *               1)  FP (FUEL) TRANSACTION                        *
      *               2)  FP CANCEL TRANSACTION                        *
      *               3)  SETTLEMENT REQUEST                           *
      *               4)  FP MAINT ON/OFF REQUEST                      *
      ******************************************************************
      *                    MODIFICATION TABLE
      *
      * NAME       DATE   DESCRIPTION
      * ========== ====== ==============================================
      * SCHLEICHER PREV   IF YOU NEED TO SEE THE OLD MODIFICATION TABLE
      *                   PLEASE COME SEE ME.  I HAVE IT FILED.
      * SCHLEICHER 031493 1)REMOVED ALL ALTERS/HANDLE CONDITIONS
      *                   2)REMOVED ALL DEAD CODE
      *                   3)REMOVED ALL RECURSION
      *                   4)CREATED SEVERIAL NEW ROUTINES TO REPLACE GOT
      *                   5)PSR #1132 - REEFER/DIESEL DAILY LIMITS
      *                          1259 - RETURN NAME,CITY,STATE ON POS XT
      *                          1262 - SUPPORT TERMINAL,FUNDED,DB XTNS
      *                                 SAME LOCATION CODE
      * SCHLEICHER 031593 ADDED LOGIC TO HANDLE ALL AMERICAN
      * SCHLEICHER 031793 PSR #1260 - LIMITED NETWORK BY SC LOCATION
      *                       #1374 - MAX GALLONS BY STATE/ALL STATE
      *                       #1314 - IGNORE TERM FUEL LIMITS
      * SCHLEICHER 032993 REMOVED THE FORCED 'US' COMPANY LOGIC
      * C. PRYOR   031893 PSR #1160 - ONE-TIME W/ PO OVERRIDE NOT
      *                               WORKING PROPERLY IF TOTAL > 99999
      * C. PRYOR   041593 PUT SWITCH IN READ-CDNCUST ROUTINE SO THAT
      *                   ONE-TIME AMOUNTS WILL ONLY BE ADDED TO AVAIL
      *                   AMTS FIRST TIME THROUGH
      * C. PRYOR   041993 FIX PROBLEM W/ PREVIOUS CHANGE, RESET SWITCH
      *                   EACH TIME PRMCARD IS READ
      * SCHLEICHER 042693 FIXED PROBLEM WITH IGNORE TERM FUEL LIMITS @
      *                   AN AUTO-GAS LOCATION
      * R PROCTOR  050393 CHANGED BATCH-LOAD-ROUTINE TO LINKED MODULE
      * SCHLEICHER 052593 JUL-DATE-LINK WAS ZEROES WHEN IT WENT TO
      *                   ROLL-PROD-TOTALS.  THIS CAUSED THE CURRENT
      *                   USED AMOUNT ON PRODUCTS TO ALWAYS BE ZERO.
      *            052593 CHANGED COMDATA COMPLETE, DRIVER CARRIED
      *                   CARD, TO CHARGE THE COMCHEK FEE.
      * C PRYOR    052593 ADDED LOGIC FOR CASH PER GALLON LIMIT
      * SCHLEICHER 060893 PSR#1369 - CHECK TO SEE IF WE CHARGE NORMAL
      *                   FEE FOR TRANSLINK TRANSACTIONS
      * SCHLEICHER 060993 PSR#1546 - ALLOW COST PLUS TYPE 'U' AT TERM
      *                   FUEL LOCATION.
      * SCHLEICHER 060993 PSR#1586 - ONLY CHECK CREDIT ON THE BILLABLE
      * SCHLEICHER 060993 PSR#1685 - ADD CANADIAN TAX ID TO FMLOG
      * C PRYOR    061193 PSR#1571 - FOR VRU, IGNORE PURCHASE LIMIT
      * SCHLEICHER 061493 PSR#1678 - IGNORE 2HR CHECK IF CUST OR SC
      *                              IS FLAGGED TO DO SO.
      * C PRYOR    070193 ADD LOGIC FOR PERCENT OF FACE DISCOUNT
      *                   (PENSKE PROJECT).
      * SCHLEICHER 070693 PSR#1768 - ALLOW PO TO OVERRIDE MAX GALLONS
      * SCHLEICHER 071693 CONVERTED TO COBOL II.
      * C PRYOR    072693 PSR#1878 - FIX BALANCE BASED DISCOUNT PART NET
      *                              PART REBATED - ONLY PASS NET AMOUNT
      *                              TO CARD
      * SCHLEICHER 072793 PSR#1883 - CHANGE INTRA-DAY CONTROL# TO SHOW R
      * SCHLEICHER 081693 PSR#1942 - CHANGE INTRA-DAY CONTROL# TO SHOW R
      * SCHLEICHER 081893 PSR#1838 - USE MASTER CODE ON 2HR CHECK
      *                   PSR#1575 - USE MASTER CODE ON 2HR CHECK
      *                   PSR#1763 - IGNORE UNIT # ON 2HR CHECK
      *                   PSR#1687 - MAKE CN225 GET CITY/STATE/TAXID
      *                   PSR#1883 - MAKE US225 GET CITY/STATE INFO
      * SCHLEICHER 090293 FIX AUTOGAS INVOICE PROBLEM (EMERG CHANGE)
      * C PRYOR    090793 PSR#1997 - ALLOW PRODS @ NONDESIGNATED LOCATIO
      * C PRYOR    090993 FIX PAY-AT-LOAD DISCOUNT PROBLEM
      * SCHLEICHER 092093 PSR#2162 - COST PLUS ADD ON
      * C PRYOR    092193 PRJ#73   - ADD LIMITED NETWORK BY CARD
      * R PROCTOR  101393 PRJ#     - CHANGE RJ3 LAYOUT TO MATCH TSFMB010
      * SCHLEICHER 110193 INCREASED TRIP NUMBER FROM 9 TO 10 BYTES
      * SHOTTS     111293 SCMSTR FILE EXPANSION
      * SCHLEICHER 111893 ADDED NEW SETTLEMENT LOGIC
      * PRYOR      112293 EXPANDED SCMSTR HOLD AREA LENGTH
      * SCHLEICHER 020194 CHANGED FMRM LOGIC TO USE TSFMO0RX LINKABLE PG
      * VERNON     033194 SPLIT RETAIN-FEE INTO 'P' & 'R' FOR PREFERRED
      * SCHLEICHER 050194 REWORKED MOST OF THE CODE TO IMPROVE ITS
      *                   INSPECTOR SCORE
      * SCHLEICHER 050594 CHANGES FOR COMDATA COMPLETE RECOURSE
      *                   PROJECT #111
      * C. PRYOR   092994 CHANGES FOR FFE (PROJECT #112) AND PSR #289
      * SCHLEICHER 100394 CHANGES FOR ATM/SECONDARY CARD PROJECT
      * C. PRYOR   122294 FIX FOR MIN. CASH PER GALLON
      * C. PRYOR   122594 CHANGE FORMAT FOR START OF PSNS  (NATS)
      * SCHLEICHER 01??95 - INTRA DAY CHANGES FOR MIXED CURRENCIES
      *                   - ATM CHANGES (NO FREE XTNS)
      *                   - ADDED OIL LIMITS
      * C. PRYOR   052395 - PSR # 1023 - ADDED MANUAL PREFERRED FEE
      * SCHLEICHER 062695 - PSR # 1384 - AUTO-GAS PUMP NUMBER
      * C. PRYOR   081795 - ADDED SETTLEMENT CODE TO FMLOG
      * SCHLEICHER 112895 - CORRECTED ATM REVERSAL PROBLEM
      * SCHLEICHER 121295 - SEND WARNING MESSAGE ON COMCHEK/FDIS CARDS
      * THOMASON   010596 - INSERTED WRITES TO PRMCARD BACKUP FILES
      * C. PRYOR   030196 - PSR # 1694 - TRAILER HR EDITS
      * C. PRYOR   031896 - PSR # 1713 - TRAILER POOL MASTER CODE
      * C. PRYOR   032296 - PSR # 1893 - EXPANDED RESPONSES TO TRENDAR
      *                                  REDUCED CO FEES (FUEL ONLY)
      * SCHLEICHER 042396 - PSR # ???? - ADDED 1-TIME OFF NETW PURC THAT
      *                                  IS SETUP BY CARD
      * C. PRYOR   072996 - PSR # 2095 - ADDED 'DB' OR 'DBF' TO TRENDAR
      *                                  NET AMOUNT RESPONSES
      *                       # 2081 - ADD DATE TO ERROR RESPONSE
      *                       # 1653 - REAL-TIME, CHANGE TERM.FUEL TYPE
      * C. PRYOR   081596 - PSR # 1503 - CHECK "DEFAULT" RECORD FOR
      *                                  LIMITED NETWORK BY CARD
      * C. PRYOR   102296 - PSR # 2129 - CHARGE STANDARD T/S FEE FOR CAS
      *                                  PREFERRED XTNS & ZERO OUT RETAI
      *                                  REBATE
      *                     PSR # 2101 - CHANGE TRIP REQUIRED FLAG TO 'C
      *                                  VR800 TRANSACTIONS
      *                     PSR # 2103 - VALIDATE HUB READING NUMERIC IN
      *                                  REAL-TIME ERROR XFER
      *                     PSR # 2118 - CARD CHECK DIGIT NOT ALWAYS SET
      *                                  REAL-TIME ERROR XFER; MOVED CHE
      *                                  DIGIT TO WS-PRM-CARD IN
      *                                  20060-GET-CARD-CUST-INFO
      * SCHLEICHER 111896 - ADDED CUSTOM TAXES FOR COST PLUS
      * SCHLEICHER 121896 - ADDED RISK MANAGED FUEL
      * C. PRYOR   032197 - SET INDX IN FPU-CHECK-PROD2 AND
      *                     FPU-CHECK-PROD2 TO PREVENT STORAGE VIOLATION
      *                     AND ASRA
      * M. PERRY   032497 - EFS ATM PHASE 1
      * SCHLEICHER 050197 - PSR #2328 (ONE TIME OFF NETWORK
      * SCHLEICHER 052797 - PSR #2203 (TRUNCATION PROBLEM WITH FOCUS CPG
      * SCHLEICHER 052797 - PSR #1712 (INVOICE TOTAL ERROR ON POS)
JS2000* SCHLEICHER 102497 - YEAR 2000 (JS2000)
CP0298* C. PRYOR   020398 - PRJ # 461 - TEXACO
JS0298* SCHLEICHER 020498 - PASSAGE PLUS (SPECIAL PAYTO FOR SETTLE)
MP0303* M PERRY    030398 - NEW NATS PROCESSING
JS0498* SCHLEICHER 040798 - CORRECT PROBLEM WITH CANCEL (PAYTO SPECIAL)
JS0498* SCHLEICHER 040998 - CHANGE COST PLUS DISCOUNTS TO ALLOW A NET
JS0498*                     DISCOUNT FOR DIRECT BILL XTNS.  (CHANGED TO
JS0498*                     MATCH FOCUS)
JS0598* SCHLEICHER 050698 - CORRECT PROBLEM WITH TRAILER NR FLAG = 'E'.
JS0598*                     IT WAS NOT WORKING ON POS TRANSACTIONS.
CP0598* C. PRYOR   050698 - REMOVE COPYBOOK AND REFERENCES FOR "SETTLEC"
CP0598*                     ("OLD SETTLEMENT")
CP0698* C. PRYOR   061898 - PRJ#558 - ADD UNIT POOL MASTER CODE
JS0798* SCHLEICHER 072398 - GENERIC CREDIT FUEL
JS0898* SCHLEICHER 081798 - CORRECT PROBLEM WITH GOLD CARD FUEL PURCHASE
MP0898* M. PERRY   081798 - PRJ # 543 - MAESTRO POS
JS0998* SCHLEICHER 081798 - COMSITE BATCH
CP1098* C. PRYOR   100298 - PRJ#672 -(SCHNEIDER) ADD NEW COST PLUS FLDS
CP1098*                                              ADJUSTMENTS FIELDS
CP1098*                                              SUB NETWORK GROUP
CP1098*                                              MULT. COMPANY STD
CP1098*                                          REMOVED PRMDLPM LOGIC
JS1098* SCHLEICHER 081798 - ADDED NO FEE FLAG AND PROCESSING
MP1098* M. PERRY   102898 - ADDITIONAL MAESTRO CHANGES.
JS1198* SCHLEICHER 110698 - IF CUST COUNTRY = 'C ' REPLACE WITH 'CD'
MP1298* M. PERRY   102898 - ADDITIONAL MAESTRO CHANGES.
JS1198* SCHLEICHER 113098 - AUTO CARD ACTIVATE
JF1298* SCHLEICHER 122098 - SCHNEIDER FIXES
ED0199* E. DUGAN   010499 - CHANGE NATSLOG FILE LOGIC
JS0299* SCHLEICHER 011599 - CORRECTED PROBLEM WITH PO OVERRIDE AND PRODS
JSA199* SCHLEICHER 012199 - IF VERIFY-UNIT = 'N' IGNORE UNIT USED AMTS
CP0399* C. PRYOR   030899 - FIX TO NOT SEND ERROR FOR ITP2 AND PS42
CP0399* C. PRYOR   032299 - ADD NUMERIC CHECKS - FIX ASRA
CP0499* C. PRYOR   040299 - MOVE PERFORM OF PARAGRAPH
CP0499*                     20350-CALC-COST-FOR-TERM-FUEL
MP0599* M. PERRY   051299 - NATS REORG WEEKLY
MP0599* M. PERRY   051299 - PETRO RECEIVABLES CORRECTION.
CP0599* C. PRYOR   051499 - COMMENT OUT RESRTICING DIESEL AND OTHER
CP0599*                     FUEL AT UNATTENDED LOCATIONS WHEN
CP0599*                     CDN-REFER-ONLY = 'Y'
JS0699* SCHLEICHER 060599   CHANGED TO ALWAYS COMPUTE CANADIAN TAX
MP0699* PERRY      061499 - SEND A VALID RESPONSE WHEN FILES ARE CLOSED
MP0699*                     ON TCP/IP TRANSACTIONS.
JS0699* SCHLEICHER 063099   CHANGED CANADIAN TAX RATES
CP0799* C. PRYOR   071599 - FIX PROBLEM W/ RETAINED PREFERRED DISCOUNTS
MP0799* M. PERRY   071999 - ALL ACCESS TO CASH ON CARD AND EXPRESS CASH
ED0899* E. DUGAN   081699 - EXPAND IOL PRODUCT CODE
JS0999* SCHLEICHER 090699 - CONVERT RETAIL PPG STORED IN FMLOG TO BE
JS0999*                     STORED IN THE CURRENCY OF THE COMPANY
JM0999* - - - - - - - - - - - - - - - -- - - - - - - - - - - - - - - -
JM0999* 09/22/99 J. MAPLES - SPC - CHANGED CREDITL COPY BOOK TO
JM0999*                            EXPAND SELECTED NUMERIC FIELDS
JM0999* - - - - - - - - - - - - - - - -- - - - - - - - - - - - - - - -
JS1099* 10/04/99 SCHLEICHER- CORRECTED CANADIAN CHECK AND VRU PROBLEM.
MP1099* 10/18/99 M PERRY   - CORRECT EFS ATM INQUIRE FEE
MP1199* 11/01/99  M. PERRY   RECOMPILED FOR SIGN ON AMOUNT IN TSXCW030
JS1199* 11/28/99 SCHLEICHER- MASTER CARD PROJECT
MP1299* 12/08/99 M PERRY     CORRECT A PROBLEM WITH MAESTRO SURCHARGES
MP0100* 01/07/00 M PERRY     CORRECT PURCHACE AMOUNT AVAILABLE FOR
MP0100*                      QUICK FUEL PRE-AUTH.
MP0200* 02/02/00 M PERRY     DECLINE ATM TRANSACTIONS WHEN A FILE
MP0200*                      PROBLEM OCCURS.
JS0200* 02/02/00 SCHLEICHER  CHANGED TO USE COMPANY STANDARDS CASH ON
JS0200*                      CARD FLAG INSTEAD OF CDNCUST.
JS0200* 02/10/00 SCHLEICHER  CHANGED TO USE FLEET FLAT FEE ON FLEET XTNS
JS0200* 02/15/00 SCHLEICHER  ADJUST DRIVER NUMBER IF FLEET CUSTOMER
MP0200* 02/21/00 M PERRY     CORRECT PROBLEM OF BILLING FOR ATM DECLINE
MP0200*                      WHEN FUEL TURNED OFF.
JS0200* 02/23/00 SCHLEICHER  CORRECTED PROBLEM WITH FUEL PRICE UPDATES.
JS0200*                      SCFUELP WAS NOT GETTING UPDATED
JS0300* 03/03/00 SCHLEICHER  ADDED MASTERCARD XTN TIME
CP0300* 03/10/00 C.PRYOR     UNIT VERIFY 'N' - IF SPACES IN
CP0300*                      PRM-UNIT-NUMBER CLEAR PRM-FP-CARD-NO
MP0300* 03/13/00 M.PERRY     ADJUST FOR AVAILABILITY OF SPECIFIC
MP0300*                      PRODUCTS WHEN DOING A PRE-AUTH.
MP0300* 03/21/00 M.PERRY     DO NOT ALLOW REFER ON PRE-AUTH WHEN BLOCKED
JS0400* 04/05/00 SCHLEICHER  HARD-CODE PAM TRANSPORT TO NOT SHOW ZERO IN
JS0400*                      FUEL FEE IF FUEL AND CASH WAS PURCHASED
CP0400* 04/20/00 C.PRYOR     PRJ# 758 - PAC PRIDE - ALLOW FOR PERCENT
CP0400*                      OF FACE FUEL FEES AND SERVICE CENTER CORP.
CP0400*                      REBATES
JS0500* 05/04/00 SCHLEICHER  - CORRECTED PROBLEM WITH POS CANCEL AND
JS0500*                         SC MASTER CODES
JS0500*                      - CORRECTED PROBLEM WITH LINK TO CXXCO0PL
JS0600* 06/01/00 SCHLEICHER  - CHANGE UNIT VERIFY LOGIC FOR FLEET XTN
JS0600* 06/08/00 SCHLEICHER  - ADDED ADDR AND ZIP TO FMLOG
CP0600* 06/22/00 C.PRYOR     PRJ# 758 - NEW SIR-DI-FEE-TYPE
MP0600* 06/12/00 M PERRY     - PETRO CANADA
CP0700* 07/20/00 C.PRYOR     - INCLUDE CASH IN "PERCENT OF FACE" SC
CP0700*                        RATE CALCULATIONS
JS0700* 07/24/00 SCHLEICHER  HARD-CODE TT984 TO NOT SHOW ZERO IN
JS0700*                      FUEL FEE IF FUEL AND CASH WAS PURCHASED
073100* 07/31/00 C.PRYOR     - RE-EXCLUDED CASH FROM "PERCENT OF FACE"
073100*                        SC RATE CALCULATIONS
CP0800* 08/15/00 C.PRYOR     - PRJ.#825 - ADD SC CASH ADD-ON FEE
MP0800* 06/01/00 M. PERRY    - BILL SAVINGS AND CREDIT CARD
JS0900* 09/15/00 SCHLEICHER  - CORRECTED PROBLEM WITH CREDIT PREAUTH AMT
MP0900* 09/21/00 M. PERRY    - RETURN DATE FOR PETRO CANADA
JS1000* 10/20/00 SCHLEICHER  - DON'T USE COST PLUS FOR SCHNEIDER IC DRVR
JS1000*                      - FOR SUB-NETWORK 999 OPEN ALL PRODUCTS
030601* 03/06/01 J HUNTER    - ENHANCEMENTS TO SCFUELP FILE UPDATE LOGIC
JS0401* 04/01/01 SCHLEICHER  - CORRECTED PROBLEM WITH CUSTID RETURNED TO
JS0401*                        SERVICE CENTER
JS0401* 04/02/01 SCHLEICHER  - DB2 CONVERSION
MP0401* 04/11/01 M PERRY     - ADD SPECIAL INTRA-DAY FOR MASS CONNECTION
JS0601* 06/19/01 SCHLEICHER  - IGNORE UNIT LENG EDIT FOR 'C' UNIT VERIFY
MP1001* 10/11/01 M PERRY     - ADD EMAIL DEBIT FROM CASH ON CARD
JS1101* 11/11/01 SCHLEICHER  - MASTERCARD CARD RENEWAL
ED1101* 11/12/01 E DUGAN     - INSTANT CREDIT NOTIFICATION
ED0102* 01/21/02 E DUGAN     - PASS CREDITL UPDATES TO MSG HANDLER
ED0102* 01/21/02 E DUGAN     - PASS PRMCARD UPDATES TO MSG HANDLER
MP0302* 03/13/02 M PERRY     - CORRECT E-MAIL CASH ADVANCE
MP0402* 04/09/02 M PERRY     - ALLOW ATM REVERSAL AFTER 2 HOURS
CC0502* 05/07/02 CHAFIN      - ADD US FLEET - MOBIL FUELING LOGIC
JS0702* 08/16/02 SCHLEICHER  - DON'T CHARGE FEE FOR TA ON CASH ONLY
JS0802* 08/02/02 SCHLEICHER  - ADDED SYNCPOINT AND CHANGED CARD ENQ
MP0902* 09/30/02 M PERRY     - MASTERCARD DIRECT
ED1102* 11/23/02 E DUGAN     - ADD REPORTING LEVELS TO FMLOG
CC0303* 03/04/03 CHAFIN      - 1.ADDED 3 NEW BATCH STAND-IN INPUT FIELDS
      * 03/20/03 CHAFIN      - DON'T FORCE 'W' SRV-TYPE FOR STAND-IN
JS0303* 03/06/03 SCHLEICHER  - ADDED A FORMATTED RESPONSE FOR BATCH FUEL
MP0303* 03/26/03 M PERRY     - ADD PSA1 F NEW DIAL THROUGH TCP/IP
CC0403* 04/16/03 CHAFIN      - FIX FMBP 'FUEL PRICE ERROR' CHECKING
CC040A* 04/24/03 CHAFIN      - FIX WH 'FUEL PRICE ERROR' CHECKING
CC040B* 04/25/03 CHAFIN      - FMLOG EXPANSION
062403* 06/24/03 J HUNTER    - SETINFO FIELD EXPANSION, RECOMPILE ONLY
JS0803* 08/06/03 SCHLEICHER  - CORRECTED PROBLEM WITH BLANK PROD CODES
JS0803*                      - CHANGED CXUTS0EL TO PRODUCE A DUMP
CC0803* 08/08/03 CHAFIN      - MOBIL FUEL ENHANCEMENTS
091003* 09/10/03 J HUNTER    - ROLL UP OF PENDING COMDATA COMPLETE STATU
MP0903* 09/20/03 M PERRY     - ATM STANDIN ON TANDEM
EJ1203* 11/15/03 E JONES     - FMRELAT CONVERSION - RECOMPILE ONLY
JS1203* 12/04/03 SCHLEICHER  - CUSTID CONVERSION FOR FPMASTR
JF1203*                      - CORRECTED CANADIAN XTN DUP CHECK
ED1203* 12/18/03 E DUGAN     - ADD PRMPIN FOR PIN
JS0304* 01/27/04 SCHLEICHER  - CORRECT ASRA ABEND WITH USILOG GALLONS.
JS0304*                        CORRECT PROBLEM WITH CREDIT TRUNCATION
MP0204* 02/24/04 M PERRY     - ADD NO VERIFY TRANSACTION FOR ACCOR
MP0404* 04/19/04 M PERRY     - DO NOT CHECK CREDIT ON BALANCE BASED
JS0604* 06/01/04 SCHLEICHER  - PRODUCT CODE EXPANSION
MP0704* 07/08/04 M PERRY     - ADDITIONAL PRODUCT CODE CHANGES
JS0804* 08/25/04 SCHLEICHER  - REMOVED THE NEED FOR CREDIT OVERRIDE FOR
JS0804*                        XTNS OVER $1,499.99.
MP1004* 10/29/04 M PERRY     - CUST ID EXPANSION
MP1204* 12/13/04 M PERRY     - CORRECT PRODUCT CODE IN INTRA-DAY RECORD
MP0105* 01/06/05 M PERRY     - CORRECT PRODUCT DAILY MAX ERROR
MP0105* 01/06/05 M PERRY     - ADD TRANSACTION PSD1 FOR TCP/IP POS
MP0205* 02/17/05 M PERRY     - CORRECT XXXXX ON MCAUTH
MP0205* 02/22/05 M PERRY     - CORRECT BALANCE BASED CANCEL CHARGES
CP0405* 04/28/05 C PRYOR     - CHANGE START OF FPLG TO PUT TO MQ QUEUE
ED0505* 05/13/05 E DUGAN     - ADD NEW PRODUCTS TO NATS PROD TABLE
CP0505* 05/23/05 C PRYOR     - USE MQ FOR FPLG ON FP CANCEL
EJ0505* 05/24/05 E JONES     - BP ON US
MP0605* 06/13/05 M PERRY     - CORRECT FP CANCEL ON NON SETTLE LOC
CP0605* 06/28/05 C PRYOR     - INITIALIZE DRIVER NAME FOR VEHICLE CARD
MP0705* 07/15/05 M PERRY     - BP INTERUM
MP0705*                           ADD OTHER FUEL SUB PRODUCT CODE
MP0705*                           REMOVE PRMABUP PRMBBUP
MP0705*                           CHECK BATCH LOAD FLAG BEFORE REREADING
MP0705*                           PRMCARD
072705* 07/27/05 J HUNTER    - VEHICLE CARD MAINTENANCE: LINK TO
072705*                        CXXCO0OH WITH FPMASTR BEFORE/AFTER
JS0705* 07/29/05 SCHLEICHER  - ALLOW 10 DIGIT UNIT FOR BATCH (FMMP)
MN0905* 09/22/05 M.NEWTON    - WR# 715 PASS QUICK FUEL MERCHANT NUMBER
MN0905*                        TO SETINFO.
MN0905*                        PT# 2005.10.20.047-AC05 - EXPAND
MN0905*                        WS-TOTAL-PRICE TO CORRECT A
MN0905*                        CALCULATION TRUNCATION.
MN0905*                        CORRECT NATS AUTH ABEND ERRORS.
MP1105* 11/29/05 M PERRY       CORRECT PROCESSING OF PO OUT OF NETWORK
MP1105*                        ON THE SMART FUEL PRE-AUTH
MN1205* 12/07/05 M.NEWTON      WR# 814 - COKE LEADING ZERO ON UNIT
MP0106* 01/19/06 M PERRY       RECOMPILE WITH CORRECT TSXCW030 COPYLIB
MB0106* 01/26/06 M BOWEN       ADD WRITE TO ITDQ FOR MC INTRA-DAY
JS0206* 02/25/06 SCHLEICHER    PRODUCT FEES PROJECT
040606* 04/05/06 J HUNTER      USE CDN BLOCK #2 DIESEL FLAG
EJ0406* 04/10/06 E JONES       BP PLAN C - ADD BIN LOGIC
ED0406* 04/12/06 E DUGAN       ENQUEUE REPLACEMENT
CP0406* 04/19/06 C PRYOR       ULSD - ADD LOGIC FOR SUB PROD CODES
JS0606* 06/11/06 SCHLEICHER    ADDED NETW BY CARD BOTH OPTION FLAG
JS06J6* 06/13/06 SCHLEICHER    ADDED .75 GALLON ALLOWANCE ON NETW BY CRD
ED0606* 06/14/06 E DUGAN       SAFEWAY ENCASHMENT
MN0606* 06/22/06 M.NEWTON    - WR468 - SCHNEIDER FMRM 04 MODIFICATIONS
ED0606* 06/28/06 E DUGAN       ADD SUB PRODUCT HDR FOR CANADIAN
CP0706* 07/05/06 C PRYOR       CHECK FUEL + GST FOR > 999.99
MP0706* 07/26/06 M PERRY       ADDITIONAL CHANGES FOR SAFEWAY ENCASHMENT
ED0906* 09/27/06 E DUGAN       DYNAMIC BINS 1.2
ED1206* 12/04/06 E DUGAN       FIX IOL INVALID CARD NR
ED1206* 12/06/06 E DUGAN       FIX SYSTEM UNAVAILABLE MSG
JS0107* 01/16/07 SCHLEICHER    ADD DEFAULT PRODUCT FEE LOGIC.
JS0107* 01/16/07 SCHLEICHER    REMOVE SCHNEIDER HARD CODE FOR COST PLUS
SB0107* 01/29/07 S BOLING      US RELEASE
MB0207* 02/05/07 M.BOWEN       US RELEASE - TMI MC INTRA-DAY
MN0207* 02/05/07 M.NEWTON      US RELEASE
CP0207* 02/19/07 C.PRYOR       IVR REPLACEMENT
MP0407* 04/23/07 M PERRY       FIX PROB WITH NO PRDLMIT RECORD.
CP0807* 08/01/07 C PRYOR       FPMASTER REPLACEMENT
JS0907* 09/05/07 SCHLEICHER    CORRECTED THE RESPONSE FOR LARGE $ TXNS.
MN0907* 09/20/07 M.NEWTON      INCIDENT 29293 - CORRECT LIMITED NETWORK
MN0907*                                         BY GROUP ERROR.
KB1007* 10/01/07 K BRUCE       GSA CROSS BORDER #10055 PRJ06216
KB1007*                          ADD XBORDER FEE CALCULATION
BW1207* 12/20/07 B WEBB        INCIDENT 36110 - SMART FUEL PREAUTH FIX
CP0208* 02/26/08 C PRYOR       FIX ADF-FP-ID-NR FOR CANCELS (CHK DIGIT
CP0208*                         NOT SET)
CP0208* 02/28/08 C PRYOR       ADD ODR-PREMIER-CARD NUMERIC CHECK
CP0308* 03/04/08 C PRYOR       CORRECT READ TO UNITMST ON CANCEL
021908* 02/19/08 J HUNTER      GSA/HIERARCHY PROJECT
MB0408* 04/02/08 M BOWEN       INCIDENT 36114 FORCE POST TRANSACTIONS
MB0408*                           REJECTED FOR INVALID UNIT
KB0408* 04/11/08 K BRUCE       GSA CROSS BORDER #10055 ADDITIONS WITH
KB0408*                        HIERARCHY PROJECT  PRJ06305
KB0408*                          ADD FM1/12 FLAGING USING TSFMW001.ADF-
KB0408*                          CIR-MAESTRO-INTL-FLAG IN PLACE OF ADF-
CP0508* 05/13/08 C PRYOR       FIX ISSUE WITH DEQ ON CARD
MP0608* 06/12/08 M PERRY       ADDITIONAL CHANGES FOR HIERARCHY.
MP0608*                        AND CROSS BORDER
DS0608* 06/20/08 D STRICKL     FIX ON DRIVER INFOR/ VEHICLE CARD
DS0608* 07/08/08 K BRUCE       ADDITIONAL CHANGES FOR CROSS BORDER
KB0708*  (021908 THRU KB0708 WILL IMPL ON 08/10/08 W/ HIERARCHY)
082008* 08/20/08 J HUNTER      FUEL > 999, INTERIM
MN1008* 10/20/08 M.NEWTON      WR2241-DONLEN MASTERCARD PIN ENTRY AND
MN1008*                        INCIDENTS 48353, 54085, 56807 AND 59340.
MN1108* 11/20/08 M.NEWTON      DRAFT COMCHEK PURCHASING - PROJECT 10713
CW1108* 11/25/08 C.WALKER      REBATES AND DISCOUNTS
MP1208* 12/11/08 M PERRY       INCIDENT 80714 FIX PRE-AUTH CREDIT.
JS0109* 01/09/09 SCHLEICHER    CHANGED NETWORK BY CARD GALLON VARIANCE
JS0109*                        FROM 0.75 TO 5.00
      *** THE FOLLOWING CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
062209* 06/22/09 J HUNTER      CHG TIME-LIMIT-CHECK TO CHK FOR DUP TRANS
062209*                        ON FUEL AND PRIVATE LABEL GROCERY ONLY
062609* 06/26/09               KEEP CARD SWIPED/KEYED FLAG ON FMLOG
070909* 07/09/09               MAKE CARD ONE TIME OFF NETWORK WORK SAME
070909*                        AS FMRM 02 ONE TIME FLAG
071009* 07/10/09               USE CANADIAN GST TAX IN FUEL > 999 LOGIC
071409* 07/14/09               USE PROMPTED ID TO VALIDATE PIN POOL
071509* 07/15/09               DISALLOW VIRTUAL CARD AT PROPRIETARY LOC
071609* 07/16/09               FIX FOR CURRENCY ISSUES, PRM- USED AMTS
080309* 08/03/09               ZERO OUT CASH ADVANCE FEE FOR PETRO CHAIN
CP0809* 08/03/09 C PRYOR       ADD DEBUG LOGGING XCML FOR COST PLUS
092009* 09/20/09 J HUNTER      CORRECTION TO LENGTH OF WS-Q-AREA
      *** THE PRECEDING CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
CP1109* 11/19/09 C PRYOR       MORE DEBUG LOGGING XCML FOR COST PLUS
112409* 11/24/09 J HUNTER      CORRECT SCREEN EXIT ON DUPLICATE ERROR;
112409*                        ADD NATS PRODUCT CODES 24 AND 25
091509*** THIS CHG WAS MOVED ASIDE FOR PREV CORRECTIONS
091509* 09/15/09 J HUNTER      GLOBAL CREDIT PROJECT, CREDITL -> DB2
CP0110* 01/07/10 C PRYOR       ADD DEBUG LOGGING CONDITIONS
040510* 04/05/10 J HUNTER      SWITCH REPLACEMENT PROJECT, RELEASE 4
CP0710* 07/21/10 C PRYOR       INC 214323 - NOT LOGGING EXPANDED UNIT
CP0710*                        NUMBER (UNIT VERIFICATION "N"); LOST
CP0710*                        IN UNITMST CONVERSION
080210* 08/02/10 J HUNTER      IRIS PROPRIETARY PROJECT
      *** THE FOLLOWING 5 CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
083010* 08/30/10 J HUNTER      SWITCH REPLACEMENT PROJECT, RELEASE 6
083110* 08/31/10 J HUNTER      IRIS CORRECTIONS AND ENHANCEMENTS
CP0910* 09/01/10 C PRYOR       INC 215028 - ISSUE W/ CN PROD PRE-AUTH
CP0910* 09/01/10 C PRYOR       INC 213603 - ISSUE W/ CN FUEL PR VERIFY
090310* 09/03/10 J HUNTER      WR 2758 - BATCH FUEL COST PLUS DT LOGIC
      **********
      *** THE FOLLOWING 4 CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
102110* 10/21/10 J HUNTER      FIX HIERARCHY PRODUCT LIMITS LOGIC
102510* 10/25/10 J HUNTER      FIX PRE-AUTH CHK WHEN BALANCE = FEE AMT
102810* 10/28/10 J HUNTER      ALTERNATIVE FUEL PROJECT
123010* 12/30/10 J HUNTER      CHG FOR IRIS COUNTRY CODE
      **********
020711* 02/07/11 J HUNTER      FOLLOWUP CORRECTIONS, ALTERNATIVE FUEL
BW0211* 02/14/11 B WEBB        MASTERCARD DEBIT RELEASE 11.1
ED0311* 03/02/11 E DUGAN       FIX PROPRIETARY FLEET LIMITS STAND IN
JS0311* 03/07/11 SCHLEICHER    COMPUTE SC POF FEE USING GROSS LESS DISC
MP0411* 04/07/11 M PERRY       CHANGE TO PUT SETINFO TO MQ QUEUE
041111* 04/11/11 J HUNTER      CORRECTION TO MOBILE FUEL HUB EDITS
051611* 05/16/11 B WEBB        WORK REQUEST RELEASE 2011_1 & 2011_2:
052311*                        3369 - GST TAX OVER $99.99
      *                        3424 - VARIOUS INCIDENTS:
052611*                           256926 - LARGE XTNS CONVERSION ISSUES
052711*                           NONE   - DUE TO ROUNDING, SOMETIMES
052711*                                    THE SPLIT XTN TOTAL DOLLAR
052711*                                    AMOUNTS ARE OFF BY $.01.
MN0611*                           233483 - FORCE POST FIX FOR DUP. XTNS
MN0611*                           268777 - XTN SHOWING CANCELLED ON SETL
072611*                           278415 - PRE-AUTH HUB MIN/MAX FIX
072711*                        3384 - ALLOW PREAUTH ON KEYED IN CARD NBR
072811*                        3514 - CANADIAN ICA PROJECT CHANGES
MB0911* 09/27/11 M BOWEN       CANADIAN ICA - REPLACE FCUR WITH CXXCO0CL
JS1111* 11/03/11 SCHLEICHER    ADDED ALT-FUEL DISC APPLIES FLAG LOGIC
J11111* 11/21/11 SCHLEICHER    CORRECTED ALTFUEL DISC APPLIES FLAG LOGIC
      *** THE FOLLOWING 4 CHANGES ARE INCLUDED IN A SINGLE PROD RELEASE
091211* 09/12/11 J HUNTER     STABILITY CHANGES, TO STANDARDIZE ABEND
091211*                       ROUTINES AND REMOVE CUSTID REFORMAT
091411* 09/14/11 J HUNTER     PILOT/LOVES NETWORK PRICING
CP1011* 10/28/11 C PRYOR      CONTROL NUMBER EXPANSION
CP1011*                       INC 297087
MP1011* 11/07/11  M PERRY     STREAMLINE DATE CHANGE - SETTLEMENT
MP1011*                       PROCESS
      **********
013112* 01/31/12 J HUNTER     CANADIAN ICA PCR, IRIS PROCESS CHANGES
020712* 02/07/12 J HUNTER     PILOT/LOVES NETWORK PRICING PCR
022012* 02/20/12 J HUNTER     HANDLE NETWORK PRICING FOR LARGE SPLIT TRX
022112* 02/21/12 J HUNTER     CANADIAN ICA PCR, CREDITL CURRENCY CHGS
040912* 04/09/12 J HUNTER     ECASH IRIS INTEGRATION PROJECT
040912*                       AND INCIDENT TICKETS 306403, 309208
041112* 04/11/12 J HUNTER     CARDLESS SOLUTIONS PHASE 1B
050712* 05/07/12 J HUNTER     NETWORK PRICING FILE SIZE CHG REQUEST
052912* 05/29/12 J HUNTER     FIX SP14 TRAILER LIMITS ON RFID TRANS
060512* 06/05/12 J HUNTER     ADJ TO NETWORK PRICING FOR REBATED DISC
061212* 06/12/12 J HUNTER     NETWORK PRICING CURRENCY CORRECTIONS
JS0712* 07/10/12 SCHLEICHER   MODIFIED TO PROCESS ATM ON FLEET LIMITS
ED0712* 07/17/12 E DUGAN      ECASH IRIS INTEGRATION PROJECT PCR
MN0712* 07/31/12 M.NEWTON     3974-COMSITE II-INVALID CHECK NUMBER
082212* 08/22/12 J HUNTER     FUEL FINDER WORK REQUEST
MB0912* 09/13/12 M BOWEN      IN330812 CANADIAN TRANS DIRECT BILL FUNDED
MB1012* 10/01/12 M BOWEN      CARDLESS PHASE 2.1
MB1112* 10/18/12 M BOWEN      CARDLESS PHASE 2.2
113012* 11/30/12 J HUNTER     ADD RFR RACK PPG TO TSFMO0GD COMMAREA
120412* 12/04/12 J HUNTER     CORRECTION TO SPLIT TRANS FMLOG DISCOUNT
MP0113* 01/02/13 M PERRY      CORRECT DATE FORMAT FOR
MB0113* 01/08/13 M BOWEN      FLEET STORY 1 - REMOVE CARDLESS 1HR LOGIC
SB0113* 01/14/13 S BOLING     FLEET STORY 14- INC0025567 ATM SURCHG FIX
ED0113* 01/17/13 E DUGAN      FLEET STORY 15- INC0021347 & INC0023481
ED0113* 01/18/13 E DUGAN      FLEET STORY 12 TRUNCATION > 999
ED0213* 02/20/13 E DUGAN      FLEET STORY 27 RFID CASH W/MIN FP QTY
MN0313* 03/11/13 M.NEWTON     FLEET STORY 13 - US GST SPLIT
SB0313* 03/22/13 S.BOLING     FLEET STORY 23 - FP CANCEL CHANGE FOR
      *                       CARD MOVE.
MN0413* 04/02/13 M.NEWTON     SPRINT 5-STORY 52-SPLIT ON GST
SB0413* 04/29/13 S.BOLING     SPRINT 6-STORY 75-
      *                       RFID LAST PURCHASE DATE INITIALIZATION
SB0513* 05/08/13 S.BOLING     FLEET STORY 46 - AUTH LIMIT CHANGES
      *                       RFID LAST PURCHASE DATE INITIALIZATION
SB0713* 07/14/13 S.BOLING     FLEET STORY 46 - FIX OTHER FUEL USED AMOUT
072213* 07/22/13 S.BOLING     FLEET STORY 88 - TERMINAL FUEL OVERRIDE
072313* 07/23/13 S.BOLING     FLEET STORY 46 - FIX OTH USED CALC
SB0813* 08/30/13 S BOLING     FLEET STORY B03217 - FIX OTH ASRA ABEND
MB1013* 10/29/13 M BOWEN      FLEET B03922 - FMRM 02 MANUAL FP TRANS
MB1013*                       FLEET B03924 - ADD 20000 LEVEL LIM FOR MC
MB1013*                       ALSO, FIX INC0082897
MB1113* 11/07/13 M BOWEN      FLEET B03928 - CARD EXPIRATION REMAINS
MB1213* 12/02/13 M BOWEN      FLEET B03382 - DRAFT REGISTRATION VIA IVR
MB0114* 01/06/14 M BOWEN      FIX FOR PROD ABENDS (LEN OF Q-COMMAREA)
BG0114* 01/27/14 B GANN       FLEET B-02951 - XCDM EXCLUSIONS
SB0114* 01/28/14 S BOLING     FLEET B-04531 - CAN TAXES AFTER DISCOUNTS
SB0214* 02/26/14 S BOLING     FLEET B-04531 - CHG DISCOUNT FIELD USED
022714* 02/27/14 S BOLING     FLEET B-04531 - PASS CTRL# TO TSFMO0CT
030114* 03/01/14 S BOLING     FLEET B-04531 - MORE CAN TAX CHANGES
030514* 03/05/14 S BOLING     FLEET B-04531 - ADD CHECK OF RMR-NATS-FLAG
030614* 03/06/14 S BOLING     FLEET B-04531 - ROUND US TAX ON FMLOG.
SB0414* 04/16/14 S BOLING     FLEET D-01172 - STOP CANADIAN TAX CALC FOR
SB0414* 04/16/14              TA TRAVEL CENTERS.
SB0514* 05/05/14 S BOLING     D-01144 - FIX ISSUE WITH PRICING FILE
SB0514*                       DISCOUNTS WHEN GETTING DISCOUNT BY PRODUCT
SB0614* 06/10/14 S BOLING     FLEET OTR - MERCHANT SURCHARGE EFFORT 1
072314* 07/23/14 B WEBB       SPLIT TAXES ON SPLIT XTNS BY PRODUCT CODE
MB0714* 07/24/14 M BOWEN      FLEET B-08304 USE FMRACKH RACK HIST FILE
SB0814* 08/04/14 S BOLING     FLEET OTR - FMRM SUB PRODUCT CODE LIMITS
SB0814*                                 - MERCHANT SURCHRG DUP TRNS FIX
SB0814*                                 - MERCHANT SURCHRG EXP PRODUCTS
080614* 08/06/14 S BOLING     FLEET OTR - CHK COMCASH FLG FOR PREPAID
081414* 08/14/14 S BOLING     FLEET OTR - SP14 ADD CUST DATA TO RESPONSE
ED0814* 08/14/14 E DUGAN      FLEET OTR - EXCLUDE DIAL SP14 CUST DATA
MN0814* 08/18/14 M.NEWTON     TK20885 AND TK21831 - ADDITIONAL FIELDS TO
MN0814*                       IRIS MQ
SB0914* 09/03/14 S BOLING     FLEET OTR - SP14 ADDITIONAL CHANGES.
ED0914* 09/08/14 E DUGAN      FLEET OTR - QA FIND COMCASH FLAG
091614* 09/16/14 S BOLING     FLEET OTR - SET MAX QTY TO 99999 DEFAULT.
091914* 09/19/14 S BOLING     FLEET OTR - COMCASH FIX FOR BALANCED BASED
092214* 09/22/14 S BOLING     FLEET OTR - CURRENCY CONV OF QUANTITIES
092414* 09/23/14 S BOLING     FLEET OTR - FIX MULTIPLE PRODUCTS IN ONE
092414*                       CATEGORY ON SP14 WITH FLEET LIMITS = Y
SB1014* 10/06/14 S BOLING     FLEET OTR - FIX SP14 20000 LEVEL QTYS
100914* 10/09/14 S BOLING     FLEET OTR - UNIT GROUP CHANGES.
101014* 10/10/14 S BOLING     PROGRAM DEBT CHANGES.
ED1014* 10/22/14 E DUGAN      FLEET OTR - ADDITIONAL UNIT GROUP CHANGES
101314* 10/13/14 S BOLING     FLEET OTR DEFECT D-01602. (INC0130174)
101314*                       ONE TIME CASH ADVANCE ERROR.
102414* 10/24/14 B WEBB       FIX FOR CHANGE MADE 072314
102714* 10/27/14 S BOLING     FLEET OTR - B-01580 SPLIT DISCOUNT IN
102714*                       INTRADAY TRANSACTIONS
SB1114* 11/06/14 S BOLING     FLEET OTR DEFECT D-01142. (INC0087893,
SB1114*                       INC0114534, INC0096653) BALANCED BASED
SB1114*                       PRICING FILE DISCOUNTS DO NOT SHOW IN
SB1114*                       SALES JOURNAL AS FOCUS DISCOUNTS.
111814* 11/18/14 S BOLING     FLEET - B-11079 POPULATE NEW FMLOG FIELDS
111814*                       MISC 3 & TANK CAPACITY.
112014* 11/20/14 S BOLING     FLEET OTR - B-10123 RESET LIMITS AFTER
112014*                       ONE TIME LIMIT ON FMRM.
112514* 11/25/14 B WEBB       FIX SONAR ISSUE - CRITICAL - RECURSION
120914* 12/09/14 B WEBB       FLEET - B-11459 - 'P' PRICING FILE OPTION
SB0115* 01/20/15 S BOLING     FLEET B-11819 MINIMUM AND GALLON UP FEES
012315* 01/23/15 B WEBB       D-01975 - ISSUE W/ CAN SPLIT XTN'S W/ DISC
013015* 01/30/15 S BOLING     D-01995 - UPDATE OTHER USED QTY ON PRMINFO
013015*                       ON FP CANCEL TRANS.
SB0315* 03/17/15 S BOLING     D-12740 - FUEL UP
SB0415* 04/10/15 S BOLING     D-12740 - FUEL UP CALCULATION CHANGE
SB0615* 06/15/15 S BOLING     D-02384 - FUEL UP CORRECTION OF DAILY
SB0615*                       CREDIT LIMIT.
SB0615*                       D-02383 - FUEL UP FP CANCEL FIX.
061615* 06/16/15 S BOLING     D-12579 - IGNORE FUEL LIMIT CHECK IF
061615*                       PRODUCT NOT PURCHASED.
061715* 06/17/15 S BOLING     B-13958 - RETURN AVAILIBLE AMOUNT ON SP08
061715*                       WHEN FUEL FLAGGED NO AND PRODUCTS PURCHASE
061815* 06/18/15 S BOLING     D-02365 - CANADIAN TAX CORRECTION ON
061815*                       SPLIT TRANSACTIONS.
SB0715* 07/09/15 S BOLING     D-02365 - CHG SPLIT LOGIC FOR AUTO CALC=Y
072315* 07/23/15 S BOLING     D-02507 - PUT OTHER FUEL ON LAST SPLIT TRN
MB0715* 07/27/15 M BOWEN      D-02452 - DON'T USE FMRACKH RATE > 90 DAYS
MB0715* 07/29/15 M BOWEN      B-15085 - FUEL UP PPG UPDATE TIMEFRAME
ED0815* 08/31/15 E DUGAN      B-15146 - CARD PRE VALIDATION - CLC
BG0915* 09/24/15 B GANN       B-16348 - CLC CANCEL
SB1115* 11/19/15 S BOLING     D-02806 - SP14 FUEL=N PRODUCT=Y FIX
DR1115* 11/19/15 D REED       B-17358 - MOBILE FUEL PRICE VALIDATION
SB0116* 01/26/16 S BOLING     D-02922 - ALLOW MASTERCARD MINIMUM FEES
SB0116*                       D-02926 - FIX ABEND IN SP14 POPULATION RTN
DR0116* 01/28/16 D REED       B-10334 - ID MATCH NUMBER PROPRIETARY
SB0316* 03/02/16 S BOLING     B-20132 - ALLOW MASTERCARD GALLON UP FEES
042816* 04/28/16 J HUNTER     D-03141 - FIX CAT SCALE TRANS FOR INTRADAY
050316* 05/03/16 J HUNTER     B-18716 - ADD NATS PRODUCT CODES 34 & 35
SB0516* 05/20/16 S BOLING     B-22672 - SMALL FLEET DISCOUNT
SB0616* 06/01/16 S BOLING     B-22763 - ALLOW SECOND TRANSACTION FEE
DR0616* 06/22/16 D REED       D-03186 - DONLEN ISSUE WITH X7 EXPIRATION
080116* 08/01/16 B WEBB       B-24162 - ALLOW HUB TO PASS THROUGH FOR
080116*                       REEFER XTN'S IF IT IS A MOBILE FUEL XTN
PM0916* 09/28/16 P MCLENDON   B-24034 AUTH WITH NET PRICING FILE INSTEAD
PM0916*                       OF FMRM FOR OTHER FUEL PRODUCTS
DR1016*          D REED       COMPLETION OF B-24034
BG1116* 11/18/16 B GANN       NAT STORY B-26840 - PERMIT PRE-AUTH
DR0117* 01/10/17 D REED       B-28010 - HUB VALIDATION FOR REEFER
SB0217* 02/08/16 S BOLING     B-28572 - COMCHEK MOBILE LIMITS
DR0317* 03/22/17  D REED      B-29360 - IF PRICE VALIDATION NO DISCOUNTS
CP0417* 04/12/17  C PRYOR     INC0247114 - HUB READING ON UNIT
CP0417*                       GETTING UPDATED ON PRODUCT ONLY PURCHASE
PM0517* 05/02/17 P MCLENDON   B-30701 MOBILE FUEL RATE CUSTOMIZATION
DR0817* 08/04/17  D REED      B-31184 - IF QUANTITY IS BELOW THRESHOLD
DR0817*                                DO NOT VALIDATE THE PRICE
VD0917* 09/13/17  V DEVAPOOJA B-31216 - ONROAD CREDIT TRANSACTIONS DEBIT
VD0917*                       BALANCE CASH ON CARD AVAILABILITY
DR1117* 11/09/17  D REED      B-34229 - SWIFT MOT START TRAN FMTB
VD0218* 02/07/18  V DEVAPOOJA D-04800 FIX FP CANCEL ABEND ONROAD CARD
JS0218* 02/20/18  SCHLEICHER  PRICE FILE USE BUS-RULES TO SPLIT DISC
JSH318* 03/22/18  SCHLEICHER  FLEET COMM B-37084 PRICING REL 'P' FOR
JSH318*                       HUSKY/NEW CSTPLUS USE OPT FOR PRICE FILE
JSH318*   - THIS 'P' OPTION IN PRICE FILE ALREADY EXISTED FOR OTH FUEL
JSH318*     SEE CHANGE BECKY WEBB MADE 120914 (IN POS 1-6)
AT0418*     COPYBOOK CHANGES FOR PILOT PRICING
BG0418* 04/20/18  B. GANN     B-37480 - ADD PRICE FILE COST PLUS
BG0418*                       COMPONENTS TO FMLOG.
CP0618* 06/01/18  C. PRYOR    B-34391 - ALLOW VC FOR BATCH FUEL
JS0618* 06/28/18  JSCHLEICHER D-04903 - HUSKY/SPLIT XTN WITH TAX ISSUE
AT0618* 06/28/18  ATAUNTON    D-04903 - CORRECT MULTI SPLIT ISSUE
AT0918* 09/18/18  ATAUNTON     D-05599 - CORRECT TAX ISSUE
AT1218* 12/18/18  ATAUNTON     D-????? - CORRECT CASH ADVANCE
SR0119* 01/22/19  SRAMDHAVE    B-41729 NAT INFINITY CODES - RECOMPILE
SD0219* 02/26/19  S DIPPIE     B-42740 PILOT CAN TAXES - COUNTING TWICE
SD0719* 07/18/19  S DIPPIE     B-45495 MULTIPLE TRIP NUMBERS
SD0819* 08/02/19  S DIPPIE     D-06438 FIX S0C7 ABEND ISSUE WITH TSFMO0G
SD0919* 09/18/19  S DIPPIE     B-47641 UNIT PHASE US CAPTURE 10 CH UNIT
SD1219* 12/12/19  S DIPPIE     B-41420 FM81, CORRECT CANADIAN TAX 03 REC
SD0320* 03/05/20  S DIPPIE     D-07042 FIX TRANS DECLINE (EXP DATE)
SD0220* 02/13/20  S DIPPIE     B-44804 CORRECT DEFECT IN FM12
PJ0520* 05/14/20  P JAIN       B-52349 NEW WRITE CONTROL CHAR 'M' FOR
PJ0520*                        MOBILE AND 'C' FOR EMV.
DR0620* 06/01/20  D REED       B-51989 CHANGE WHERE PRMINFO WRITE IS
DR0620*                        DONE SO IT WILL NOT CREATE ISSUE IN
DR0620*                        PRMRFLOG FOR BILL AT PICKUP EPIC CHANGES
SD0620* 06/24/20  S DIPPIE     FP-5 FUEL PROXIMITY CHANGES
SD0920* 09/11/20  S DIPPIE     FP-620 UPD EXP DATE WHEN WRITE CTL M OR C
SD1020* 10/15/20  S DIPPIE     FP-812 ADJUST FUEL QTY FROM CXXCO0TE
SD1020* 10/15/20  S DIPPIE     FE-419 EXCLUDE HOLD AMT FOR 1 TIME OFF CS
SD1220* 12/07/20  S DIPPIE     FE-1478 DO NOT UPDATE PRODUCT USED FOR
SD1220*                        1-TIME OFF COMP STANDARD MC CARD
SD1220* 12/07/20  S DIPPIE     FE-1479 FIX INTRADAY REBATE INDICATOR
JS1220* 12/07/20  J SCHLEICHER FE-1369 CANADIAN PILOT PRICING ISSUE
SD0321* 03/03/20  S DIPPIE     FE-2060 CORRECT SP14 REPLY FOR CUSTOMERS
SD0321*                        ON FLEET LIMITS
SD0321* 03/08/20  S DIPPIE     FE-258 SP11 NOT UPDATING PRICE ON SCMM
DR0121* 01/06/21  D REED       FE-1057 VALIDATE CVC1
MP0221* 02/26/21  P MANOJ      FE-2004 CVC1 VALIDATION. HANDLE TRNXS
MP0221*                        THAT DON'T HAVE CVC1 SENT IN.
DR0321* 03/30/21  D REED       FE-2004 IF CHIP USAGE CHG SVC TO 999
DR0321*                        BEFORE VALIDATING CVC1
SD0401* 04/01/21  S DIPPIE     FE-2326 CVC1 - VALIDATE THE CHIP CVC WHEN
SD0401*                        THE CHIP IS READ AT POS SP1, SP8, SP14
PJ0421* 04/15/21  P JAIN       FE-2416 CVC1 - REMOVE THE LOGIC THAT
PJ0421*                        CHANGES A KEYED TO SWIPED
SD0521* 05/20/21  S DIPPIE     FE-2754 CVC1 VALIDATION ADDITIONAL CHANGE
SD0521*                        FOR CHIP SENT IN AS SWIPE
SD0521* 06/16/21  S DIPPIE     FE-3052 CASH ON CARD ATM ADVICE, DO NOT
SD0521*                        DO CVC1 CHECK
MP0821* 08/03/21  MANOJ P      FE-3422-PFJ-CHANGE UPDATE LOGIC OF FIELD
MP0821*                        FMDL-SMFL-DISCOUNT TO MOVE TO TSFMO0CD.
AA0921* 09/08/21  A ALBERT     B-42138 DYNAMIC BIN RANGE
BG0122*********THE NEXT TWO STORIES WILL GO INTO PRODUCTION TOGETHER.
BG0122* 01/11/22  B GANN       FE-3461 - TREAT INACTIVE DRIVER ID AS NOT
BG0122*                        AVAILABLE.
011222* 01/12/22  B GANN       FE-4286 - LINK TO TSFMO0TX FOR TAX EXEMPT
SD0122* 01/06/22  S DIPPIE     FE-4262 CHECK FOR CVC1 ON PRE-AUTH
SD0222* 02/01/22  S DIPPIE     FE-4018 BREAK OUT FUEL TYPE DISCOUNTS
DR0422* 03/31/22  D REED       SE-1077 NALP CVC EPIC
      ******************************************************************

      *==============================
       ENVIRONMENT DIVISION.
      *==============================
      *------------------------------
        CONFIGURATION SECTION.
      *------------------------------
         SOURCE-COMPUTER. IBM-4300.
         OBJECT-COMPUTER. IBM-4300.

      *==============================
       DATA DIVISION.
      *==============================
      *------------------------------
        WORKING-STORAGE SECTION.
      *------------------------------
MB0106 01  WS-TIMESTAMP.
MB0106     05 WS-CURRENT-TIMESTAMP       PIC X(26).
MB0106     05 WS-TIMESTAMP-GMT           PIC X(26).
MB0106     05 WS-GMT-HOURS               PIC S999       COMP-3.
091411     05 WS-TIMESTAMP-NP            PIC X(26).
080210***** 19-CHARACTER TIMESTAMP USED FOR IRIS DATA
080210     05 WS-TS-WORK.
              10 WS-TS-DATE.
                 15 WS-TS-CEN                  PIC  9(02).
                 15 WS-TS-YEAR                 PIC  9(02).
                 15                            PIC  X(01) VALUE '-'.
                 15 WS-TS-MON                  PIC  9(02).
                 15                            PIC  X(01) VALUE '-'.
                 15 WS-TS-DAY                  PIC  9(02).
              10                               PIC  X(01) VALUE '-'.
              10 WS-TS-TIME.
                 15 WS-TS-HOUR                 PIC  9(02).
                 15                            PIC  X(01) VALUE '.'.
                 15 WS-TS-MIN                  PIC  9(02).
                 15                            PIC  X(01) VALUE '.'.
                 15 WS-TS-SEC                  PIC  9(02).
080210     05 WS-TS-DATE-IN               PIC  9(04).
080210     05 WS-TS-TIME-IN               PIC  9(06).

MN0207 01  WS-PRD-ALLOW                PIC S9(05)V99  VALUE ZEROS.
MN0207 01  WS-PRD-CUR-DAY              PIC S9(05)V99  VALUE ZEROS.
ED0213 01  WS-CASH-GALLONS             PIC S9(5)V99         VALUE +0.
DR0317 01  WS-PRC-POS-VARIANCE         PIC S9V9(5) COMP-3 VALUE +0.
DR0422 01  WS-DUP-COUNTER-MAX          PIC S9(05) COMP-3 VALUE 10000.
DR0422 01  WS-NUM-7                    PIC  9(07) VALUE ZEROES.
DR0422 01  WS-NUM-9                    PIC  9(09) VALUE ZEROES.
DR0422 01  WS-NUM-15                   PIC  9(15) VALUE ZEROES.

      *-----------------------------*
      * DB2 COPYBOOKS AND WORK STUFF*
      *-----------------------------*
021908******** ALL INCLUDES EXCEPT SQLCA CHANGED TO COPY
021908******** SO YOU CAN SPECIFY WHICH COPY LIBRARY
JS1199     EXEC SQL INCLUDE SQLCA    END-EXEC.
JS1199     COPY DDRVRGRP.
JS1199     COPY DCUSDRVR.
CP1011     COPY DMCAUTH.
JS1199     COPY DCLUSKEY.
JS1199     COPY ONLNDFC.
CP0406     COPY DSBPRDXL.
CP0406     COPY DSBPRDDS.
SD0320     COPY DCRDTYUP.
DR0116*****  USED TO CALL TSXCS060 FOR ID MATCH NUMBER
DR0116     COPY TSXCW280.
021908***** DB2 TABLE DBO.HIERARCHY
021908     COPY DHIERACH.
021908***** DB2 TABLE DBO.HIER_NODE
021908     COPY DHINODE.
021908***** DB2 TABLE DBO.HIER_UNIT_GRP_NODE
021908     COPY DUNITNOD.
021908***** DB2 TABLE DBO.HIER_DRV_GRP_NODE
021908     COPY DHDRVNOD.
KB0408***** DB2 TABLE DBO.HIER_DRV_GRP_DRV
KB0408     COPY DHDRV.
102810***** DB2 TABLE DBO.PRP_PRE_AUTH
041112     COPY DPRPPAUT.
091411***** DB2 TABLE DBO.PFID_CUST_XREF
091411     COPY DPFIDCSX.
020712***** DB2 TABLE DBO.PFID_MAINT
PM0916     COPY DPFIDMNT.
091411***** DB2 TABLE DBO.NET_PRICING_HDR
091411     COPY DNETPHDR.
091411***** DB2 TABLE DBO.NET_PRICING
BG0418**   COPY DNETPRCG.
BG0418     COPY DNETPRC1.
CP1011***** DB2 TABLE DBO.TRNS_HIST
CP1011     COPY DXTNHIST.
041112***** DB2 TABLE DBO.RFID_XREF
041112     COPY DRFIDXRF.
041112***** DB2 TABLE DBO.CRD_TKN_XREF
041112     COPY DCRDTKNX.
SB0113***** DB2 TABLE DBO.CURR_RT
SB0113     COPY DCURRR.
100914***** DB2 TABLE DBO.CUST_UNIT
100914     COPY DCUSUNT.
100914***** DB2 TABLE DBO.CUST_UNIT_GRPS
100914     COPY DCUUGRP.
112014***** DB2 TABLE CXXCOW.PROD_LMT_NTWRK
112014     COPY SPRDLMTN.
SD0620***** FUEL/PROXIMITY COPYBOOK
SD0620     COPY CXXCW0TE.
011222***** TAX EXEMPT ACCOUNT COPYBOOK
011222     COPY DTAXEXEA IN CPYREL.

021908********** DB2 CURSORS
021908     EXEC SQL DECLARE CUR_HIER_DRV_NODE CURSOR FOR
              SELECT  NODE_ID,
                      DRV_GRP_ID
                FROM  DBO.HIER_DRV_GRP_NODE
                WHERE HIER_ID         = :DHDRVNOD.HIER-ID  AND
                      NODE_ID         = :DHDRVNOD.NODE-ID
                FOR READ ONLY WITH UR
           END-EXEC.

021908     EXEC SQL DECLARE CUR_HIER_DRV CURSOR FOR
              SELECT  B.DRV_ID,
                      B.DRV_GRP_ID,
DS0608                B.DRV_LST_NM,
DS0608                B.DRV_FST_NM,
DS0608                B.DRV_LIC_NBR,
DS0608                B.DRV_LIC_ST
                FROM  DBO.HIER_DRV_GRP_NODE  A,
                      DBO.HIER_DRV_GRP_DRV   B
                WHERE A.HIER_ID         = :DHDRVNOD.HIER-ID  AND
                      A.NODE_ID         = :DHDRVNOD.NODE-ID  AND
                      B.DRV_ID          = :DHDRV.DRV-ID      AND
                      A.HIER_ID         = B.HIER_ID          AND
                      A.DRV_GRP_ID      = B.DRV_GRP_ID
                FOR READ ONLY WITH UR
           END-EXEC.

102810     EXEC SQL DECLARE CUR_PRE_AUTH CURSOR FOR
              SELECT  PRE_AUTH_TS
                FROM  DBO.PRP_PRE_AUTH
                WHERE CRD_NBR         = :DPRPPAUT.CRD-NBR  AND
                      MRCH_NBR        = :DPRPPAUT.MRCH-NBR AND
                      PRE_AUTH_DT    >= :DPRPPAUT.PRE-AUTH-DT
                ORDER BY PRE_AUTH_TS DESC
                FOR READ ONLY WITH UR
           END-EXEC.

102810     EXEC SQL DECLARE CUR_PRE_AUTH_UPDT CURSOR FOR
              SELECT  PRE_AUTH_DT,
                      PRE_AUTH_TS,
                      D1_AMT_LIM,
                      D2_AMT_LIM,
                      RFR_AMT_LIM,
                      OTH_AMT_LIM,
                      OIL_AMT_LIM,
                      CASH_AMT_LIM
                FROM  DBO.PRP_PRE_AUTH
                WHERE CRD_NBR      = :DPRPPAUT.CRD-NBR     AND
                      MRCH_NBR     = :DPRPPAUT.MRCH-NBR    AND
                      PRE_AUTH_DT >= :DPRPPAUT.PRE-AUTH-DT AND
                      POST_FLG     < 'P'
                ORDER BY PRE_AUTH_TS DESC
                FOR READ ONLY WITH UR
           END-EXEC.

CP0405*-----------------------------*
CP0405* MQSERIES WORK FIELDS        *
CP0405*-----------------------------*
CP0405 01  MQM-GET-MESSAGE-OPTIONS.
CP0405     COPY CMQGMOV.
CP0405 01  MQM-CONSTANTS.
CP0405     COPY CMQV.
CP0405 01  MQM-PUT-MESSAGE-OPTIONS.
CP0405     COPY CMQPMOV.
CP0405 01  W03-PUT-BUFFER.
CP0405     05 W03-CSQ4BQRM.
CP0405     COPY CSQ4VB4.
CP0405
CP0405 01  W00-MESSAGE-BUFFER.
CP0405     03  MQM-OBJECT-DESCRIPTOR.
CP0405         COPY CMQODV.
CP0405     03  MQM-MESSAGE-DESCRIPTOR.
CP0405         COPY CMQMDV.
CP0405     03  W00-MSGBUFFER.
CP0405         05 W00-MSGBUFFER-ARRAY  PIC X(1) OCCURS 9950 TIMES.
CP0405
CP0405 01  WS-MQSERIES-WORK-FIELDS.
CP0405     05 WS-QNAME-OUTBOUND        PIC X(48) VALUE SPACES.
CP0405     05 WS-QLENGTH-OUTBOUND      PIC S9(9) BINARY VALUE 0.
CP0405
CP0405 01  W03-BUFFLEN                 PIC S9(9) BINARY VALUE 0.
CP0405 01  W03-HCONN                   PIC S9(9) BINARY VALUE 0.
CP0405 01  W03-HOBJ                    PIC S9(9) BINARY VALUE 0.
CP0405 01  W03-OPENOPTIONS             PIC S9(9) BINARY.
CP0405 01  W03-OPTIONS                 PIC S9(9) BINARY.
CP0405 01  W03-COMPCODE                PIC S9(9) BINARY.
CP0405 01  W03-COMPCODE-CHAR           PIC X(9)    VALUE SPACES.
CP0405 01  W03-REASON                  PIC S9(9) BINARY.
CP0405 01  W03-REASON-CHAR             PIC X(9)    VALUE SPACES.
CP0405
CP0405 01  WS-PGM-MQ-WORKFIELDS.
CP0405     05 WS-BATCH-QUEUE-NAME      PIC X(48)
CP0405        VALUE 'TSFM.FPLG.BATCH'.
CP0405     05 WS-ONLINE-QUEUE-NAME     PIC X(48)
CP0405        VALUE 'TSFM.FPLG.ONLINE'.
CP0405     05 WS-QLENGTH-FPLG          PIC S9(9)  VALUE +2260.
MP0411     05 WS-BTCHSET-QUEUE         PIC X(48)
MP0411        VALUE 'TSMM.MMBS'.
MP0411     05 WS-QLENGTH-BTCHSET       PIC S9(9)  VALUE +462.

      *-----------------------------*
      * DISCOUNT WORK AREA          *
      *-----------------------------*
082212 01  WS-FMCD-COMMAREA-CHG.
      ***** FIELDS PASSED TO TSFMO0CD THAT CAN BE CHANGED;
      ***** THESE FIELDS MOVED HERE FROM OTHER PARTS OF PROGRAM SO
      ***** THEY CAN BE MOVED AS A GROUP
           05 WS-COST-PLUS-USED         PIC  X(01)           VALUE 'N'.
           05 WS-SETTLE-DIRECT-BILL-FLAG  PIC  X(01).
JS0206     05 WS-PRD-CALC-TYPE          PIC  X(04).
082008     05 WS-MANUAL-FEE             PIC S9(5)V999 COMP-3 VALUE +0.
           05 WS-AMOUNT-OF-DISC-CPG     PIC S99V9999  COMP-3 VALUE ZERO.
           05 SAVE-FMDL-SC-INVOICE-AMT  PIC S9(5)V99  COMP-3 VALUE +0.
           05 WS-TOTAL-GALLONS          PIC S9(5)V99         VALUE +0.
           05 WS-TOTAL-FACE             PIC S9(6)V99         VALUE +0.
CP0700     05 WS-TOTAL-FACE-SC          PIC S9(6)V99         VALUE +0.
CP0800     05 WS-SC-AUTO-CASH-ADD-ON    PIC S9(6)V99         VALUE +0.
CP0800     05 WS-SC-MAN-CASH-ADD-ON     PIC S9(6)V99         VALUE +0.
082008     05 WS-BASE-FUEL-RATE         PIC S9(5)V99  COMP-3 VALUE ZERO.
082008     05 WS-MIXED-FUEL-RATE        PIC S9(5)V99  COMP-3 VALUE ZERO.
JS0206*** (PRODUCT FEES WORK AREA) ***
JS0206     05 WS-PRD-FEE-WORK-AREA.
JS0206      10 FILLER OCCURS 3 TIMES.
JS0206        15 WS-PRD-FEE-TYPE           PIC X(01).
JS0206        15 WS-PRD-FUNDED-RATE        PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-DB-RATE            PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-FUNDED-RATE-ALTCUR PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-DB-RATE-ALTCUR     PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SC-RATE            PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SCM-AUTO-RATE      PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SCM-MANUAL-RATE    PIC S9(5)V99 COMP-3.
JS0206        15 WS-PRD-SCM-FLAT-OR-POF    PIC X(1).
JS0206     05 WS-PRD-FEE-SC-WORK-AREA.
JS0206      10 FILLER OCCURS 3 TIMES.
JS0206        15 WS-PRD-PROD-FEE           PIC S9(5)V99 COMP-3.
JS0206     05 WS-FMDL-PRODUCT-FEE-INFO.
JS0206       10 WS-FMDL-PRODUCT-FEES OCCURS 3 TIMES.
JS0206        15 WS-FMDL-PF-SC-FEE               PIC S9(05)V99  COMP-3.
JS0206        15 WS-FMDL-PF-SC-FEE-SOURCE        PIC X(01).
JS0206        15 WS-FMDL-PF-SC-FEE-LOC-TYPE      PIC X(02).
JS0206        15 WS-FMDL-PF-SC-FEE-TYPE          PIC X(01).
JS0206        15 WS-FMDL-PF-CUST-FEE             PIC S9(05)V99  COMP-3.
JS0206        15 WS-FMDL-PF-CUST-FEE-SOURCE      PIC X(01).
JS0206        15 WS-FMDL-PF-CUST-FEE-CUST-TYPE   PIC X(02).
JS0206        15 WS-FMDL-PF-CUST-FEE-TYPE        PIC X(01).
JS0298     05 WS-DISCOUNT-AND-FEE-AREA.
             10 WS-DC-DISCOUNT-AMT        PIC S9(5)V99 COMP-3 VALUE +0.
JS0298       10 WS-DC-SC-DISCOUNT-AMT     PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-SC-REBATE-AMT       PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT             PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-FUEL        PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-CUSTOM      PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-RETAIN      PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-FEE-AMT-MANUAL      PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DC-DISCOUNT-FOCUS-SELECT PIC X(1)          VALUE ' '.
             10 WS-DC-DISCOUNT-METHOD     PIC X(1)            VALUE ' '.
             10 WS-DC-REBATE-AMT          PIC S9(5)V99 COMP-3 VALUE +0.
             10 WS-DISCOUNT-TYPE-FLAG     PIC X(1)            VALUE ' '.
              88 WS-DISCOUNT-TYPE-IS-CPG                      VALUE 'G'.
              88 WS-DISCOUNT-TYPE-IS-POF                      VALUE 'F'.
              88 WS-DISCOUNT-TYPE-IS-FLT                      VALUE '1'.
              88 WS-DISCOUNT-TYPE-IS-COST-PLUS                VALUE 'C'.
              88 WS-DISCOUNT-TYPE-IS-NATS                     VALUE 'U'.
              88 WS-DISCOUNT-TYPE-IS-CPG-POF                  VALUE 'B'.
              88 WS-DISCOUNT-TYPE-IS-CPG-FLT                  VALUE '2'.
              88 WS-DISCOUNT-TYPE-IS-POF-FLT                  VALUE '3'.
              88 WS-DISCOUNT-TYPE-IS-ALL                      VALUE '4'.
CP0400       10 WS-SC-CORP-REB-AMT        PIC S9(5)V99 COMP-3 VALUE +0.
CP0400       10 WS-ADJ-FOR-CORP-REB       PIC X               VALUE ' '.
SB0614 01  WS-FMCD-MISC-AREA.
SB0614     05  WS-MERCH-SURCHRG-FLAG      PIC X(01)           VALUE ' '.
SB0614         88 APPLY-MERCH-SURCHRG     VALUE 'Y'.
SB0614     05  WS-MERCH-SURCHRG-TOTAL     PIC S9(7)V99 COMP-3 VALUE +0.
SB0115     05  WS-MINIMUM-FEE-FLAG        PIC X(1)            VALUE ' '.
SB0115         88 APPLY-SC-MIN-FEE        VALUE 'Y'.
SB0115     05  WS-MIN-FUEL-FEE-DIFF       PIC S9(3)V99 COMP-3 VALUE +0.
SB0115     05  WS-GALUP-FEE-FLAG          PIC X(1)            VALUE ' '.
SB0115         88 APPLY-SC-GALUP-FEE      VALUE 'Y'.
SB0115     05  WS-GALUP-FUEL-FEE          PIC S9(3)V99 COMP-3 VALUE +0.
SB0516     05  WS-DC-DISCOUNT-SMFL        PIC S9(5)V99 COMP-3 VALUE +0.

060512***** ADJUSTED TO ACTUAL SIZE OF WS-DISCOUNT-AND-FEE-AREA
082212 01  WS-HOLD-DISC-AND-FEE-AREA      PIC X(044).

JS0298 01  WS-TOTAL-AMOUNT-FLDS.
           05 WS-BILLABLE            PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS2-BILLABLE           PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS3-BILLABLE           PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-NON-BILLABLE        PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS2-NON-BILLABLE       PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS3-NON-BILLABLE       PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-CAN-BILLABLE        PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-US-BILLABLE         PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS-CURXMN              PIC S9(6)V99    VALUE ZERO.
           05 WS2-CURXMN             PIC S9(6)V99    VALUE ZERO.
           05 WS3-CURXMN             PIC S9(6)V99    VALUE ZERO.
           05 WS-TOTAL-REQUEST       PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS2-TOTAL-REQUEST      PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS3-TOTAL-REQUEST      PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS2-BILLABLE-FUEL      PIC S9(5)V99    VALUE ZERO COMP-3.
           05 WS2-NON-BILLABLE-FUEL  PIC S9(5)V99    VALUE ZERO COMP-3.
JS0298 01  WS-HOLD-TOTAL-AMOUNT-FLDS PIC X(100).

       01  SETTLEMENT-WORK-FIELDS.
           05 WS-BALANCE-GROUP-ID               PIC S9(9) COMP-3.
           05 WS-CLOSING-GROUP-ID               PIC S9(9) COMP-3.
           05 WS-PAYMENT-GROUP-ID               PIC S9(9) COMP-3.
           05 WS-BALANCE-ITEM-NUMBER            PIC S9(7) COMP-3.
           05 WS-CLOSING-ITEM-NUMBER            PIC S9(7) COMP-3.
           05 WS-PAYMENT-ITEM-NUMBER            PIC S9(7) COMP-3.
           05 WS-CREATE-BALANCE-GROUP           PIC X(1).
           05 WS-CREATE-CLOSING-GROUP           PIC X(1).
           05 WS-CREATE-PAYMENT-GROUP           PIC X(1).
           05 WS-SETTLE-TS-CODE                 PIC X(10).
           05 WS-SETTLE-ORIG-TS                 PIC X(10).
JS0298     05 WS-SPLIT-SETTLE-FLAG              PIC X(1).
JS0298     05 WS-SPLIT-SETTLE-COUNT             PIC 9(1).

SD0222 01  WS-PRODUCT-DISCOUNT-AREA.
SD0222     05  WS-PD-OTH-FUEL-DISC       PIC 9(3)V99.
SD0222     05  WS-PD-RFR-FUEL-DISC       PIC 9(3)V99.
SD0222     05  WS-PD-NR1-FUEL-DISC       PIC 9(3)V99.
SD0222     05  WS-PD-NR2-FUEL-GAL        PIC 9(3)V99.
SD0222     05  WS-PD-NR2-FUEL-PPG        PIC 99V9(3).
SD0222     05  WS-PD-NR2-FUEL-COST       PIC 9(3)V99.
SD0222     05  WS-PD-NR2-FUEL-DISC       PIC 9(3)V99.
SD0222     05  WS-PD-DEF-FUEL-GAL        PIC 9(3)V99.
SD0222     05  WS-PD-DEF-FUEL-PPG        PIC 99V9(3).
SD0222     05  WS-PD-DEF-FUEL-COST       PIC 9(3)V99.
SD0222     05  WS-PD-DEF-FUEL-DISC       PIC 9(3)V99.
SD0222     05  WS-PD-CNG-FUEL-GAL        PIC 9(3)V99.
SD0222     05  WS-PD-CNG-FUEL-PPG        PIC 99V9(3).
SD0222     05  WS-PD-CNG-FUEL-COST       PIC 9(3)V99.
SD0222     05  WS-PD-CNG-FUEL-DISC       PIC 9(3)V99.
SD0222     05  WS-PD-GAS-FUEL-GAL        PIC 9(3)V99.
SD0222     05  WS-PD-GAS-FUEL-PPG        PIC 99V9(3).
SD0222     05  WS-PD-GAS-FUEL-COST       PIC 9(3)V99.
SD0222     05  WS-PD-GAS-FUEL-DISC       PIC 9(3)V99.

      *-------------------------------------*
      * ATM WORK AREA                       *
      *-------------------------------------*
MP0106     COPY ATMSTANC.
SD0621     COPY TSXCW030.
072811     COPY TSXCW008.

       01  ATM-WORK-AREA.
           05 WS-TSXCO0AT-COMM-AREA.
              10 FILLER                PIC X(4).
DR0121        10 WS-TSXCO0AT-COMMAREA  PIC X(2452).
MP0800 01  WS-SAVE-ATM.
MP0800     05 WS-SAVE-ATM-ERROR-NUMBER  PIC S9(5) COMP-3 VALUE +0.
           05 WS-SAVE-ATM-ERROR-MESSAGE PIC X(80)        VALUE SPACES.
       01  POS-OUTPUT-AREA.
           05 POS-ERROR-NUMBER        PIC S9(5) COMP-3 VALUE +0.
081414     05 POS-MESSAGE             PIC X(413) VALUE SPACES.

SD0620 01  WS-MASTER-CUST                PIC X(2040).
SD0620 01  WS-MASTER-UNIT                PIC X(700).
      *** (MISC WORK FIELDS) ****
       01  FILLER.
JS0218     05 WS-DISC-AMTP               PIC 9(3)V99 COMP-3.
ED0406     05 WS-TSFMU020-PROG           PIC X(08) VALUE 'TSFMU020'.
CP1011     05 WS-CXUTS400                PIC X(08) VALUE 'CXUTS400'.
CP1011     05 WS-CALC-AUTH-NR            PIC 9(09) VALUE ZEROS.
CP1011     05 WS-LINK-TO-I-SW            PIC X(01) VALUE 'N'.
CP1011     05 WRK-EIBRESP                PIC 9(03) VALUE ZEROS.
CP1011     05 FILL-CHAR                  PIC X(01) VALUE SPACES.
CP1011     05 WS-CXUTSJON-OPTIONS        PIC X(03) VALUE 'YNN'.
CP1011     05 WS-CNL-6-SW                PIC X(01) VALUE 'N'.
CP1011     05 WS-CTRL-LOOP-SW            PIC X(01) VALUE 'N'.
CP1011     05 WS-CTRL-MULT-SW            PIC X(01) VALUE 'N'.
CP1011     05 WS-CTRL-MATCH-SW           PIC X(01) VALUE 'N'.
SD0122     05 WS-PRE-AUTH-SW             PIC X(01) VALUE 'N'.
SD0122        88 WS-PRE-AUTH-FOUND                 VALUE 'Y'.
SD0122     05 WS-SP14-ELAPSED-TIME-MINS  PIC S9(8) USAGE COMP.
CP1011     05 WS-CTRL-LOOP-CTR           PIC 9(02) VALUE ZEROS.
CP1011     05 WS-LOOPS                   PIC 9(02) VALUE ZEROS.
040912     05 WS-RELOCATE-UNIT-ADJUST    PIC X(01) VALUE 'N'.
040912     05 WS-DRAFT-WAS-CANCELLED     PIC X(01) VALUE SPACES.
041112     05 WS-FUEL-PROD-PURCHASED     PIC X(03) VALUE SPACES.
041112     05 WS-RFID-XREF-READ          PIC X(01) VALUE SPACES.
041112     05 WS-USE-RFID-XREF           PIC X(01) VALUE SPACES.
050712     05 WS-RECOMP-SW               PIC X(01) VALUE SPACES.
SD1020     05 WS-1TIME-OFF-CSTAND-FLG    PIC X(01) VALUE SPACES.
SD1020        88 ONE-TIME-OFF-CSTAND-TRAN VALUE 'Y'.
           05 WS-TIME-CURR               PIC S9(15) COMP-3 VALUE ZERO.
           05 WS-TIME-START              PIC S9(15) COMP-3 VALUE ZERO.
           05 WS-TIME-END                PIC S9(15) COMP-3 VALUE ZERO.
JS0402     05 WS-DI-TRANSACTION-NUMBER   PIC S9(07) COMP-3 VALUE ZERO.
ED1102     05 WS-SUB1                    PIC 9(03) VALUE 1.
SB1115     05 WS-PRD-SUB                 PIC 9(03) VALUE 0.
           05 WS-EXPDATE-MMYY            PIC 9(04) VALUE ZERO.
           05 WS-EXPDATE-YYMM            PIC 9(04) VALUE ZERO.
           05 WS-EXP-DATE-YYYYMM         PIC 9(6)  VALUE ZERO.
BG0122     05 WS-DRVR-ID-HOLD-REL-DT     PIC 9(8)  VALUE ZEROS.
BG0122     05 WS-CURR-DRVR-ID-HOLD-REL-TM
BG0122                                   PIC 9(7)  VALUE ZEROS.
BG0122     05 FILLER REDEFINES WS-CURR-DRVR-ID-HOLD-REL-TM.
BG0122        10 FILLER                  PIC X(1).
BG0122        10 WS-CURR-DRVR-ID-HOLD-REL-HR-MI
BG0122                                   PIC 9(4).
BG0122        10 FILLER                  PIC X(2).
011222     05 WS-PROC-ACCT-NBR           PIC X(14) VALUE SPACES.
           05 WS-UPDATE-EXP-DATE         PIC X(1)  VALUE 'Y'.
           05 WS-UNIT-NR.
              10 WS-UNIT-NR-10.
                 15 FILLER               PIC X(04) VALUE SPACES.
                 15 WS-UNIT-NR-06        PIC X(06) VALUE SPACES.
           05 WS-ADJUST-UNIT-NR.
              10 FILLER                  PIC X(04) VALUE SPACES.
              10 WS-ADJUST-UNIT-NR-06    PIC X(06) VALUE SPACES.
           05 WS-ZERO                    PIC X(1) VALUE '0'.
JS0206     05 WS-FLEET-LIMIT-AVAIL       PIC S9(7)V99 COMP-3 VALUE ZERO.
           05 WS-EXP-DATE                PIC 9(4).
CP1011     05 WS-SQLCODE                 PIC S9(3).
JS1199        88 WS-SQLCODE-WAIT                VALUE -904, -911.
JS1199     05 WS-BALANCE-BASED-FLAG       PIC X(1) VALUE 'N'.
JS1199        88 WS-BALANCE-BASED                  VALUE 'Y'.
JS1199        88 WS-LIMIT-BASED                    VALUE 'N'.
MP0205     05 WS-CDN-CUST-NUMBER          PIC X(10) VALUE SPACES.
JS1199     05 WS-OFF-HOURS-FLAG           PIC X(1).
JS1199     05 WS-OFF-HOURS-WARNING-FLAG   PIC X(1) VALUE 'N'.
JS1199     05 WS-CARD-BLOCKED-FLAG        PIC X(1) VALUE 'N'.
JS1199     05 WS-FLEET-PROD               PIC 9(5) VALUE ZERO.
MP0600     05 WS-PETRO-CANADA-CHAIN       PIC X(10) VALUE 'PC002'.
MP0900     05 WS-PETRO-CANADA-RESP.
MP0900        07 FILLER                   PIC X(6) VALUE ' DATE:'.
MP0900        07 WS-PETRO-CANADA-DATE     PIC X(10) VALUE SPACES.
MP0402     05 WS-ATM-REVERSAL-FLAG        PIC X     VALUE 'N'.
MP0402        88 THIS-IS-AN-ATM-REVERSAL            VALUE 'Y'.
MP0903     05  WS-STANDIN-REVERSE-FL      PIC X(01) VALUE 'N'.
MP0903         88 WS-STANDIN-REVERSE                VALUE 'Y'.
           05 WS-TAX-PARM                 PIC X(1) VALUE 'A'.
           05 WS-TAX-COMPUTED-FLAG        PIC X(1) VALUE 'N'.
           05 WS-CXXCO0CS-ABEND.
              10 FILLER                   PIC X(2) VALUE 'CS'.
              10 WS-CXXCO0CS-ABEND-CODE   PIC X(2) VALUE SPACES.
102810     05 WS-TSFMO0LP-ABEND.
102810        10 FILLER                   PIC X(2) VALUE 'LP'.
102810        10 WS-TSFMO0LP-ABEND-CODE   PIC X(2) VALUE SPACES.
           05 WS-CXXCO0PU-ABEND.
              10 FILLER                   PIC X(2) VALUE 'PU'.
              10 WS-CXXCO0PU-ABEND-CODE   PIC X(2) VALUE SPACES.
           05 WS-RETAIL-PPG-NR2           PIC S9(2)V999 COMP-3 VALUE +0.
           05 WS-RETAIL-PPG-NR1           PIC S9(2)V999 COMP-3 VALUE +0.
           05 WS-RETAIL-PPG-TRAILER       PIC S9(2)V999 COMP-3 VALUE +0.
JS0999     05 WS2-RETAIL-PPG-NR2          PIC S9(2)V999 COMP-3 VALUE +0.
JS0999     05 WS2-RETAIL-PPG-NR1          PIC S9(2)V999 COMP-3 VALUE +0.
JS0999     05 WS2-RETAIL-PPG-TRAILER      PIC S9(2)V999 COMP-3 VALUE +0.
JS0999     05 WS3-RETAIL-PPG-NR2          PIC S9(2)V999 COMP-3 VALUE +0.
JS0999     05 WS3-RETAIL-PPG-NR1          PIC S9(2)V999 COMP-3 VALUE +0.
JS0999     05 WS3-RETAIL-PPG-TRAILER      PIC S9(2)V999 COMP-3 VALUE +0.
JS0298     05 WS-SCPM-LEVEL-1-VARIANCE     PIC S9(2)V999 COMP-3.
           05 WS-HOLD-COM-SPECIAL-SETTLE    PIC X(1).
JS1203     05 WS-HOLD-CUSTOMER-ID           PIC X(10).
MP1204     05 WS-TABLE-CODE                 PIC S9(3) COMP-3 VALUE +1.
           05 WS-HOLD-SIR-KEY               PIC X(23).
           05 WS-EXIT-PROGRAM-FLAG          PIC X(1)          VALUE 'N'.
           05 WS-CASH-AVAILABLE-FLAG        PIC X(1).
           05 WS-WORK-CURR-DATE             PIC 9(8).
           05 FILLER REDEFINES WS-WORK-CURR-DATE.
              10 WS-WORK-CURR-DATE-YYYY     PIC 9(4).
              10 FILLER REDEFINES WS-WORK-CURR-DATE-YYYY.
                 15 WS-WORK-CURR-DATE-CEN   PIC 9(2).
                 15 WS-WORK-CURR-DATE-YY    PIC 9(2).
              10 WS-WORK-CURR-DATE-MM       PIC 9(2).
              10 WS-WORK-CURR-DATE-DD       PIC 9(2).
           05 WS-WORK-PEND-DATE             PIC 9(8).
SB0614     05 WS-EXP-BAL-NEG-AMT      PIC S9(7)V99 COMP-3 VALUE +0.
SB0614     05 WS-MERCH-SURCHRG-AMT-SC PIC S9(7)V99 COMP-3 VALUE +0.
SB0614     05 WS-MERCH-SURCHRG-AMT-ADJ PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-NR2-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-NR1-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-REF-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-OTH-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-OIL-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-PR1-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-PR2-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-PR3-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-TOT-SELECT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
JS0618     05 WS-PROD-COST-RATIO      PIC S9(3)V9(9) COMP-3 VALUE +0.
061815     05 WS-PROD-SPLIT-DISCOUNT  PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-NR1-TAX-PROD-COST    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-NR2-TAX-PROD-COST    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-REF-TAX-PROD-COST    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-OTH-TAX-PROD-COST    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-NR2-TRANS-AMT-BAL    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-NR1-TRANS-AMT-BAL    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-REF-TRANS-AMT-BAL    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-OTH-TRANS-AMT-BAL    PIC S9(7)V99 COMP-3 VALUE +0.
061815     05 WS-NR2-BASE-AMT         PIC S9(5)V99 COMP-3 VALUE +999.
061815     05 WS-NR1-BASE-AMT         PIC S9(5)V99 COMP-3 VALUE +999.
061815     05 WS-REF-BASE-AMT         PIC S9(5)V99 COMP-3 VALUE +999.
061815     05 WS-OTH-BASE-AMT         PIC S9(5)V99 COMP-3 VALUE +999.
MP1004     05 WS-WORK-TOTAL-AR        PIC S9(5)V99 COMP-3 VALUE +0.
MN1007     05 WS-WORK-NR-OF-GALLONS   PIC S9(7)V99 COMP-3 VALUE +0.
MP1004     05 WS-WORK-PRICE-PER-GLLN  PIC S99V999  COMP-3 VALUE +0.
082008     05 WS-WORK-TOTAL-COST      PIC S9(5)V99 COMP-3 VALUE +0.
MP1004     05 WS-WORK-TRANS-NR        PIC S9(7)    COMP-3 VALUE +0.
MP1004     05 WS-WORK-NW-DATE         PIC 9(6)     COMP-3 VALUE  0.
MP1004     05 WS-WORK-LESS-CHARGE     PIC X(1)            VALUE SPACES.
MP1004        88 TRANS-LESS-CHARGES                       VALUE 'Y'.
           05 WS-TRENDAR-EQUIP-FOUND  PIC X(1).
           05 WS-EXPAND-DISCOUNT-MSG  PIC X    VALUE 'N'.
           05 WS-EXPAND-FEE-MSG       PIC X    VALUE 'N'.
           05 WS-EXPAND-BOTH-MSG      PIC X    VALUE 'N'.
           05 WS-AUTO-GAS-PUMP-NRX.
              10 WS-AUTO-GAS-PUMP-NR  PIC 9(2).
           05 WS-ACCT-CODE            PIC X(5).
              88 WS-ACCT-CODE-PRNT-FLAG-U       VALUES 'WA050' 'WA084'
                                                       'WA146' 'WA154'
                                                       'WA155' 'WA159'.
              88 WS-ACCT-CODE-LANDSTAR          VALUES 'RA401' 'PT001'
                                                       'IN305' 'LI982'.
           05 WS-PRM-VRU-PIN-ATTEMPTS PIC 9(1).
           05 WS-CANADIAN-AREA-CODE   PIC X(1)      VALUE 'N'.
           05 WS-CONVERT-CURR-TYPE    PIC X(1).
           05 WS-CONVERT-AMOUNT       PIC S9(7)V99 COMP-3.
           05 WS-CONVERT-AMOUNT1      PIC S9(7)V99 COMP-3.
           05 WS-CONVERT-AMOUNT2      PIC S9(7)V99 COMP-3.
           05 WS-CONVERT-AMOUNT3      PIC S9(7)V99 COMP-3.

CP1011     05 WS-CONTROL-NR           PIC 9(9)      VALUE ZEROES.
CP1011     05 WS-CONTROL-NR-SETTLE    PIC 9(9)      VALUE ZEROES.
           05 FILLER                  PIC X(1)      VALUE 'N'.
              88 WS-BILLABLE-IS-ALL-CASH            VALUE 'Y'.
              88 WS-BILLABLE-IS-NOT-ALL-CASH        VALUE 'N'.
           05 WS-VRU-COUNTRY-FLAG     PIC X(1).
           05 WS-PROD-AMOUNT          PIC S9(5)V99  VALUE ZEROS.
           05 WS-WHICH-PROD           PIC 9(1)      VALUE ZEROES.
021908     05 WS-UNITMST-UNIT         PIC X(1)      VALUE SPACE.
021908     05 WS-PRMINFO-READ-SW      PIC X(1)      VALUE SPACE.
021908     05 WS-HIER-SW              PIC X(1)      VALUE SPACE.
021908        88 ON-HIERARCHY                       VALUE 'Y'.
021908     05 DONE                    PIC S9(4) COMP VALUE +0.
021908     05 REPEAT                  PIC S9(4) COMP VALUE +1.
021908     05 WS-LOOP-STATUS          PIC S9(4) COMP VALUE +0.
021908     05 51028-LOOP-STATUS       PIC S9(4) COMP VALUE +0.
021908***** THE FOLLOWING BLOCK OF FIELDS REPLACES CDNCUST FIELDS;
021908***** THESE FIELDS CAN BE POPULATED FROM CDNCUST OR HIERARCHY TBL
021908     05 WS-COUNTRY-CODE         PIC X(02).
021908     05 WS-ONE-TIME-LIMIT       PIC X(01).
021908       88  WS-ONE-TIME-CASH-LIMIT-AVAIL        VALUES 'C' 'B'.
021908       88  WS-ONE-TIME-PURC-LIMIT-AVAIL        VALUES 'P' 'B'.
021908     05 WS-PRODUCT-STANDARD     PIC X(01).
021908       88  WS-CHANGE-LIMITS-BY-UNIT            VALUE  'Y'.
021908     05 WS-TRIP-ALLOWANCE       PIC X(01).
021908     05 WS-CASH-ADVANCE-FLAG    PIC X(01).
021908     05 WS-CO-DRVR-NAME-ENTERED PIC X(01).
MP1208     05 WS-DIRECT-BILLING-PROD  PIC 9          VALUE 0.
021908*******************************************
           05 WS-NATS-PRE-AUTH-FLAG   PIC X(1).
050316***** TABLE CHANGED TO ALPHA SO SPACES CAN BE IN 'PLACE-HOLDER'
050316***** PRODUCT CODE VALUES; RECEIVING FIELD IS ALSO ALPHA
           05 WS-NATS-PROD-TABLE-DATA.
MN0207        10 FILLER               PIC X(3)  VALUE '080'.
              10 FILLER               PIC X(3)  VALUE '105'.
MN0207        10 FILLER               PIC X(3)  VALUE '129'.
              10 FILLER               PIC X(3)  VALUE '121'.
              10 FILLER               PIC X(3)  VALUE '085'.
              10 FILLER               PIC X(3)  VALUE '116'.
MN0207        10 FILLER               PIC X(3)  VALUE '130'.
              10 FILLER               PIC X(3)  VALUE '100'.
MN0207        10 FILLER               PIC X(3)  VALUE '125'.
              10 FILLER               PIC X(3)  VALUE '116'.
MN0207        10 FILLER               PIC X(3)  VALUE '122'.
ED0505        10 FILLER               PIC X(3)  VALUE '124'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
MN0207        10 FILLER               PIC X(3)  VALUE '118'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
MN0207        10 FILLER               PIC X(3)  VALUE '115'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
ED0505        10 FILLER               PIC X(3)  VALUE '116'.
112409        10 FILLER               PIC X(3)  VALUE '116'.
112409        10 FILLER               PIC X(3)  VALUE '082'.
112409        10 FILLER               PIC X(3)  VALUE '140'.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE SPACES.
050316        10 FILLER               PIC X(3)  VALUE '591'.
050316        10 FILLER               PIC X(3)  VALUE '592'.
           05 FILLER REDEFINES WS-NATS-PROD-TABLE-DATA.
050316        10 WS-NATS-PROD-TABLE   PIC X(3) OCCURS 36 TIMES.
           05 WS-WORK-IOL-MAX-LITERS  PIC 9(9)V99 COMP-3.
           05 WS-WORK-FIELD           PIC X(2500).
           05 WS-CDN-MONEY-INVOICE PIC X(2).
              88 WS-CDN-MONEY-INVOICE-EXP-CASH    VALUES 'F ', 'EF',
                                                         'PF', 'FP',
                                                         'A '.
           05 WS-COST-PLUS-CPG-FEE1 PIC S9(5)V9(5) COMP-3 VALUE ZERO.
           05 WS-COST-PLUS-CPG-FEE2 PIC S9(5)V9(5) COMP-3 VALUE ZERO.
           05 WS-CUSTOM-FEE-TOTAL   PIC S9(5)V99   COMP-3.
           05 WS-LAST-SCMM-READ     PIC X(10)   VALUE SPACES.
           05 WS-CC-PIN-CHECK       PIC S9(8)   COMP.
           05 WS-PIN-NR             PIC S9(15)  VALUE ZEROS.
           05 WS-BINARY-PIN         PIC S9(8)   COMP.
           05 WS-VALIDATE-CKDIGIT   PIC X(1)    VALUE 'Y'.
      **** (MISC WORK FIELDS) ****
           05 WS-INVOICE.
              10 WS-INVOICE-DD      PIC 9(2).
              10 WS-INVOICE-TIME   PIC 9(6).
           05 WS-ADD-ON            PIC S9(5)V99    VALUE ZERO COMP-3.
JS0304     05 WS-AVAIL             PIC S9(9)V99    VALUE ZERO COMP-3.
           05 WS-HOLD-ODR-AMT      PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS-HOLD-ODR-NAME     PIC X(20)       VALUE SPACES.
           05 WS-HOLD-POS-ERROR-NUMBER PIC S9(5)   VALUE ZEROES.
           05 WS-HOLD-POS-ERROR-MSG    PIC X(80)   VALUE SPACES.
           05 WS-CC-AVAIL          PIC S9(6)V99    VALUE ZERO COMP-3.
           05 WS-CC-CUT-OFF1       PIC X(01)       VALUE 'N'.
           05 WS-DBF-MSG           PIC X(03)       VALUE 'DBF'.
           05 WS-DB-MSG            PIC X(03)       VALUE 'DB '.
           05 WS-CC-CONTROL-NR-DISP.
              10 WS-CC-CONTROL-DD  PIC 9(2).
              10 WS-CC-CONTROL-NR  PIC 9(6).
           05 WS-CC-EMPLOYEE-CHECK PIC X(5).
           05 WS-TALLY             PIC 9(5) COMP-3.
           05 WS-YCODE-ST-KEY.
              10 WS-YCODE-ST       PIC X(02).
              10 FILLER            PIC X(03)   VALUE '999'.
           05 WS-CANADIAN-CONVERSION.
              10 WS-CANADIAN-FIRST-TEN    PIC X(10) VALUE SPACES.
              10 WS-UNPACK-CANADIAN       PIC 9(2)V9(8) VALUE ZEROES.
           05 WS-CANADIAN-CHK-FLAG PIC X(1)    VALUE 'N'.
072811     05 WS-SCM-CNTRY-LOC-SW    PIC X(02) VALUE SPACES.
072811        88  WS-SCM-IS-IN-US              VALUE 'US'.
072811        88  WS-SCM-IS-IN-CANADA          VALUE 'CA'.
JS0403     05 WS-DSMSTR-RRN          PIC S9(09)    COMP SYNC.
CP1098     05 WS-ORIG-DATE           PIC 9(7).
CP1098     05 WS-FMT-ORIG-DATE       PIC 9(7).
CP1098     05 WS-FMT-ORIG-CNTRL-NR   PIC 9(8).
CP1098     05 WS-ORIG-CNTRL-NR       PIC X(6).
CP1098     05 FILLER REDEFINES WS-ORIG-CNTRL-NR.
CP1098        10 WS-ORIG-CNTRL-6     PIC 9(6).
CP1098     05 FILLER REDEFINES WS-ORIG-CNTRL-NR.
CP1098        10 WS-ORIG-CNTRL-5     PIC 9(5).
CP1098        10 FILLER              PIC X.
CP1098     05 FILLER REDEFINES WS-ORIG-CNTRL-NR.
CP1098        10 WS-ORIG-CNTRL-4     PIC 9(4).
CP1098        10 FILLER              PIC XX.
MP0204     05 WS-NV-EXIT-FLAG        PIC X(01) VALUE 'N'.
MP0204        88 WS-NV-EXIT-YES                VALUE 'Y'.
MP0204     05 WS-NV-ERROR-NR         PIC 9(05) VALUE ZERO.
MP0204     88 WS-NV-ERROR-IGNORE               VALUE 30, 31, 32, 47, 51,
MP0204                                               65, 83, 434, 435,
MP0204                                               436, 437, 445, 589,
MP0204                                               590.

PM0517     05 WS-FMRM-05-POF             PIC X(01)    VALUE SPACES.
PMO517     05 WS-TOTAL-FACE-SC-POF       PIC S9(6)V99 VALUE +0.

           05 WS-DRIVER-NR-KEYED-INFO.
              10 WS-DRIVER-NR-KEYED                OCCURS 20 TIMES.
                 15 WS-DRIVER-NR-KEYED-N  PIC 9(1).
           05 WS-DRIVER-NR-CARD-INFO.
              10 WS-DRIVER-NR-CARD        PIC X(1) OCCURS 20 TIMES.
           05 WS-DRIVER-NR-VALIDATE-TABLE.
              15 FILLER                   PIC X(03) VALUE 'QZ '.
              15 FILLER                   PIC X(03) VALUE 'ABC'.
              15 FILLER                   PIC X(03) VALUE 'DEF'.
              15 FILLER                   PIC X(03) VALUE 'GHI'.
              15 FILLER                   PIC X(03) VALUE 'JKL'.
              15 FILLER                   PIC X(03) VALUE 'MNO'.
              15 FILLER                   PIC X(03) VALUE 'PRS'.
              15 FILLER                   PIC X(03) VALUE 'TUV'.
              15 FILLER                   PIC X(03) VALUE 'WXY'.
           05 FILLER REDEFINES WS-DRIVER-NR-VALIDATE-TABLE.
              15 WS-DRIVER-NR-VALIDATE    PIC X(03) OCCURS 9 TIMES.
           05 WS-AREA-STATE-TABLE-DTA.
              15 FILLER                   PIC X(05) VALUE '403AB'.
              15 FILLER                   PIC X(05) VALUE '604BC'.
              15 FILLER                   PIC X(05) VALUE '204MB'.
              15 FILLER                   PIC X(05) VALUE '506NB'.
              15 FILLER                   PIC X(05) VALUE '709NF'.
              15 FILLER                   PIC X(05) VALUE '902NS'.
              15 FILLER                   PIC X(05) VALUE '807ON'.
              15 FILLER                   PIC X(05) VALUE '519ON'.
              15 FILLER                   PIC X(05) VALUE '705ON'.
              15 FILLER                   PIC X(05) VALUE '613ON'.
              15 FILLER                   PIC X(05) VALUE '416ON'.
              15 FILLER                   PIC X(05) VALUE '905ON'.
              15 FILLER                   PIC X(05) VALUE '902PE'.
              15 FILLER                   PIC X(05) VALUE '514PQ'.
              15 FILLER                   PIC X(05) VALUE '418PQ'.
              15 FILLER                   PIC X(05) VALUE '819PQ'.
              15 FILLER                   PIC X(05) VALUE '306SK'.
              15 FILLER                   PIC X(03) VALUE HIGH-VALUES.
              15 FILLER                   PIC X(02) VALUE SPACES.
           05 FILLER REDEFINES WS-AREA-STATE-TABLE-DTA.
              15 WS-AREA-STATE-TABLE OCCURS 18 TIMES.
                 20 WS-AREA-STATE-AREA    PIC X(03).
                 20 WS-AREA-STATE-ST      PIC X(02).

           05 WS-PRODUCT-CODE-LIMITS.
              10 WS-PRODUCT-LIMITS-TABLE OCCURS 36 TIMES.
                 15 WS-PRD-MAX-DAILY      PIC S9(005) COMP-3.
                 15 WS-PRD-ALLOW-ORIG     PIC S9(005) COMP-3.

JS0604     05 WS-PRODUCT-TRANSLATION-DATA.
              10 FILLER                   PIC X(04) VALUE '0000'.
              10 FILLER                   PIC X(04) VALUE '0101'.
              10 FILLER                   PIC X(04) VALUE '0202'.
              10 FILLER                   PIC X(04) VALUE '0303'.
              10 FILLER                   PIC X(04) VALUE '0404'.
              10 FILLER                   PIC X(04) VALUE '0505'.
              10 FILLER                   PIC X(04) VALUE '0606'.
              10 FILLER                   PIC X(04) VALUE '0707'.
              10 FILLER                   PIC X(04) VALUE '0808'.
              10 FILLER                   PIC X(04) VALUE '0909'.
              10 FILLER                   PIC X(04) VALUE '0A10'.
              10 FILLER                   PIC X(04) VALUE '0B11'.
              10 FILLER                   PIC X(04) VALUE '0C12'.
              10 FILLER                   PIC X(04) VALUE '0D13'.
              10 FILLER                   PIC X(04) VALUE '0E14'.
              10 FILLER                   PIC X(04) VALUE '0F15'.
              10 FILLER                   PIC X(04) VALUE '0G16'.
              10 FILLER                   PIC X(04) VALUE '0H17'.
              10 FILLER                   PIC X(04) VALUE '0I18'.
              10 FILLER                   PIC X(04) VALUE '0J19'.
              10 FILLER                   PIC X(04) VALUE '0K20'.
              10 FILLER                   PIC X(04) VALUE '0L21'.
              10 FILLER                   PIC X(04) VALUE '0M22'.
              10 FILLER                   PIC X(04) VALUE '0N23'.
              10 FILLER                   PIC X(04) VALUE '0O24'.
              10 FILLER                   PIC X(04) VALUE '0P25'.
              10 FILLER                   PIC X(04) VALUE '0Q26'.
              10 FILLER                   PIC X(04) VALUE '0R27'.
              10 FILLER                   PIC X(04) VALUE '0S28'.
              10 FILLER                   PIC X(04) VALUE '0T29'.
              10 FILLER                   PIC X(04) VALUE '0U30'.
              10 FILLER                   PIC X(04) VALUE '0V31'.
              10 FILLER                   PIC X(04) VALUE '0W32'.
              10 FILLER                   PIC X(04) VALUE '0X33'.
              10 FILLER                   PIC X(04) VALUE '0Y34'.
              10 FILLER                   PIC X(04) VALUE '0Z35'.
JS0604     05 FILLER REDEFINES WS-PRODUCT-TRANSLATION-DATA.
              15 WS-PRODUCT-TRANSLATION-TABLE OCCURS 36 TIMES
                                              INDEXED BY PTT-INDX.
                 20 WS-PTT-ALPHA          PIC X(02).
                 20 WS-PTT-NUM            PIC X(02).

JS0206*    03 FILLER.
      **** (WS-QUEUE-WORK-AREA) ****
              05 QUEUE-ID-AREA.
                 10 FILLER                PIC X(4) VALUE 'FP  '.
                 10 QID-TRMID             PIC X(4).
              05 WS-ITEM                  PIC 9(4) COMP VALUE 1.
              05 WS-Q-AREA.
MB0114           10 WS-Q-COMMAREA         PIC X(1800).
                 10 WS-Q-UNFORMATTED      PIC X(1197).
                 10 WS-Q-MAPLEN           PIC 9(5) COMP-3.

JS0206     05 WS-STANDARD-ITEM-PURCHASED   PIC X(01).
JS0206     05 WS-ADD-ON-APPLIES            PIC X(01).
JS0206     05 WS-CHECK-PRODUCT-FEE         PIC X(01).
JS0107     05 WS-HOLD-MIXED-FUEL-RATE            PIC S9(5)V99 COMP-3.
JS0107     05 WS-HOLD-BASE-FUEL-RATE             PIC S9(5)V99 COMP-3.
JS0107     05 WS-HOLD-DC-FEE-AMT-FUEL            PIC S9(5)V99 COMP-3.
JS0107     05 WS-PRDCUST-HAS-BEEN-READ           PIC X(1) VALUE 'N'.
JS0107     05 WS-PRDSCMM-HAS-BEEN-READ           PIC X(1) VALUE 'N'.
JS0107     05 WS-PRODUCT-FEE-FOUND               PIC X(1).

082008***** WORK AREA FOR LARGE TRANSACTION INTERIM (LTI) PROJ CHGS
082008     05 WS-NO-TRANS-SPLIT-FLAG    PIC  X(01)    VALUE SPACE.
082008     05 WS-LTI-SW                 PIC  X(01)    VALUE SPACE.
082008       88 WS-LARGE-TRANS-SPLITS                 VALUE 'Y'.
052311     05 WS-LTI-WITH-TAX-SW        PIC  X(01)    VALUE SPACE.
052311       88 WS-LARGE-TRANS-WITH-TAX               VALUE 'Y'.
052311     05 WS-LTI-TAX-SW             PIC  X(01)    VALUE SPACE.
052311       88 WS-LARGE-TRANS-SPLITS-TAX             VALUE 'Y'.
082008     05 WS-LTI-SW2                PIC  X(01)    VALUE SPACE.
082008       88 WS-LTI-SC-CURRENCY                    VALUE 'S'.
082008     05 WS-LTI-SUB1               PIC S9(03)    VALUE ZERO.
082008       88 LTI-FIRST-PASS                        VALUE 1.
082008       88 LTI-SECOND-PASS                       VALUE 2.
082008     05 WS-LTI-LAST-FLAG          PIC  X(01)    VALUE SPACE.
082008       88 LTI-LAST-PASS                         VALUE 'Y'.
082008     05 WS-LTI-SUB2               PIC S9(01)    VALUE ZERO.
082008     05 WS-LTI-SPLIT-COUNT        PIC S9(03)    VALUE ZERO.
052711     05 WS-LTI-AMT-TO-ADD         PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-AMT-TO-SUBTRACT    PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-QTY-TO-ADD         PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-QTY-TO-SUBTRACT    PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-TAX-RATE           PIC S9(1)V9(3) COMP-3 VALUE +0.
052311     05 WS-LTI-TRANS-AMT          PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-INIT-SPLIT-VALUE   PIC S9(05)    VALUE ZERO.
052311     05 WS-LTI-INIT-SPLIT-NBR1    PIC S9(05)    VALUE ZERO.
052311     05 WS-LTI-INIT-SPLIT-NBR2    PIC S9(05)    VALUE ZERO.
052311     05 WS-LTI-INIT-SPLIT-REFER   PIC S9(05)    VALUE ZERO.
052311     05 WS-LTI-INIT-SPLIT-OTHER   PIC S9(05)    VALUE ZERO.
052311     05 WS-LTI-PCT-XTN-NBR1       PIC 9V999     VALUE ZERO.
052311     05 WS-LTI-PCT-XTN-NBR2       PIC 9V999     VALUE ZERO.
052311     05 WS-LTI-PCT-XTN-REFER      PIC 9V999     VALUE ZERO.
052311     05 WS-LTI-PCT-XTN-OTHER      PIC 9V999     VALUE ZERO.
082008     05 WS-LTI-WORK-AMT           PIC S9(05)V99 VALUE ZERO.
071009     05 WS-LTI-WORK-AMT2          PIC S9(05)V99 VALUE ZERO.
082008     05 WS-LTI-SPLIT-AMT          PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-SPLIT-AMT-NBR1     PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-SPLIT-AMT-NBR2     PIC S9(05)V99 VALUE ZERO.
ED0113     05 WS-LTI-SPLIT-AMT-NBR2-HLD PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-SPLIT-AMT-REFER    PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-SPLIT-AMT-OTHER    PIC S9(05)V99 VALUE ZERO.
ED0113     05 WS-LTI-SPLIT-AMT-OTHER-HLD
ED0113                                  PIC S9(05)V99 VALUE ZERO.
ED0113     05 WS-LTI-OVER-AMT-HLD       PIC S9(05)V99 VALUE ZERO.
082008     05 WS-LTI-OVER-QTY           PIC S9(05)V99 VALUE ZERO.
082008     05 WS-LTI-OVER-AMT           PIC S9(05)V99 VALUE ZERO.
082008     05 WS-LTI-MOVE-QTY           PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-NR1      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-NR2      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-REF      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-OTH      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-NR1       PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-NR2       PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-REF       PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-OTH       PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-NR1-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-NR2-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-REF-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-QTY-OTH-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-NR1-OTH   PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-NR2-OTH   PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-REF-OTH   PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-QTY-OTH-OTH   PIC S9(05)V99 VALUE ZERO.
082008     05 WS-LTI-MOVE-AMT           PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-TAX      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-NR1      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-NR2      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-REF      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-OTH      PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-NR1       PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-NR2       PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-REF       PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-OTH       PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-TAX-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-NR1-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-NR2-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-REF-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-TOTAL-AMT-OTH-OTH  PIC S9(05)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-NR1-OTH   PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-NR2-OTH   PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-REF-OTH   PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-OTH-OTH   PIC S9(07)V99 VALUE ZERO.
052711     05 WS-LTI-HOLD-AMT-TAX-OTH   PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-HOLD-AMT-TAX       PIC S9(05)V99 VALUE ZERO.
052311     05 WS-LTI-MOVE-TAX           PIC S9(05)V99 VALUE ZERO.
082008     05 WS-LTI-PERCENT            PIC S9V9(06)  VALUE ZERO.
082008     05 WS-PERFORM-SW             PIC  X(01)    VALUE SPACE.
082008     05 WS-TRANS-GALLONS          PIC S9(05)V99 VALUE ZERO.
082008     05 WS-HOLD-TRANS-GALLONS     PIC S9(05)V99 VALUE ZERO.
082008     05 WS-COMSITE-OLD-FORMAT     PIC  X(01)    VALUE SPACE.
082008     05 FP-0175A-FIRST-PASS-SW    PIC  X(01)    VALUE SPACE.
082008       88 FP-0175A-FIRST-PASS                     VALUE 'Y'.
120412     05 WS-BYPASS-LOG-DISCOUNT    PIC  X(01)    VALUE 'N'.
082008***** THESE FLAGS ONLY USED FOR TRANSACTION CANCELLATION
082008     05 WS-LTI-FMLOG-FOUND        PIC  X(01)    VALUE SPACE.
082008     05 WS-LTI-HOLD-FMLOG-RRN     PIC S9(07) VALUE +0 COMP SYNC.
CP1211     05 WS-LTI-SKIP-FMLOG-RRN     PIC S9(07) VALUE +0 COMP SYNC.
082008     05 WS-LTI-LAST-FMLOG-RRN     PIC S9(07) VALUE +0 COMP SYNC.
082008***** HOLD AREA FOR LARGE TRANSACTION INTERIM (LTIH)
082008     05 WS-LTI-HOLD-AREAS.
082008       10 WS-LTIH-FMLOG           PIC  X(2040)  VALUE SPACE.
082008       10 WS-LTIH-CASH-AMT        PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-TAX-AMT-SC      PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-BILLABLE        PIC S9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-NON-BILLABLE    PIC S9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-CURXMN2         PIC S9(06)V99        VALUE ZERO.
082008       10 WS-LTIH-CURXMN          PIC S9(06)V99        VALUE ZERO.
CP1011       10 WS-LTIH-CONTROL-NR      PIC  9(07)           VALUE ZERO.
082008       10 WS-LTIH-DRAFT-AMT       PIC  9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-FP-TRANS-AMT    PIC  9(05)V99        VALUE ZERO.
082008       10 WS-LTIH-TOTAL-REQUEST   PIC S9(06)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-TRANS-GALLONS   PIC S9(05)V99 VALUE ZERO.
082008       10 WS-LTIH-TRANS-GALLONS2  PIC S9(05)V99 VALUE ZERO.
082008       10 WS-LTIH-HUB             PIC S9(06)V9  VALUE ZERO.
120412       10 WS-LTIH-SELECT-DISC     PIC S9(03)V99 COMP-3 VALUE ZERO.
JS0618       10 WS-LTIH-TOTAL-TAX-SC    PIC S9(05)V99 COMP-3 VALUE ZERO.
082008     05 WS-LTI-PROD-HOLD-AREAS.
082008       10 WS-LTIH-PROD-BILLABLE   PIC S9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-PROD-BILLABLE2  PIC S9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-PROD-NON-BILLABLE
082008                                  PIC S9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-PROD-NON-BILLABLE2
082008                                  PIC S9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-PROD-BILLABLE-FUEL
082008                                  PIC S9(05)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-PROD-NON-BILLABLE-FUEL
082008                                  PIC S9(05)V99 COMP-3 VALUE ZERO.
082008     05 WS-LTI-UIWA-AREAS.
082008       10                         PIC  X(01)           VALUE 'N'.
082008       10 WS-LTIH-UIWA-NR1-QTY    PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-UIWA-NR1-COST   PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10                         PIC  X(01)           VALUE 'N'.
082008       10 WS-LTIH-UIWA-NR2-QTY    PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-UIWA-NR2-COST   PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10                         PIC  X(01)           VALUE 'N'.
082008       10 WS-LTIH-UIWA-REF-QTY    PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-UIWA-REF-COST   PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10                         PIC  X(01)           VALUE 'N'.
082008       10 WS-LTIH-UIWA-OTH-QTY    PIC S9(07)V99 COMP-3 VALUE ZERO.
082008       10 WS-LTIH-UIWA-OTH-COST   PIC S9(07)V99 COMP-3 VALUE ZERO.
082008     05 FILLER REDEFINES WS-LTI-UIWA-AREAS  OCCURS 4 TIMES.
082008       10 WS-LTI-ZERO-FLAG        PIC  X(01).
082008       10 WS-LTIH-UIWA-QTY        PIC S9(07)V99 COMP-3.
082008       10 WS-LTIH-UIWA-AMT        PIC S9(07)V99 COMP-3.
052311     05 WS-LTIH-UIWA-AMT-TAX      PIC S9(07)V99 COMP-3 VALUE ZERO.
082008***** THE FIELDS IN THIS BLOCK ARE VALUES ON CDNCUST, SCMSTR, ETC.
082008***** THAT NEED TO BE ALTERED DURING LARGE TRANSACTION SPLIT
082008***** PROCESSING WITHOUT ALTERING THE ORIGINAL VALUE ON THE FILE
082008     05 WS-LTI-FILE-DATA-AREA.
082008       10 WS-CDN-GUAR-YN                PIC  X(01).
082008       10 WS-CDN-ALL-HANDLING-ADD-ON    PIC S9(3)V99  COMP-3.
082008       10 WS-CDN-ALL-HANDLING-ADD-ON-AC PIC S9(3)V99  COMP-3.
082008       10 WS-CDN-MANUAL-ADD-ON          PIC S9V99     COMP-3.
082008       10 WS-CDN-COST-PLUS-ADD-ON       PIC S9V99     COMP-3.
082008       10 WS-CDN-COST-PLUS-ADD-ON-AC    PIC S9V99     COMP-3.
082008       10 WS-SCM-CORP-REBATE-LOCATION   PIC  X(10).
082008       10 WS-SCM-CORP-REBATE-FLAG       PIC  X(01).
082008       10 WS-SCPM-PP-PAC-MARKUP         PIC S9(2)V999 COMP-3.
080210***** WORK AREAS FOR IRIS/CXXCO0FC PROCESSING
ED0810     05 WS-NOTIFY-IRIS-FL          PIC  X(01)  VALUE 'Y'.
080210     05 WS-CIX-RESP-REQUESTED      PIC  X(01)  VALUE 'N'.
080210     05 WS-CIX-MESSAGE-TYPE        PIC  X(04)  VALUE SPACE.
080210     05 WS-CIX-CARD-NR             PIC  9(16)  VALUE ZERO.
080210     05 WS-COMPANY-STANDARD-ID     PIC  9(05)  VALUE ZERO.
080210     05 WS-POS-ERROR-NUMBER        PIC  9(05)  VALUE ZERO.
080210     05 WS-AMOUNT-NO-DECIMAL-06    PIC  9(06)  VALUE ZERO.
080210     05 WS-AMOUNT-NO-DECIMAL-09    PIC  9(09)  VALUE ZERO.
080210     05 WS-AMOUNT-NO-DECIMAL-12    PIC  9(12)  VALUE ZERO.
BW0211     05 WS-CODES-AMOUNT.
BW0211        10 WS-CODES-AMT            PIC 9(7)V99 VALUE ZERO.
MB0912     05 WS-TAX-ADDED               PIC  X(01)  VALUE 'N'.
061815     05 WS-SAVE-UIWA-NR1-COST-SC   PIC S9(07)V99 COMP-3 VALUE +0.
061815     05 WS-SAVE-UIWA-NR2-COST-SC   PIC S9(07)V99 COMP-3 VALUE +0.
061815     05 WS-SAVE-UIWA-REF-COST-SC   PIC S9(07)V99 COMP-3 VALUE +0.
061815     05 WS-SAVE-UIWA-OTH-COST-SC   PIC S9(07)V99 COMP-3 VALUE +0.
061815     05 WS-SAVE-UIWA-OIL-COST-SC   PIC S9(07)V99 COMP-3 VALUE +0.

SB0315     05 WS-FUELUP-WORK-AREA.
SB0315        10 WS-FUELUP-SW             PIC X(01) VALUE ' '.
SB0315           88 FUELUP-YES                      VALUE 'Y'.
SB0315           88 FUELUP-NO                       VALUE 'N'.
SB0315        10 FUELUP-PRICE-DIFF        PIC S9(5)V99  COMP-3 VALUE +0.
SB0315        10 FUELUP-CASH-PRICE        PIC S9(2)V999 COMP-3 VALUE +0.
SB0315        10 FUELUP-RETAIN-FEE        PIC S9(5)V99  COMP-3 VALUE +0.
SB0315        10 FUELUP-SC-TR-TRACTOR-COST
SB0315                                    PIC S9(7)V99  COMP-3 VALUE +0.
SB0315        10 FUELUP-NEW-TRACTOR-COST  PIC S9(7)V99  COMP-3 VALUE +0.

DR0321     05 WS-CVC3-PASSED-FLAG           PIC X     VALUE 'N'.
DR0321        88 CVC3-WAS-PASSED                      VALUE 'Y'.
DR0321     05 WS-SAVE-SRVC-CODE             PIC 9(03) VALUE ZEROES.
DR0321     05 WS-ATMW-DE48-71-ON-BEHALF     PIC X(40).
DR0321     05 FILLER REDEFINES WS-ATMW-DE48-71-ON-BEHALF.
DR0321        10 WS-ATMW-DE48-71 OCCURS 10 TIMES
DR0321                           INDEXED BY WS-DE48-71-INDX.
DR0321           15  WS-ATMW-DE48-71-SF1    PIC X(02).
DR0321           15  WS-ATMW-DE48-71-SF2    PIC X(01).
DR0321           15  WS-ATMW-DE48-71-SF3    PIC X(01).
DR0121     05 WS-SWIPED-DATA.
DR0121        10 WS-SWIPED-CARD             PIC 9(16).
SD0421        10 WS-SWIPED-OR-KEYED         PIC X.
SD0421           88 SWIPED-TRANSACTION   VALUE '='.
DR0121        10 WS-SWIPED-EXP-DT-YYMM      PIC X(04).
DR0121        10 WS-SWIPED-SRVC-CD          PIC X(03).
DR0121        10 WS-PROP-SWIPED-AREA.
DR0121           15                         PIC X.
DR0121           15 WS-PROP-SWIPED-CVC1     PIC X(03).
DR0121           15                         PIC X(12).
DR0121        10 WS-MC-SWIPED-AREA
DR0121            REDEFINES WS-PROP-SWIPED-AREA.
DR0121           15 WS-MC-SWIPED-CVC1       PIC X(03).
DR0121           15                         PIC X(13).
DR0121     05 WS-ATMW-TRACK2-DATA.
DR0121        10 WS-ATM-TRACK2-CARD         PIC 9(16).
DR0121        10                            PIC X.
DR0121        10 WS-ATM-TRACK2-EXP-DT-YYMM  PIC X(04).
DR0121        10 WS-ATM-TRACK2-SERVICE-CODE PIC X(03).
DR0121        10 WS-PROP-ATM-TRACK2-AREA.
DR0121           15                         PIC X.
DR0121           15 WS-PROP-ATM-TRACK2-CVC1 PIC X(03).
DR0121           15                         PIC X(11).
DR0121        10 WS-MC-ATM-TRACK2-AREA
DR0121            REDEFINES WS-PROP-ATM-TRACK2-AREA.
DR0121           15 WS-MC-ATM-TRACK2-CVC1   PIC X(03).
DR0121           15                         PIC X(12).
SD0122     05 WS-SWIPED-CARD-20             PIC X(20).
MP0221     05 WS-CVC1-FLAG                  PIC X(1) VALUE 'N'.
MP0221        88 CVC1-NOT-FOUND VALUE 'Y'.
MP0221     05 WS-CODES-CVC-DECLINE-FLG           PIC X(1) VALUE 'N'.
MP0221        88 CODES-CVC-DECLINE VALUE 'Y'.
SD0122     05 WS-CODES-CVC-TIME-LIMIT      PIC 9(09).

       01  WS-OTHER-WORK-AREA.
091509     03 WS-CREDITL-READ-SW        PIC  X(01)    VALUE SPACE.
091509     03 WS-CREDITL-AMOUNTS.
091509       10  WS-CREDIT-LIMIT          PIC S9(12)     VALUE ZERO.
091509       10  WS-UPDATE-OR-AR-BAL      PIC S9(09)V99  VALUE ZERO.
091509       10  WS-CASH-RECEIVED         PIC S9(09)V99  VALUE ZERO.
091509       10  WS-CURRENT-DAY           PIC S9(09)V99  VALUE ZERO.
080210     03 WS-CL-CO-CD              PIC  X(05)     VALUE SPACES.
102810     03 WS-USE-FLEET-LIMITS      PIC  X(01)     VALUE 'N'.
102810     03 WS-XCPL-PROD             PIC  X(05)     VALUE '00000'.
SB1115     03 WS-XCPL-PROD-R REDEFINES WS-XCPL-PROD.
SB1115        05 FILLER                PIC XX.
SB1115        05 WS-XCLP-PROD-NUM      PIC 99.
SB1115        05 FILLER                PIC X.
102810     03 WS-PRE-AUTH-CODES        PIC  X(01)     VALUE 'N'.
102810     03 WS-SUB-PROD-FIND         PIC  X(01)     VALUE 'N'.
102810     03 WS-PAC-SUB               PIC  9(02)     VALUE ZERO.
102810     03 WS-DFLT-NR2-SUB-PROD-IN  PIC  X(15)     VALUE SPACES.
102810     03 WS-DFLT-NR1-SUB-PROD-IN  PIC  X(15)     VALUE SPACES.
102810     03 WS-DFLT-REF-SUB-PROD-IN  PIC  X(15)     VALUE SPACES.
102810     03 WS-DFLT-OTH-SUB-PROD-IN  PIC  X(15)     VALUE SPACES.
102810     03 WS-CHK-HUB               PIC  X(01)     VALUE SPACE.
102810     03 WS-CURR-MIN              PIC S9(04)     VALUE ZERO.
041112     03 WS-CURR-MIN-WORK         PIC S9(04)     VALUE ZERO.
041112     03 WS-SETUP-XCPRODC-DONE    PIC  X(01)     VALUE SPACE.
041112     03 WS-PURC-TIME-UNPACK      PIC  9(05)     VALUE ZERO.
102810     03 WS-COMP-MIN              PIC S9(04)     VALUE ZERO.
102810     03 WS-ELAP-MIN              PIC S9(04)     VALUE ZERO.
102810     03 WS-DSCARD-DT             PIC  9(07)     VALUE ZERO.
102810     03 WS-DSCARD-TM             PIC  9(07)     VALUE ZERO.
102810     03 WS-DSCARD-CMPR-X         PIC  X(04).
102810     03 WS-DSCARD-CMPR REDEFINES WS-DSCARD-CMPR-X
102810                                 PIC S9(07) COMP-3.
102810     03 WS-DSCARD-END            PIC  X(01)     VALUE SPACE.
AA0921*    03 WS-NBC-KEY               PIC  X(29)     VALUE SPACES.
AA0921     03 WS-NBC-KEY               PIC  X(35)     VALUE SPACES.
102810     03 WS-MULTI-PART-PURCHASE   PIC  X(01)     VALUE SPACE.
102810     03 WS-BYPASS-CARD-NETW-UPDT PIC  X(01)     VALUE SPACE.
102810     03 WS-FLEET-LIMIT-CSH-AVAIL PIC  X(01)     VALUE SPACE.
102810     03 WS-FLEET-LIMIT-CSH-AMT   PIC S9(07)V99  VALUE ZERO.
102810     03 WS-AVAIL-AMT-OIL         PIC S9(03)V99  VALUE ZERO.
102810     03 WS-NO-FUEL-FEE-FLAG      PIC X(01)      VALUE SPACE.
102810        88 WS-NO-FUEL-FEE                       VALUE 'Y'.
102810     03 WS-FORCE-POST-FROM-PRE-AUTH  PIC X(01)  VALUE SPACE.
102810        88 FORCE-POST-FROM-PRE-AUTH             VALUE 'Y'.
102810     03 WS-POPULATED-SW.
102810       10 WS-MAX-NR2-POPULATED     PIC  X(01)   VALUE SPACE.
102810       10 WS-MAX-NR1-POPULATED     PIC  X(01)   VALUE SPACE.
102810       10 WS-MAX-REF-POPULATED     PIC  X(01)   VALUE SPACE.
102810       10 WS-MAX-OTH-POPULATED     PIC  X(01)   VALUE SPACE.
ED0213     03 WS-RESET-LAST-QTY-RFID   PIC  X(01)     VALUE 'N'.
MB1013     03 WS-PROPRIETARY-CARD      PIC  X         VALUE 'N'.
MB1113     03 WS-EXP-DATE-ERR          PIC  X         VALUE 'N'.
           03 WS-THIS-BE-A-RESTORE     PIC  X(01)     VALUE 'N'.
           03 WS-COMDATA-COMPLETE-READ PIC  X(01)     VALUE 'N'.
           03 WS-NR1-COST              PIC 99V9(07) COMP-3 VALUE ZERO.
           03 WS-NR2-COST              PIC 99V9(07) COMP-3 VALUE ZERO.
           03 WS-REF-COST              PIC 99V9(07) COMP-3 VALUE ZERO.
CP0506     03 WS-REF-RACK-PPG          PIC 99V9(07) COMP-3 VALUE ZERO.
SD0219* THESE ARE USED TO HOLD THE PPU PRICES AND COST AMOUNTS SO
SD0219* THAT TSFMO0CT CAN BE USED TO BACKOUT CANADIAN TAXES FROM
SD0219* NET PRICES. UNFORTUNATELY CT ONLY OPERATES ON THE UIWA BALANCES
SD0219     03 WS-NR1-PPU-HOLD            PIC S9(02)V9(3)    COMP-3.
SD0219     03 WS-NR1-COST-HOLD           PIC S9(07)V99      COMP-3.
SD0219     03 WS-NR2-PPU-HOLD            PIC S9(02)V9(3)    COMP-3.
SD0219     03 WS-NR2-COST-HOLD           PIC S9(07)V99      COMP-3.
SD0219     03 WS-REF-PPU-HOLD            PIC S9(02)V9(3)    COMP-3.
SD0219     03 WS-REF-COST-HOLD           PIC S9(07)V99      COMP-3.
SD0219     03 WS-OTH-PPU-HOLD            PIC S9(02)V9(3)    COMP-3.
SD0219     03 WS-OTH-COST-HOLD           PIC S9(07)V99      COMP-3.
090310***** CHG TO PIC 9(2) TO HANDLE ADDITIONAL COMPUTATION LOGIC
           03 WS-WEEKDAY               PIC 9(2) VALUE ZERO.
           03 WS-WEEKDAY-FOUND         PIC X(1).
090310     03 WS-CCPP-INDEX            PIC 9(2) VALUE ZERO.
090310     03 WS-CPC-CALC-DAYS         PIC 9(6) VALUE ZERO.
MB0714     03 X-WEEK                   PIC S9(4)    COMP.
MB0714     03 X-WEEK2                  PIC S9(4)    COMP.
MB0714     03 X-DAY                    PIC S9(4)    COMP.
MB0714     03 WS-WEEKS                 PIC S9(4)    COMP.
MB0714     03 WS-WEEK-FOUND            PIC X    VALUE 'N'.
MB0714     03 WS-FMRACKH-FOUND         PIC X    VALUE 'N'.
MB0714     03 WS-FOUND-ON-FMRACK       PIC X    VALUE 'N'.
MB0714     03 WS-WEEK-REMAINDER        PIC 99   VALUE ZERO.
MB0714     03 WS-WHICH-DAY             PIC 99   VALUE ZERO.
MB0714     03 WS-WORK-RPDT             PIC X(6).
MB0714     03 WS-WORK-FPDT             PIC X(6).
           03 WS-INDEX                 PIC 9(2).
           03 WS-INDEX2                PIC 9(2).
JS0298     03 WS-INDEX3                PIC 9(2).
           03 WS-WORK-DATE             PIC 9(7).
           03 WS-DAYS-TABLE            PIC 9(5) OCCURS 7 TIMES.
           03 WS-RACK-FLAG             PIC X(1).
           03 WS-CHECK-NR              PIC 9(9).
           03 FILLER REDEFINES WS-CHECK-NR.
              05 WS-CHECK-NR-1         PIC X(1).
              05 FILLER                PIC X(8).
           03 WS-REQUEST-SETTLE-FEES PIC X(1)          VALUE 'N'.
           03 WS-HOLD-CHECK-NR     PIC 9(10)           VALUE ZERO.
           03 WS-HOLD-PPG          PIC S99V999 COMP-3  VALUE +0.
           03 INDX                 PIC S9999 COMP SYNC VALUE +0.
           03 FILLER               REDEFINES INDX.
             05 FILLER             PIC X.
             05 INDX-LO            PIC X.
           03 INDX-1               PIC S9999 COMP SYNC VALUE +0.
           03 INDX-2               PIC S9999 COMP SYNC VALUE +0.
MP1208     03 INDX-3               PIC S9999 COMP SYNC VALUE +0.
           03 MOD10-SL             PIC S999 COMP-3 VALUE +0.
082008     03 WS-DISC              PIC S9(5)V99.
082008     03 WS-DISC-R1           REDEFINES WS-DISC PIC S999V9999.
           03 FILLER               REDEFINES WS-DISC.
082008        05 FILLER             PIC X(5).
              05 WS-DISC-DECIMAL    PIC S99.
082008     03 WS-CDN-DISC          PIC S9(5)V99.
           03 WS-CDN-DISC-DEC      PIC S99.
082008     03 WS-DISC-AMT          PIC S9(5)V99.
082008     03 FILLER               REDEFINES WS-DISC-AMT.
082008        05                     PIC XX.
082008        05 WS-DISC-AMT-R       PIC S9(05).
082008     03 WS-DISC-AMT-SAVE     PIC S9(5)V99.
CP0400     03 WS-EXTRA-AMT         PIC S9(7)V99 COMP-3 VALUE +0.
           03 WS-TSN-PRICE-CHANGE  PIC X VALUE 'P'.
             88 THIS-BE-A-TS-PRICE-CHANGE VALUE 'P'.
           03 SAVE-BY-GRACE-FLAG   PIC X VALUE SPACES.
      ****   88 THIS-OVERAGE-SAVED-BY-GRACE VALUE 'O'.
           03 SAVE-ZON-VER-FLAG    PIC X VALUE SPACES.
           03 WS-ID-NR.
              05 WS-ID-NR-NUM       PIC  9(7).
              05 WS-ID-NR-NUM-R     REDEFINES WS-ID-NR-NUM.
                 07 WS-ID-CHAR       PIC  9
                                     OCCURS 7 TIMES
                                     INDEXED BY ID-INDX.
              05 WS-ID-NR-CK-DIG    PIC  9.
           03 FILLER.
              05 WS-CKD-TOTAL       PIC  999.
              05 FILLER             REDEFINES WS-CKD-TOTAL.
                 07 FILLER           PIC XX.
                 07 WS-CKD-TOTAL-LO  PIC  9.
              05 WS-CKD-CALCULATED  PIC  9.
              05 WS-CKD-MULT-BY-2   PIC  99.
              05 FILLER             REDEFINES WS-CKD-MULT-BY-2.
                 07 WS-CKD-HI-ORDER  PIC  9.
                 07 WS-CKD-LO-ORDER  PIC  9.
           03 WS-PRM-CARD.
              05 WS-PRM-CARD-PREFIX PIC X(6)  VALUE ZEROES.
              05 WS-PRM-CARD-BASE-A.
                 07 FILLER           PIC X(9) VALUE ZEROES.
                 07 WS-PRM-CARD-CKD  PIC X    VALUE ZEROES.
              05 FILLER REDEFINES WS-PRM-CARD-BASE-A.
                 07 WS-PRM-CARD-NUM  PIC 9(10).
           03 FILLER               REDEFINES WS-PRM-CARD.
              05 WS-PRM-CARD-NR     PIC 9(15).
              05 FILLER             PIC X.
           03 WS-PRM-CARD-N REDEFINES WS-PRM-CARD PIC 9(16).
           03 WS-ENQ-CARD-NR       PIC 9(15)        VALUE ZEROES.
           03 WS-DATE-MDY          PIC 9(6).
           03 FILLER        REDEFINES WS-DATE-MDY.
              05 WS-DATE-MM        PIC 99.
              05 WS-DATE-DD        PIC 99.
              05 WS-DATE-YY        PIC 99.
           03 WS-CALC-DATE         PIC 9(5).
           03 FILLER REDEFINES WS-CALC-DATE.
              05 WS-CALC-YEAR      PIC 9(2).
              05 WS-CALC-DDD       PIC 9(3).
SB0315     03 WS-CALC-DAYS         PIC 9(6) VALUE ZEROES.
SB0217     03 WS-RESET-DAILY       PIC X(7) VALUE '1111111'.
           03 WS-PPG-VAR           PIC S9(3)V999 COMP-3.
           03 WS-TAX-TRIED-VAR     PIC S9(3)V999 COMP-3.
           03 WS-TAX-TRIED         PIC X(1) VALUE 'N'.
           03 WS-TAX-PPG-HOLD      PIC 9V999 VALUE ZEROES.
           03 HOLD-INP-PRICE-GALLON PIC S9(3)V999 COMP-3 VALUE +0.

           03 LEASEWAY-TRAN-FLAG   PIC X   VALUE 'N'.
      ****   88 THIS-IS-LEASEWAY           VALUE 'Y'.
           03 LEASEWAY-CARD.
              05 FILLER.
                 07 LC-ACCT-NR     PIC X(9).
                 07 FILLER         PIC X.
              05 LC-CARD-NR        PIC X(6).
           03 LS-DLXF-KEY.
              05 FILLER               PIC XX    VALUE 'LS'.
              05 FILLER.
                 07 LDK-ACCT-NR       PIC X(9).
                 07 LDK-CARD-NR       PIC X(6).
              05 FILLER               PIC X(5)   VALUE SPACES.
           03 WS-PRM-LAST-DATE-USED   PIC S9(5)  VALUE +0.
           03 WS-PRM-USED             PIC S9(5)V99  VALUE +0.
           03 WS-PRM-INITIAL          PIC S9(5)V99  VALUE +0.
           03 WS-CHARGE-RATE          PIC S9(5)V99  VALUE +0.
           03 WS-SUBTRACT-DISCOUNT    PIC S9(5)V99  VALUE +0.
           03 SAVE-REBATE-DISCOUNT-AMT    PIC S9(5)V99  VALUE +0.
           03 WS-HOLD-RATE            PIC S9(5)V99  VALUE +0.
           03 HLD-PURC-ONE-TIME       PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-PURC-ONE-TIME-PRI   PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-PURC-ONE-TIME-SEC   PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-CASH-ONE-TIME       PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-CASH-ONE-TIME-PRI   PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-CASH-ONE-TIME-SEC   PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-CASH-1TIME          PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-PRM-PURC-INITIAL    PIC S9(5)V99 COMP-3 VALUE +0.
           03 HLD-PRM-CASH-INITIAL    PIC S9(5)V99 COMP-3 VALUE +0.
           03 WS-TOTAL-PURC-AMOUNT    PIC S9(5)V99 COMP-3 VALUE +0.
           03 WS-TOTAL-CASH-AMOUNT    PIC S9(5)V99 COMP-3 VALUE +0.
           03 HOLD-FP-LAST-TRANSACTION-NR   PIC S9(9) COMP-3.
           03 HOLD-FP-DATE-LAST-TRANS     PIC S9(5) COMP-3.
           03 HOLD-FP-TIME-LAST-TRANS     PIC S9(6) COMP-3.
           03 HOLD-BALLIM-FLAG        PIC X         VALUE SPACE.
           03 HOLD-EIBTRNID           PIC X(4).
           03 WS-PACKED-CHECK         PIC S9(9) COMP-3 VALUE +0.
           03 WS-DRAFT-RECD           PIC X(159).
           03 WS-EXPRESS-AVAILABLE    PIC S9(6)V99.
           03 WS-PICKUP-RATE          PIC S9(3)V99.
           03 VR-VALIDATE-CHECK       PIC 9(10).
           03 FILLER REDEFINES VR-VALIDATE-CHECK.
              05 VR-FIRST-DIGIT       PIC 9.
              05 FILLER               PIC 9(9).
           03 FILLER REDEFINES VR-VALIDATE-CHECK.
              05 VR-FIRST-NINE        PIC 9(9).
              05 VR-CHECK-DIGIT       PIC 9.
           03 FILLER REDEFINES VR-VALIDATE-CHECK.
              05 VR-FIRST-FOUR        PIC 9(4).
              05 FILLER               PIC 9(6).
           03 WS-CHECK-DIGIT          PIC 9.
           03 WS-CHECK-RESULT         PIC 9(9).
           03 WS-FMDL-CUST-ID-FIXED   PIC X(10).
           03 RETURN-CDE              PIC X.
           03 DATA-LEN                PIC S99  COMP   VALUE +2.
           03 WS-REFERENCE-NR      PIC 9(9).
           03 FILLER            REDEFINES WS-REFERENCE-NR.
              05 WS-REFERENCE-DD   PIC 99.
              05 WS-REFERENCE-CTL  PIC 9(7).
           03 WS-REF-NINE-NR.
              05 WS-REF-NINE-DD    PIC 99.
              05 WS-REF-NINE-CTL   PIC 9(7).
           03 WS-REF-NINE-NR-R REDEFINES WS-REF-NINE-NR   PIC 9(9).
           03 OLD-TRANS-NR.
              05 OLD-TRANS-DD       PIC 99.
              05 OLD-TRANS-CTL-NR   PIC 9(5).
           03 WS-PHONE-WORK.
               05  WS-PHONE-AREA-CODE  PIC 9(3).
               05  WS-PHONE-PREFIX     PIC 9(3).
               05  WS-PHONE-NUMBER     PIC 9(4).
           03  WS-BINARY-FIELD         PIC S9(4)   COMP SYNC VALUE +0.
           03  FILLER  REDEFINES       WS-BINARY-FIELD.
               05  FILLER              PIC X.
               05  WS-BINARY-LOW       PIC X.
           03 WS-TSCODE.
              05 WS-TS-ALP         PIC XX.
              05 WS-TS-NUM         PIC 999.
           03 WS-TSCODE-COMP       PIC X(10).
           03 WS-PRM-RESET-FLAGS   PIC 9(7).
           03 WS-RESET-FLAG REDEFINES WS-PRM-RESET-FLAGS
                                   PIC X
                                   OCCURS 7 TIMES.
MN0905     03 WS-TOTAL-PRICE       PIC S9(5)V99.
082008     03 WS-DEVIATION         PIC S9(5)V999.
           03 WS-PERCENTAGES       PIC S9(9) VALUE +0.
           03 FILLER               REDEFINES WS-PERCENTAGES.
             05 WS-TOTAL-PRCNTAGE  PIC S999V99.
             05 WS-CDN-PRCNTAGE    PIC S99V99.
           03 WS-DRVNM.
             05 WS-DRVN PIC X OCCURS 8 TIMES INDEXED BY DRV-INDX.
           03 WS-CURR-DAY-TOTAL    PIC S9(6)V99 VALUE +0 COMP-3.
           03 WS-CSTTL             PIC S9(6)V99 VALUE +0.
           03 WS-CTR1              PIC S9(7) VALUE +0.
           03 SAVE-PCTUP           PIC SV99 VALUE ZERO.
           03 WRK-VARIANCE         PIC 99V999 COMP-3 VALUE 0.
           03 WRK-VARIANCE2        PIC 99V999 COMP-3 VALUE 0.
           03 WS-PPG-TAX-VAR       PIC SV9(5) COMP-3 VALUE ZEROES.
           03 OCR-FLAG             PIC S9 VALUE +0.
           03 WS-PHONENRX.
              05 WS-PHONENR        PIC 9(10).
           03 FILLER REDEFINES WS-PHONENRX.
              05 WS-PHONENR-AREA   PIC X(03).
              05 FILLER            PIC X(07).
           03 LTR-VALUE            PIC S9(5) VALUE +0.
           03 CURRENT-TIME-IN-SECONDS PIC S9(9) COMP-3.
           03 NON-PROD-FLAG        PIC X VALUE ' '.
             88 NON-PRODUCTION-REQUEST VALUE 'N'.
           03 PGRM-FUNCTION        PIC 9999 VALUE 0.
              88 PGRM-FUNCTION-CASH-ONLY    VALUE 0000.
              88 PGRM-FUNCTION-OIL-ONLY     VALUE 0001.
              88 PGRM-FUNCTION-PRODUCT-ONLY VALUE 1000.
           03 FILLER               REDEFINES PGRM-FUNCTION.
             05 PRODUCT-PURCHASE    PIC 9.
             05 TRAILER-PURCHASE    PIC 9.
             05 TRACTOR-PURCHASE    PIC 9.
             05 OIL-PURCHASE        PIC 9.
062209     03 GROCERY-PURCHASE    PIC 9(01) VALUE ZERO.
           03 GOLD-OK-FLAG        PIC X VALUE SPACES.
              88 GOLD-OK  VALUE 'G'.
           03 ERROR-FLAG          PIC X VALUE SPACE.
             88 THERE-WAS-AN-ERROR VALUE '*'.
           03 CP-ERROR-FLAG       PIC X VALUE SPACE.
           03 ERROR-TYPE          PIC X(39) VALUE SPACES.
           03 SAVE-XTN-FEE        PIC S9(5)V99 COMP-3 VALUE +0.
           03 SAVE-XCS-SETTLE-FEE PIC S9(5)V99 COMP-3 VALUE +0.
           03 SAVE-EQUIP-FEE      PIC S9(5)V99 COMP-3 VALUE +0.
           03 SAVE-SC-FEE         PIC S9(5)V99 COMP-3 VALUE +0.
           03 SAVE-HEADER-FLAG    PIC X               VALUE 'N'.
              88 THIS-IS-A-SDR-HEADER-2 VALUE 'Y'.
           03 SAVE-COUNT          PIC S9(3) COMP-3 VALUE +0.
           03 SAVE-AMOUNT         PIC S9(7)V99 COMP-3 VALUE +0.
           03 XCS-SETTLE-MSG.
              05 FILLER           PIC X(5) VALUE 'STL #'.
              05 XCS-SETTLE-COUNT PIC ZZ9.
           03 AMOUNT-TO-SETTLE    PIC S9(7)V99 COMP-3 VALUE +0.
           03 PRODUCT-TOTAL       PIC S9(7)V99 COMP-3 VALUE +0.
           03 PRODUCT-TOTAL2      PIC S9(7)V99 COMP-3 VALUE +0.
           03 WS-PO-PRODUCT-TOTAL PIC S9(7)V99 COMP-3 VALUE +0.
           03 PRODUCT-AMOUNT      PIC S9(7)V99 COMP-3 VALUE +0.
           03 CURRENT-DAY-PROD-TOTAL PIC S9(7)V99 COMP-3 VALUE +0.
           03 WS-DAY              PIC 9.
           03 PD-YYDDD            PIC 9(5).
           03 CHK-DAY             PIC 9.
           03 PRMLOG-LENGTH       PIC S999 COMP VALUE +352.
           03 CURRENT-DAY         PIC 9.
           03 ELAPSED-DAYS        PIC  9(5) COMP-3.
           03 REL-CUR-DAY         PIC S9(3) COMP-3.
           03 REL-LAST-DAY        PIC S9(3) COMP-3.
           03 WS-YTD-GALLONS       PIC S9(9)V99 COMP-3.
           03 WS-YTD-FUEL-TOTAL    PIC S9(7)V99 COMP-3.
           03 READ-ACCT-FLAG      PIC X   VALUE 'Y'.
              88 I-NEED-TO-READ-ACCT      VALUE 'Y'.
           03 READ-CUST-FLAG      PIC X   VALUE 'Y'.
              88 I-NEED-TO-READ-CUST      VALUE 'Y'.
           03 WS-RESET-ONE-TIME-PURC-FLAG PIC X(1) VALUE 'Y'.
              88 WS-RESET-ONE-TIME-PURC            VALUE 'Y'.
           03 WS-RESET-ONE-TIME-CASH-FLAG PIC X(1) VALUE 'Y'.
              88 WS-RESET-ONE-TIME-CASH            VALUE 'Y'.
SB0513     03 WS-PRMINFO-WRITE-SW         PIC X    VALUE ' '.
SB0513        88 PRMINFO-WRITE                     VALUE 'Y'.
SB0513     03 WS-PRMINFO-REWRITE-SW       PIC X    VALUE ' '.
SB0513        88 PRMINFO-REWRITE                   VALUE 'Y'.
SB0713     03 WS-SAVE-DIESEL-LIMIT        PIC S9(5) COMP-3.
SB0713     03 WS-SAVE-REEFER-LIMIT        PIC S9(5) COMP-3.
           03 HOLD-TRIP-NUMBER    PIC X(10).
SD0719     03 HOLD-TRIP-NUMBER-2  PIC X(10).
SD0719     03 HOLD-TRIP-NUMBER-3  PIC X(10).
           03 HOLD-TRIP-NUMBER-I  PIC X(10).
           03 WORK-TRIP-EDIT.
              05 TRIP-EDIT-CHAR PIC X OCCURS 10 TIMES.
           03 WORK-EDIT-EDIT.
              05 EDIT-EDIT-CHAR PIC X OCCURS 10 TIMES.
           03 WORK-INDEX         PIC 99    VALUE ZEROES.
           03 CANCEL-FLAG        PIC X     VALUE 'N'.
082008     03 WS-CONTINUE-CANCEL PIC X     VALUE SPACE.
           03 WS-NETW-OK         PIC X     VALUE 'N'.
           03 WS-TOTAL-OTHER     PIC S9(7)V99  VALUE +0.
           03 SC-HOLD-AREA       PIC X(1021).
           03 SCFUELP-STATUS-BYTE PIC S999 COMP-3 VALUE +0.
             88 SCFUELP-NOT-FOUND VALUE +1.
           03 WRK-PO-PRODUCT-CODE PIC XX.
           03 FILLER                REDEFINES WRK-PO-PRODUCT-CODE.
              05 WRK-PO-PROD-CODE-1 PIC X.
              05 WRK-PO-PROD-CODE-2 PIC X.
           03 FILLER                REDEFINES WRK-PO-PRODUCT-CODE.
              05 WRK-PO-PROD-N    PIC 99.
CP0807     03 READY-TO-UPDATE-UNITMST   PIC X VALUE 'N'.
      **** (CANADIAN WORK FIELDS) ****
           03 FILLER.
061212******** PICS CHANGED FROM V99 TO V9(5)
061212        05 WS-CANADIAN-DOLLARS    PIC S9(9)V9(5) VALUE ZEROS.
061212        05 WS-US-DOLLARS          PIC S9(9)V9(5) VALUE ZEROS.
              05 WS-GALLONS             PIC S9(5)V999 VALUE ZEROS.
              05 WS-AMOUNT              PIC S9(5)V999 VALUE ZEROS.
              05 WS-LITERS              PIC S9(5)V999 VALUE ZEROS.
              05 WS-QTS                 PIC  9(2)     VALUE ZEROS.
              05 WS-PPG                 PIC 9(3)V999  VALUE ZEROES.
              05 WS-PPL                 PIC 9(3)V999  VALUE ZEROES.
              05 HLD-EXPECTED-AMOUNT    PIC S9(7)V99  VALUE ZEROS.
              05 QUART-TO-LITER-RATE    PIC 9V9(6) VALUE 0.946332.
              05 LITER-TO-QUART-RATE    PIC 9V9(6) VALUE 1.056712.
              05 GALLON-TO-LITER-RATE   PIC 9V9(6) VALUE 3.785329.
              05 LITER-TO-GALLON-RATE   PIC 9V9(6) VALUE 0.264177.
              05 LIMITS-ALTERED-FOR-PO  PIC X      VALUE SPACES.
              05 US-TO-CAN-RATE         PIC S9999V9(08) VALUE ZERO.
              05 CAN-TO-US-RATE         PIC S9999V9(08) VALUE ZERO.
           03 WS-DRIVER-NR.
              05 WS-DRIVER-NR-1-TO-5    PIC X(5).
              05 WS-DRIVER-NR-6-TO-7    PIC X(2).
              05 FILLER                 PIC X(9).
           03 FMT-DRIVER-NR.
              05 FMT-DRIVER-NR-1-TO-5   PIC X(5).
              05 FILLER                 PIC X    VALUE '$'.
              05 FMT-DRIVER-NR-7-TO-8   PIC X(2).
           03 WRK-HUB-READING           PIC 9(6)V9.
           03 FILLER            REDEFINES WRK-HUB-READING.
              05 WRK-HUB-1ST-6          PIC X(6).
              05 FILLER                 PIC X.
           03 WS-SEL-DISC               PIC S9(3)V99 COMP-3.
           03 WS-SC-REV                 PIC S9(3)V99 COMP-3.
           03 WS-TRANS-NR               PIC 9(8).
           03 FILLER REDEFINES WS-TRANS-NR.
              05 WS-TRANS-ROLL          PIC 9(1).
              05 WS-TRANS-DD            PIC 9(2).
              05 WS-TRANS-SEQ           PIC 9(5).
           03 WS-TRANS-NR-WORK          PIC 9(9).
           03 FILLER REDEFINES WS-TRANS-NR-WORK.
              05 FILLER                 PIC 9(3).
              05 WS-TRANS-NR-WORK-ROLL  PIC 9(1).
              05 WS-TRANS-NR-WORK-SEQ   PIC 9(5).
           03 WRK-HHMMSS                PIC 9(6).
           03 FILLER       REDEFINES WRK-HHMMSS.
              05 WRK-HH                 PIC 99.
              05 WRK-MM                 PIC 99.
              05 FILLER                 PIC 99.
           03 FILLER       REDEFINES WRK-HHMMSS.
              05 WRK-HHMM               PIC 9(4).
              05 FILLER                 PIC 99.
           03 HLD-DELIV-TIME            PIC 9(4).
           03 DELIV-TIME-CTR            PIC 9(3).
           03 ITLG-RECORD.
              05 FILLER                 PIC X(5)  VALUE 'ITRC '.
              05 ITLG-DATA-STREAM2      PIC X(800).
           03 WS-ITDQ-LENGTH            PIC S9(4) COMP VALUE +805.
           03 WS-LOOP-FLAG              PIC X          VALUE 'N'.
           03 WS-EXIT-FLAG              PIC X          VALUE 'N'.
           03 WS-LOOP-FP-0100           PIC X          VALUE 'N'.
           03 WS-EXIT-PPG-CHECK         PIC X          VALUE 'N'.
           03 WS-ADD-TO-BILLABLE-FLAG   PIC X          VALUE 'N'.
           03 WS-WORK-AMOUNT            PIC S9(7)V99 COMP-3.
           03                           PIC X.
              88 WS-TRI-STATE-ACCT                     VALUE 'Y'.
              88 WS-TRI-STATE-ACCT-NOT                 VALUE 'N'.
           03 HLD-CRR-KEY.
              05 HLD-CRR-CUSTOMER-TYPE      PIC XX    VALUE 'CU'.
              05 HLD-CRR-CUSTOMER-ID        PIC X(10).
              05 HLD-CRR-SYSTEM-ID          PIC X(4)  VALUE 'FM  '.
              05 HLD-CRR-REPORT-CODE        PIC S9(5) COMP-3 VALUE +12.
              05 HLD-CRR-REPORT-FREQUENCY   PIC X     VALUE 'D'.
              05 HLD-CRR-RECV-CUSTOMER-TYPE PIC XX    VALUE 'AC'.
              05 HLD-CRR-RECV-CUSTOMER-ID   PIC X(10).
              05 FILLER                     PIC X(3)  VALUE LOW-VALUES.
MP0401     03 MA-CRR-KEY.
MP0401        05 MA-CRR-CUSTOMER-TYPE       PIC XX    VALUE 'CU'.
MP0401        05 MA-CRR-CUSTOMER-ID         PIC X(10).
MP0401        05 MA-CRR-SYSTEM-ID           PIC X(4)  VALUE 'FM  '.
MP0401        05 MA-CRR-REPORT-CODE         PIC S9(5) COMP-3 VALUE +85.
MP0401        05 MA-CRR-REPORT-FREQUENCY    PIC X     VALUE 'D'.
MP0401        05 MA-CRR-RECV-CUSTOMER-TYPE  PIC XX    VALUE 'AC'.
MP0401        05 MA-CRR-RECV-CUSTOMER-ID    PIC X(10).
MP0401        05 FILLER                     PIC X(3)  VALUE LOW-VALUES.
MB0106     03 BF-CRR-KEY.
MB0106        05 BF-CRR-CUSTOMER-TYPE       PIC XX    VALUE 'CU'.
MB0106        05 BF-CRR-CUSTOMER-ID         PIC X(10).
MB0106        05 BF-CRR-SYSTEM-ID           PIC X(4)  VALUE 'BF  '.
MB0106        05 BF-CRR-REPORT-CODE         PIC S9(5) COMP-3 VALUE +3.
MB0106        05 BF-CRR-REPORT-FREQUENCY    PIC X     VALUE 'D'.
MB0106        05 BF-CRR-RECV-CUSTOMER-TYPE  PIC XX    VALUE 'AC'.
MB0106        05 BF-CRR-RECV-CUSTOMER-ID    PIC X(10).
MB0106        05 FILLER                     PIC X(3)  VALUE LOW-VALUES.
CP0406     03 SUB-PROD-CRR-KEY.
CP0406        05 SP-CRR-CUSTOMER-TYPE       PIC XX    VALUE 'CU'.
CP0406        05 SP-CRR-CUSTOMER-ID         PIC X(10).
CP0406        05 SP-CRR-SYSTEM-ID           PIC X(4)  VALUE 'FM  '.
CP0406        05 SP-CRR-REPORT-CODE         PIC S9(5) COMP-3 VALUE +93.
CP0406        05 SP-CRR-REPORT-FREQUENCY    PIC X     VALUE 'D'.
CP0406        05 SP-CRR-RECV-CUSTOMER-TYPE  PIC XX    VALUE 'AC'.
CP0406        05 SP-CRR-RECV-CUSTOMER-ID    PIC X(10).
CP0406        05 FILLER                     PIC X(3)  VALUE LOW-VALUES.
           03 CALC-DISCOUNT-ONLY            PIC X     VALUE SPACES.
           03 WS-CASH-AMT-AVAIL             PIC S9(7)V99 VALUE ZEROES.
           03 WS-TOTAL-TRACTOR-GALLONS      PIC S9(9)  VALUE ZEROES.
           03 WS-READ-FMRELAT-SC-FLAG       PIC X      VALUE 'N'.
           03 WS-FMRELAT-SC-REC             PIC X(750).
           03 WS-READ-FMRELAT-CH-FLAG       PIC X      VALUE 'N'.
           03 WS-FMRELAT-CH-REC             PIC X(750).
           03 WS-READ-FMRELAT-CO-FLAG       PIC X      VALUE 'N'.
           03 WS-FMRELAT-CO-REC             PIC X(750).
           03 WS-RMR-SC-FOUND-SW            PIC 9.
           03 WS-RMR-CH-FOUND-SW            PIC 9.
           03 WS-RMR-CO-FOUND-SW            PIC 9.
           03 NBC-READ-STATUS               PIC X      VALUE ' '.
           03 HLD-NBC-KEY.
              05 HLD-NBC-CARD-LOCATION.
AA0921*          10 HLD-NBC-CARD-NUMBER     PIC X(10).
AA0921           10 HLD-NBC-CARD-NUMBER     PIC X(16).
                 10 HLD-NBC-LOCATION-CODE   PIC X(10).
              05 HLD-NBC-DATE-ADD           PIC 9(7) COMP-3.
              05 HLD-NBC-TIME-ADD           PIC 9(9) COMP-3.
           03 TRAILER-HOUR-WORK-FIELDS.
              05 WS-PREV-HOURS        PIC S9(6)V9 COMP-3 VALUE ZEROS.
              05 WS-CURRENT-HOURS     PIC S9(6)V9 COMP-3 VALUE ZEROS.
              05 WS-REEFER-HPG        PIC S9(6)V9 COMP-3 VALUE ZEROS.
           03 WS-RCP-WORK-FIELDS.
              05 WS-CHECK-RCP-INP     PIC 9(1)V9(4).
              05 WS-CHECK-RCP-SCM     PIC 9(1)V9(4).
              05 WS-RCP-WORK-FLD      PIC 9(1)V9(5).
              05 WS-RCP-WORK-TAX1     PIC 9(3)V99.
              05 WS-RCP-WORK-TAX2     PIC 9(3)V99.
              05 WS-RCP-QST-RATE      PIC 9(1)V9(5) VALUE ZERO.
              05 WS-RCP-GST-RATE      PIC 9(1)V9(5) VALUE ZERO.
              05 WS-RCP-PPL           PIC 9(1)V9(5).
JS0699     03 WS-TAX-WORK-FIELDS.
JS0699        05 WS-TAX-QUANTITY      PIC 9(7)V99.
JS0699        05 WS-TAX-PPL           PIC 9(3)V9(5).
JS0699        05 WS-TAX-COST          PIC 9(7)V99.
JS0699        05 WS-TAX-COST-HOLD     PIC 9(7)V99.
JS0699        05 WS-TAX-AMOUNT        PIC 9(7)V99.
JS0699        05 WS-TAX-PPL-WORK      PIC 9(3)V9(5).
JS0699        05 WS-TAX-PST-RATE      PIC 9(3)V9(5) VALUE ZERO.
JS0699        05 WS-TAX-GST-RATE      PIC 9(3)V9(5) VALUE ZERO.
DEBUG *****03 WS-CXMLOG-MESSAGE            PIC X(132).
050712     03 WS-CXML-UNPACK               PIC 9(09)  VALUE ZERO.
CP0809     03 WS-CXML-DATA.
CP0809        05 FILLER                    PIC X(03) VALUE 'US '.
CP0809        05 WS-CXML-DATE              PIC 9(05).
CP0809        05 FILLER                    PIC X(01) VALUE ' '.
CP0809        05 WS-CXML-TIME              PIC 99B99B99.
CP0809        05 FILLER                    PIC X(01) VALUE ' '.
CP0809        05 WS-CXML-WORK              PIC X(114).
CP0406     03 WS-SUB-PROD-WORK-FIELDS-X.
CP0406        05 WS-CP-FOR-SUBPROD        PIC X(1) VALUE 'N'.
CP0406        05 WS-READ-SCSTATE-XY-SW    PIC X(1) VALUE 'N'.
CP0506        05 WS-READ-SCSTATE-SW       PIC X(1) VALUE 'N'.
CP0406        05 WS-NR2-CP-SET            PIC X(01) VALUE 'N'.
CP0406        05 WS-NR1-CP-SET            PIC X(01) VALUE 'N'.
CP0406        05 WS-REF-CP-SET            PIC X(01) VALUE 'N'.
CP0406     03 WS-SUB-PROD-WORK-FIELDS.
CP0406        05 WS-SUB-PROD-IN           PIC X(15).
CP0406        05 WS-SUB-PROD-OUT          PIC X(3).
SD0222        05 WS-SUB-PROD-CODE         PIC X(3).
CP0406        05 WS-SUB-PROD-CODE-TYPE    PIC X(1).
CP0406        05 WS-SUB-PROD-FUEL-TYPE    PIC X(2).
CP0406        05 WS-SUB-PROD-FOUND        PIC X(1).
SB0107        05 WS-NATS-PROD-IN          PIC X(3).
SB0107        05 WS-NATS-PROD-OUT         PIC X(15).
CP0506        05 WS-TAX-CALC-AMT          PIC 9V9(5) VALUE ZEROS.
CP0406        05 WS-HOLD-NR2-SUB-PROD-IN  PIC X(15).
CP0406        05 WS-HOLD-NR1-SUB-PROD-IN  PIC X(15).
CP0406        05 WS-HOLD-REF-SUB-PROD-IN  PIC X(15).
CP0406        05 WS-HOLD-OTH-SUB-PROD-IN  PIC X(15).
CP0406        05 WS-HOLD-NR2-CP-SUFFIX    PIC X(02) VALUE SPACES.
CP0406        05 WS-HOLD-NR1-CP-SUFFIX    PIC X(02) VALUE SPACES.
CP0406        05 WS-HOLD-REF-CP-SUFFIX    PIC X(02) VALUE SPACES.
CP0406        05 WS-CP-SUFFIX             PIC X(02) VALUE SPACES.
CP0406        05 CP-IDX                   PIC 9(01).
MB0714        05 WS-NR2-RP-PRICE-TABLE.
MB0714           10 WS-NR2-RP-PRICE-INFO OCCURS 7 TIMES.
MB0714              15 WS-NR2-RP-DATE       PIC S9(7)      COMP-3.
MB0714              15 WS-NR2-RP-NR1-PPG    PIC S9V9999    COMP-3.
MB0714              15 WS-NR2-RP-NR2-PPG    PIC S9V9999    COMP-3.
MB0714        05 WS-NR1-RP-PRICE-TABLE.
MB0714           10 WS-NR1-RP-PRICE-INFO OCCURS 7 TIMES.
MB0714              15 WS-NR1-RP-DATE       PIC S9(7)      COMP-3.
MB0714              15 WS-NR1-RP-NR1-PPG    PIC S9V9999    COMP-3.
MB0714              15 WS-NR1-RP-NR2-PPG    PIC S9V9999    COMP-3.
MB0714        05 WS-REF-RP-PRICE-TABLE.
MB0714           10 WS-REF-RP-PRICE-INFO OCCURS 7 TIMES.
MB0714              15 WS-REF-RP-DATE       PIC S9(7)      COMP-3.
MB0714              15 WS-REF-RP-NR1-PPG    PIC S9V9999    COMP-3.
MB0714              15 WS-REF-RP-NR2-PPG    PIC S9V9999    COMP-3.
KB1007     03 WS-ONL-CROSS-BORDER-FIELDS.
KB1007        05 WS-ONL-CRD-XBORDER-ASS-PCT PIC SV9(5)  COMP-3 VALUE +0.
KB1007        05 WS-ONL-ATM-XBORDER-ASS-PCT PIC SV9(5)  COMP-3 VALUE +0.
KB1007        05 WS-ONL-POS-XBORDER-ASS-PCT PIC SV9(5)  COMP-3 VALUE +0.
KB1007     03 WS-XBORDER-FIELDS.
KB1007        05 WS-XBORDER-DEFAULT-PCT     PIC SV9(5)  COMP-3
KB1007                                                  VALUE +.00800.
KB1007        05 WS-XBORDER-ASSMT-PCT       PIC SV9(5)  COMP-3 VALUE +0.
KB1007        05 WS-XBORDER-ASSMT-AMT       PIC S9(7)V99
KB1007                                                  COMP-3 VALUE +0.
CP0910     03 WS-HLD-CAR-TAX-ID             PIC X(10)   VALUE SPACES.
SB0114     03 WS-HOLD-UIWA-TAX-FIELDS.
SB0114        05 WS-HOLD-UIWA-NR2-COST-SC  PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-NR2-PPU-SC   PIC S9(02)V9(3)    COMP-3.
SB0114        05 WS-HOLD-UIWA-NR2-SUB-PROD PIC X(03).
SB0114        05 WS-HOLD-UIWA-NR2-QTY      PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-NR2-QTY-SC   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-NR2-QTY-US   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-NR1-COST-SC  PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-NR1-PPU-SC   PIC S9(02)V9(3)    COMP-3.
SB0114        05 WS-HOLD-UIWA-NR1-SUB-PROD PIC X(03).
SB0114        05 WS-HOLD-UIWA-NR1-QTY      PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-NR1-QTY-SC   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-NR1-QTY-US   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-REF-PPU-SC   PIC S9(02)V9(3)    COMP-3.
SB0114        05 WS-HOLD-UIWA-REF-COST-SC  PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-REF-SUB-PROD PIC X(03).
SB0114        05 WS-HOLD-UIWA-REF-QTY      PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-REF-QTY-SC   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-REF-QTY-US   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-OTH-PPU-SC   PIC S9(02)V9(3)    COMP-3.
SB0114        05 WS-HOLD-UIWA-OTH-COST-SC  PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-OTH-SUB-PROD PIC X(03).
SB0114        05 WS-HOLD-UIWA-OTH-QTY      PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-OTH-QTY-SC   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-OTH-QTY-US   PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-OIL-COST-SC  PIC S9(07)V99      COMP-3.
SB0114        05 WS-HOLD-UIWA-OIL-QTY      PIC S9(07)         COMP-3.
SB0114        05 WS-HOLD-UIWA-PR1-COST     PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR1-COST-SC  PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR1-COST-US  PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR2-COST     PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR2-COST-SC  PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR2-COST-US  PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR3-COST     PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR3-COST-SC  PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-PR3-COST-US  PIC S9(7)V99       COMP-3.
SB0114        05 WS-HOLD-UIWA-TAX-AMT-SC   PIC S9(7)V99 VALUE +0 COMP-3.
SB0114        05 WS-ORIG-UIWA-TAX-AMT-SC   PIC S9(7)V99 VALUE +0 COMP-3.
SB0114     03 WS-HOLD-BILL-FIELDS.
SB0114        05 WS-HOLD-BILLABLE          PIC S9(5)V99 VALUE +0 COMP-3.
SB0114        05 WS-HOLD-NON-BILLABLE      PIC S9(5)V99 VALUE +0 COMP-3.
SB0114     03 WS-RET-PROD-PRICE            PIC S9(5)V99 VALUE +0 COMP-3.
DR1117     03 WS-INTERVAL-CONTROL-X         PIC X(06).
DR1117     03 WS-INTERVAL-CONTROL
DR1117          REDEFINES
DR1117            WS-INTERVAL-CONTROL-X     PIC 9(06).
DR1117     03 WS-INTERVAL-CONTROL-PACKED    PIC S9(07) COMP-3.
DR1117
DR1117*-----------------------------*
DR1117* FMTB COMMAREA FIELDS        *
DR1117*-----------------------------*
DR1117 01 WS-FMTB-COMMAREA.
DR1117     05 WS-FMTB-CRD-NBR               PIC X(20).
DR1117     05 WS-FMTB-MRCH-NBR              PIC X(10).
DR1117     05 WS-FMTB-PRE-AUTH-DT           PIC X(10).
DR1117     05 WS-FMTB-PRE-AUTH-TS           PIC X(26).
DR1117     05 WS-FMTB-POST-FLG              PIC X(01).

CP0807** THE FOLLOWING WS FIELDS REPLACE FPMASTR FIELDS THAT WERE
CP0807** ALWAYS OVERWRITTEN WITH VALUES FROM OTHER FILES.
CP0807 01  WS-FLAGS-AND-LIMITS.
CP0807     05 WS-FP-ACCT-CODE            PIC X(10).
CP0807     05 WS-UNITMST-RECD-SW         PIC X(01)  VALUE 'Y'.
CP0807     05 WS-FL-HUBOMETER-FLAG       PIC X(01).
CP0417        88 HUB-READING-REQUIRED        VALUE 'Y','P','R'.
CP0807     05 WS-FL-DRIVER-NAME-FLAG     PIC X(01).
CP0807        88 CO-INPUTS-DRIVER-NAME       VALUE 'D'.
CP0807     05 WS-FL-TRIP-ALLOWANCE-FLAG  PIC X.
CP0807        88 TRIP-ALLOWANCE-SET          VALUE 'T'.
CP0807     05 WS-FL-TRIP-FLAG            PIC X.
CP0807        88 TRIP-NR-REQ-THIS-UNIT       VALUES 'T' 'B' 'D' 'C'.
CP0807        88 TRIP-NR-ENTERED             VALUE 'E'.
CP0807     05 WS-FL-CASH-ADV-STATUS      PIC X.
CP0807     05 WS-FL-CASH-ADV-USED-DLY    PIC S9(9)V99     VALUE ZEROS.
CP0807     05 WS-FL-CASH-ADV-FLAG        PIC X.
CP0807     05 WS-FL-CASH-ADV-RATE        PIC S9V99 COMP-3 VALUE ZEROS.
CP0807     05 WS-FL-OIL-BLOCK            PIC X.
CP0807        88 NO-OIL-PURCHASE-ALLOWED-THIS-U VALUE 'Y'.
CP0807     05 WS-FL-MAX-OIL-QTS          PIC S999 COMP-3 VALUE ZEROS.
CP0807     05 WS-FL-SERVICE-RESTRICTION  PIC X.
CP0807        88 SELF-SERVICE-ONLY       VALUE 'S'.
CP0807        88 SELF-MINI-SERVICE       VALUE 'M'.
CP0807     05 WS-FL-REFER-BLOCK          PIC X.
CP0807        88 REFER-IS-BLOCKED        VALUE 'Y'.

CP0807** THE FOLLOWING WS FIELDS ARE INITIALLY POPULATED FROM UNITMST
CP0807** BUT CAN BE OVERWRITTEN WITH VALUES FROM OTHER FILES.
CP0807 01  WS-REUSED-FLAGS-AND-LIMITS.
CP0807     05 WS-RFL-CASH-ADV-INIT       PIC S9(9)V99    VALUE ZEROS.
CP0807     05 WS-RFL-CASH-ADV-USED       PIC S9(9)V99    VALUE ZEROS.
CP0807     05 WS-RFL-CASH-ADV-INIT-DLY   PIC S9(9)V99    VALUE ZEROS.
CP0807     05 WS-RFL-CASH-ADV-DAILY-FLAG PIC X.
CP0807        88 CASH-ADV-DAILY-SET          VALUE '*'.
CP0807     05 WS-RFL-MAX-PURC-VARIANCE   PIC S999V99     VALUE ZEROS.
CP0807     05 WS-RFL-MAX-PURC-VARIANCE-R REDEFINES
CP0807        WS-RFL-MAX-PURC-VARIANCE   PIC S9V9999.
CP0807     05 WS-RFL-MAX-PURC-DLY-FUEL   PIC S9(9)V99    VALUE ZEROS.

      *********************************************************
      * CURRENT DATE WORK FIELDS                              *
      *********************************************************
       01  WS-BUSINESS-DATE-WORK-FIELDS.
           05 WS-BUSINESS-DATE-YYYYMMDD.
              10 WS-BUSINESS-DATE-YYYYMMDD-N    PIC 9(8).
           05 WS-BUSINESS-DATE-CYYMMDD          PIC 9(7).
           05 FILLER REDEFINES WS-BUSINESS-DATE-CYYMMDD.
              10 WS-BUSINESS-DATE-CENT          PIC 9(1).
              10 WS-BUSINESS-DATE-YYMMDD        PIC 9(6).
           05 WS-BUSINESS-DATE-YYYYMMDD-FMT     PIC XXXXBXXBXX.
           05 WS-BUSINESS-TIME-FMT              PIC 99B99B99.
           05 WS-BUSINESS-DATE-YYYYMM           PIC 9(6).

      *********************************************************
      * CURRENT DATE WORK FIELDS                              *
      *********************************************************
       01  WS-CURRENT-DATE-WORK-FIELDS.
           05 WS-CURRENT-DATE-CYYDDD           PIC 9(6).
           05 FILLER REDEFINES WS-CURRENT-DATE-CYYDDD.
              10 FILLER                        PIC 9(1).
              10 WS-CURRENT-DATE-YYDDD         PIC 9(5).

           05 WS-CURRENT-DATE-YYYYDDD          PIC 9(7).

           05 WS-CURRENT-DATE-CMMDDYY          PIC 9(7).
           05 FILLER REDEFINES WS-CURRENT-DATE-CMMDDYY.
              10 FILLER                        PIC 9(1).
              10 WS-CURRENT-DATE-MMDDYY        PIC 9(6).

           05 WS-CURRENT-YYYYMMDD-FMT          PIC 9999B99B99.
           05 WS-CURRENT-DATE-YYYYMMDD         PIC 9(8).
           05 FILLER REDEFINES WS-CURRENT-DATE-YYYYMMDD.
              10 WS-CURRENT-DATE-YYYYMMDD-CENT PIC 9(2).
              10 WS-CURRENT-DATE-YYYYMMDD-YY   PIC 9(2).
              10 WS-CURRENT-DATE-YYYYMMDD-MM   PIC 9(2).
              10 WS-CURRENT-DATE-YYYYMMDD-DD   PIC 9(2).
           05 FILLER REDEFINES WS-CURRENT-DATE-YYYYMMDD.
              10 FILLER                        PIC 9(2).
              10 WS-CURRENT-DATE-YYMMDD        PIC 9(6).

      *    ** (-SS = SUNDAY THRU SATURDAY -MS = MONDAY THRU SUNDAY) **
           05 WS-CURRENT-DATE-WEEKDAY-SS       PIC 9(1).
           05 WS-CURRENT-DATE-WEEKDAY-MS       PIC 9(1).
MB0106     05 WS-CURRENT-TS.
MB0106        10 WS-CURRENT-TS-DATE            PIC X(10).
MB0106        10 FILLER                        PIC X(01).
MB0106        10 WS-CURRENT-TS-TIME            PIC X(08).
MB0106        10 FILLER                        PIC X(07).
MB0106     05  WS-CURRENT-GMT.
MB0106         10  WS-GMT-DATE                 PIC X(10).
MB0106         10  FILLER                      PIC X(01).
MB0106         10  WS-GMT-TIME                 PIC X(08).
MB0106         10  FILLER                      PIC X(07).
MB0106     05 WS-POSTING-TIME                  PIC 99B99B99.

      **** (FP COMMON AREA) ****
AA0921     COPY TSFMW250 IN CPYREL.

       01  SETTLEMENT-COMMAREA.
           05 FILLER                   PIC X(4)  VALUE 'FP -'.
           05 SETL-LOC-O               PIC X(6).
           05 SETL-CHK-NR-O.
              10 SETL-CHK-NR-NUM       PIC 9(10).
           05 SETL-PRINTER-FLAG        PIC X     VALUE SPACE.
           05 SETL-SUB-ID              PIC X.
           05 SETL-BALANCE-PARAM-FLAG  PIC X(01).
           05 SETL-CLOSING-PARAM-FLAG  PIC X(01).
           05 SETL-PAYMENT-PARAM-FLAG  PIC X(01).
           05 SETL-BALANCE-REQ-FLAG    PIC X(01).
           05 SETL-CLOSING-REQ-FLAG    PIC X(01).
           05 SETL-PAYMENT-REQ-FLAG    PIC X(01).
           05 FILLER                   PIC X(195) VALUE SPACES.
       01  SETTLEMENT-COMMAREA-RETURN REDEFINES SETTLEMENT-COMMAREA.
           05 SETL-RETURN-ERROR-NUMBER PIC S9(5) COMP-3.
           05 SETL-RETURN-MESSAGE.
CP1011        10 FILLER                PIC X(08).
CP1011        10 SETL-RETURN-CNTL-NR   PIC 9(7).
              10 FILLER                PIC X(205).

       01  SETTLEMENT-DISPLAY-MSG.
           05 FILLER                   PIC X(07)  VALUE '| STL: '.
           05 SETL-DISPLAY-MESSAGE     PIC X(31).


       01  WS-FPLG-COMMAREA.
MP1004     05 WS-FPLG-CA-USILOG     PIC X(0220).
CC040B     05 WS-FPLG-CA-FMLOG      PIC X(2040).

011222*-----------------------------*
011222* COMMAREA FOR TSFMO0TX       *
011222*-----------------------------*
011222 01  WS-TSFMO0TX-COMM-AREA.
011222     05 WS-TSFMO0TX-COMM-PGM          PIC X(08).
011222     05 WS-TSFMO0TX-COMM-PROCESS-TYPE PIC X(01).
011222     05 WS-TSFMO0TX-COMM-FMLOG        PIC X(2040).
011222     05 FILLER                        PIC X(452).

       01  FILLER.
      **** (FILE-RRNS-AND-KEYS) ****
           03 FND-RRN            PIC S9(7) VALUE +0 COMP SYNC.
           03 ORDRFIL-RRN        PIC S9(7) VALUE +0 COMP SYNC.
           03 ORDRPTR-RRN        PIC S9(7) VALUE +0 COMP SYNC.
           03 SVC-RRN            PIC S9(7) VALUE +0 COMP SYNC.
           03 FMLOG-RRN          PIC S9(7) VALUE +0 COMP SYNC.
           03 DRFTLG1-RRN        PIC S9(7) VALUE +0 COMP SYNC.
           03 PRMLOG-RRN         PIC S9(8) VALUE +0 COMP SYNC.
           03 SAVE-RRN  COMP-3   PIC  9(7) VALUE 0.
           03 SCMSTR-KEY         PIC X(10)   VALUE SPACES.
           03 FILLER       REDEFINES SCMSTR-KEY.
              05 SCM-KEY-ST      PIC XX.
              05 SCM-KEY-NUM     PIC XXX.
              05 FILLER          PIC X(5).
           03 SCMSTR-KEY-TEMP    PIC X(10)   VALUE SPACES.
           03 CDEQUIP-KEY        PIC X(15) VALUE SPACES.
           03 SCFUELP-KEY        PIC X(15) VALUE SPACES.
           03 RATE-KEY-RATE      PIC X VALUE SPACE.
CP1011     03 WS-RRN-MATCHED     PIC 9(7) VALUE ZEROS.
CP1011     03 WRK-RRN            PIC 9(7) VALUE ZEROS.
CP1011     03 FILLER REDEFINES WRK-RRN.
CP1011        05 WRK-RRN-1ST     PIC 9(1).
CP1011        05 FILLER          PIC 9(6).

         01 WS-FF-LOG-RECD         PIC X(341) VALUE SPACES.
         01 FILLER                 REDEFINES WS-FF-LOG-RECD.
           03 FF-LOG-RECD-ID       PIC XX.
           03 FF-LOG-OP-ID         PIC XXXX.
           03 FF-LOG-TERM-ID       PIC XXXX.
           03 FF-LOG-DATE          PIC S9(5) COMP-3.
           03 FF-LOG-TIME          PIC S9(6) COMP-3.
           03 FF-LOG-CHNG-TYPE     PIC XX.
           03 FF-LOG-SC-CODE       PIC X(5).
           03 FILLER.
              05 FF-LOG-DATA-1-FLAG PIC X.
              05 FF-LOG-DATA-1-OLD.
                 07 FILLER           PIC 99V999 COMP-3.
                 07 FILLER           PIC 99V999 COMP-3.
                 07 FILLER           PIC 99V999 COMP-3.
           03 FILLER.
              05 FF-LOG-DATA-2-FLAG PIC X.
              05 FF-LOG-DATA-2-NEW.
                 07 FF-LOG-DATA-2-1  PIC 99V999 COMP-3.
                 07 FF-LOG-DATA-2-2  PIC 99V999 COMP-3.
                 07 FF-LOG-DATA-2-3  PIC 99V999 COMP-3.
       01  FILLER REDEFINES WS-FF-LOG-RECD.
      **** (WS-SETTLE-CANCEL-LOG) ****
           03 FF-SETTLE-CANCEL-ID  PIC XX.
           03 FF-SETTLE-RECD       PIC X(130).
           03 FF-SETTLE-CANCEL-DATE PIC S9(7) COMP-3.
           03 FF-SETTLE-CANCEL-TIME PIC S9(7) COMP-3.
           03 FF-SETTLE-CANCEL-TERMID PIC XXXX.

       01  FILLER.
           05  TST-KEY.
               10  TST-PHONE-NUMBER   PIC 9(10)     VALUE ZERO.
           05 FILLER                  REDEFINES TST-KEY.
              10 TST-KEY-AREA-CODE.
                 15 FILLER             PIC X.
                 15 TST-KEY-AREA-MID   PIC X.
                 15 FILLER             PIC X.
              10 TST-KEY-PREFIX        PIC XXX.
              10 FILLER                PIC X(4).

SB0315     COPY SETINFOC IN CPYREL.
MP0411     COPY BTCHSETC IN CPYREL.
           COPY CSITELGC IN CPYREL.
DR0117     COPY CSTANDC  IN CPYREL.
CP1098     COPY CXXCW0CS IN CPYREL.
SB0513     COPY TSXCW020 IN CPYREL.
           COPY TSFMW667 IN CPYREL.
SB0513     COPY TSFMW030 IN CPYREL.
           COPY TSFMW040 IN CPYREL.
           COPY CXISW001 IN CPYREL.
           COPY DRAFTSC  IN CPYREL.
           COPY DRFTLGC  IN CPYREL.
           COPY CDXLATEC IN CPYREL.
           COPY ZIPXREFC IN CPYREL.
CP0208     COPY UNITMSTC IN CPYREL.
JSH318     COPY SCMSTRC  IN CPYREL.
           COPY SCLOCATC IN CPYREL.
           COPY CXUTW123 IN CPYREL.
      ***** USED BY CUSTID REFORMAT ROUTINE CXUTS200
           COPY CXUTW200 IN CPYREL.
           COPY PROCCTLC IN CPYREL.
           COPY USISET   IN CPYREL.
           COPY BMSATTR  IN CPYREL.
           COPY TIMDAT   IN CPYREL.
           COPY CXXCW013 IN CPYREL.
ED1101     COPY CXACW040 IN CPYREL.
091509***** WORK AREA FOR LINKING TO CREDITL UPDATE, CXACO0UD
091509     COPY CXACW031 IN CPYREL.
ED0102     COPY TSXCW110 IN CPYREL.
ED0102     COPY CXXCW330 IN CPYREL.
ED1203     COPY PRMPINC  IN CPYREL.
ED1203     COPY CXPSW230 IN CPYREL.

******** CHANGE THIS BACK TO USING REAL COPYBOOK NAMES - CSP
CP0208     COPY PRDLMITC IN CPYREL.
CP0208     COPY PRDUSEDC IN CPYREL.

JS0604     COPY PRODCODC IN CPYREL.
ED0406     COPY TSFMW230 IN CPYREL.
MN0207     COPY CXXCW052 IN CPYREL.
102810***** PRODUCT CONTROL RECORD
MB0715     COPY XCPRODCC IN CPYREL.

       01  WS-HOLD-SC-RECORD.
           05 WS-HOLD-SC-RECORD-KEY       PIC X(010).
           05 FILLER                      PIC X(281).
           05 WS-HOLD-SC-COST-PLUS-FLAG   PIC X(001).
CP0400     05 FILLER                      PIC X(142).
CP0400     05 WS-HOLD-SC-SETTLE-PMT-CYC   PIC X(001).
CP0400     05 FILLER                      PIC X(015).
CP0400     05 WS-HOLD-SC-SETTLE-PMT-METH  PIC X(002).
CP0400     05 FILLER                      PIC X(569).
           COPY CDADDRC.
           COPY CDEQUIPC.
           COPY SCFUELPC.
091509****** DB2 CREDITL TABLE
SR0119     COPY DCREDITL.
091509****** DB2 GLOBAL CREDIT TABLE
SR0119     COPY DCRDLMTS.
091509***** WORK AREA FOR LINKING TO CREDLOD REPLACEMENT, CXACO0LD
           COPY CXXCW002.
           COPY CXXCW003.
           COPY ORDRFILC.
MN1108     COPY CDCORDFL.
           COPY ORDRPTRC.
           COPY CDCORDPT.
CP1211     COPY CXUTW400.
MP1004     COPY FPDLGC.
           COPY CXORW002.
MN1108     COPY CDCORDFL.
           COPY CXORW003.
           COPY OPACDATA.
           COPY OPACSF1C.
DR0422     COPY PRMCARDC IN CPYUAT.
       01  WS-HOLD-PRM-CARD-RECORD     PIC X(590).
SB0514     COPY PRMINFOC.
           COPY PRMXREFC.
080116     COPY CDNCUSTC.
BW0211     COPY CODESC.
           COPY DSMSTRC.
102810***** CROSS REF FROM CARD TO DSMSTR
102810     COPY DSCARDC.
           COPY DSTRANC.
           COPY TSDSW010.
AA0921     COPY CARDNETC IN CPYREL.
022112     COPY CXXCW001.
           COPY PRMDLXFC.
KB0408     COPY TSFMW001.
DR0422     COPY PRMRLOGC IN CPYREL.
           COPY POMSTRC.
011222     COPY FMLOG2C IN CPYREL.

DR0422     COPY PRDDISC IN CPYREL.

CC040B 01  WS-HOLD-FMLOG                       PIC X(2040).

           COPY FMPOMSTC.
           COPY FMPOOLC.
JS1111     COPY CXXCW0CL.
           COPY CXITW001.
           COPY CDREPRTC.
           COPY CXORW001.
           COPY SCSTATEC.
CC0502     COPY OTHFUELC.
MP1011     COPY TSFMW0SO.
DR0817     COPY FMRELATC.
JS0206     COPY PRDFMRMC.
JS0206     COPY PRDCUSTC
JS0206               REPLACING ==:PRDCUST:==     BY ==PRDCUST==
JS0206                         ==:PRDCST:==      BY ==PRDCST==.
JS0206     COPY PRDSCMMC
JS0206               REPLACING ==:PRDSCMM:==     BY ==PRDSCMM==
JS0206                         ==:PRDSCM:==      BY ==PRDSCM==.
           COPY TSMMW003.
ED0906     COPY TSXCW005.
013015     COPY TSXCW007 REPLACING ==:PREF:==
013015                                    BY ==S007-==.
      ***** WORK AREA FOR CALL TO TSXCS050
021908     COPY TSXCW050.
      *****  USED TO LINK TO CXXCO0FC, IRIS FRAUD DETECT PROCESSING
MN0814     COPY CXXCW170.
080210*****  ATMW- WORK AREA
BW0211     COPY CXPSW080.
080210*****  COUNTRY CODE CONVERSION RECORD LAYOUT
080210     COPY CNTRY2C.
102810*****  COMMAREA FOR SUBROUTINE TSFMO0LP, FLEET LIMIT PROCESSING
102810     COPY TSFMW0LP.
      *****  USED TO LINK TO TSFMSNPR, NET PRICING FILE INFO
BG0418     COPY TSFMWNPR.
      *****  USED TO LINK TO TSFMO0GD, GET DISCOUNT CALC INFO
DR0422     COPY TSFMW270 IN CPYREL.
      *****  USED TO LINK TO TSFMO0CD, CALCULATE DISCOUNT ROUTINE
DR0422     COPY TSFMW285 IN CPYREL.
MB0114*****  USED TO LINK TO TSFMO0CT, CANADIAN TAXES
030114     COPY TSFMW290.

      **** (RECORD LAYOUT FOR THE INTRA-DAY MESSAGE) ****
       01  INTRA-DAY-ERROR-LAYOUT.
           05 FILLER                           PIC X(02) VALUE '1E'.
           05 IDEL-ACCOUNT-CODE                PIC X(05).
           05 IDEL-UNIT-NUMBER                 PIC X(06).
           05 IDEL-LOCATION-CODE               PIC X(05).
           05 IDEL-LOCATION-NAME               PIC X(15).
           05 IDEL-LOCATION-CITY               PIC X(12).
           05 IDEL-LOCATION-STATE              PIC X(02).
           05 IDEL-TRANSACTION-TIME            PIC 9(04).
           05 IDEL-TRIP-NUMBER                 PIC X(10).
           05 IDEL-HUB-READING                 PIC 9(06).
           05 IDEL-CARD-NUMBER                 PIC 9(10).
           05 IDEL-EMPLOYEE-NUMBER             PIC X(16).
           05 IDEL-DL-STATE                    PIC X(02).
           05 IDEL-DL-NR                       PIC X(20).
           05 FILLER                           PIC X(08) VALUE SPACES.
           05 FILLER                           PIC X(02) VALUE '2E'.
           05 IDEL-PO-NUMBER                   PIC X(10).
           05 IDEL-TRAILER-NUMBER              PIC X(10).
           05 IDEL-CUSTOMER-ID                 PIC X(10).
           05 IDEL-TRAILER-HUBX.
              10 IDEL-TRAILER-HUB              PIC 9(6)V9.
           05 IDEL-TRANSACTION-DATE            PIC 9(6).
           05 FILLER                           PIC X(83) VALUE SPACES.
           05 FILLER                           PIC X(02) VALUE '3E'.
           05 IDEL-RETURN-CODE                 PIC 9(05).
           05 IDEL-ERROR-MESSAGE               PIC X(121).

MB0714     COPY FMRACKC.
MB0714     COPY FMRACKHC.
PM0916     COPY SCRACKC.
           COPY SILIMITC.
           COPY TSSIW010.
           COPY CDAUDITC.
           COPY CXZZW460.
      ***** NEXT TWO COPYBOOKS CONTAIN ABEND WORK AREAS
CW1108     COPY CXXCW110.
091211     COPY CXXCW130.
           COPY CXXCW0PL.
082008     COPY CXXCW0PU.

         01 FILLER.
           03 DUP-CONTROL-NR       PIC S9(7) COMP-3 VALUE +0.

           COPY CXXCW038.

       01  FILLER.
      **** (WS-CANCEL-WORK-AREA) ****
           05 WS-CANCEL-AREA.
              10 WS-CANCEL-SC-CODE   PIC X(5).
              10 WS-CANCEL-CARD-NR   PIC X(10).
CP0111        10 WS-CANCEL-TRANS-NR  PIC X(07).
CP1011        10 FILLER REDEFINES WS-CANCEL-TRANS-NR.
CP1011           15 WS-CNL-TRANS-NR-N PIC 9(07).
CP1011        10 FILLER REDEFINES WS-CANCEL-TRANS-NR.
CP1011           15 WS-CNL-TRANS-NR-6 PIC X(06).
CP1011           15 FILLER            PIC X(01).
              10 WS-PC-CANCEL-FLAG   PIC X(01)  VALUE 'N'.
                 88 THIS-IS-A-PC-CANCEL         VALUE 'Y', 'A'.
                 88 THIS-IS-A-ATM-CANCEL        VALUE 'A'.
           05 WS-NW-TS-CODE.
              10 WS-NW-TS-ALP        PIC X(02).
              10 WS-NW-TS-NUM        PIC 9(03).
         01 VCWS-ERROR-IND         PIC X    VALUE 'N'.
           88 VCWS-ERROR                    VALUE 'Y'.
         01 SAVE-OPERATOR-INFO.
            03 FILLER              PIC X    VALUE SPACE.
            03 FILLER              PIC 9(3) VALUE ZEROS.
         01 HUB-ERROR-IND          PIC X   VALUE 'N'.
           88 HUB-ERROR-FOUND              VALUE 'Y'.

         01 FILLER.
            03 WS-DEEDIT-QTYX.
               05 WS-DEEDIT-QTY        PIC 9(7)V99.
            03 WS-DEEDIT-QTY-NO-DECX.
               05 WS-DEEDIT-QTY-NO-DEC PIC 9(7).
            03 WS-DEEDIT-COSTX.
               05 WS-DEEDIT-COST       PIC 9(7)V99.
            03 WS-DEEDIT-PPUX.
               05 WS-DEEDIT-PPU        PIC 9(2)V9(3).
            03 WS-DEEDIT-HUBX.
               05 WS-DEEDIT-HUB        PIC 9(7)V9.

           03 INP-CO-SMLNAME           PIC X(7).
           03 INP-AUTH-NR              PIC XXXX.
           03 WS-WORK-PHONE-NR.
              05 DPH-AREA              PIC XXX.
              05 DPH-EXCH              PIC XXX.
              05 DPH-NR                PIC XXXX.
           03 WS-WORK-PROD-AMT         PIC S9(7)V99   VALUE +0.
           03 WS-WORK-PROD-AMT-SC      PIC S9(7)V99   VALUE +0 COMP-3.
           03 WS-WORK-PROD-AMT-US      PIC S9(7)V99   VALUE +0 COMP-3.
           03 INP-NR-GALLONS           PIC 9(7)V99    VALUE 0.
           03 INP-PRICE-GALLON         PIC 9(2)V9(3)  VALUE 0.
           03 INP-TOTAL-COST           PIC 9(7)V99    VALUE 0.
           03 INP2-NR-GALLONS          PIC 9(7)V99    VALUE 0 COMP-3.
           03 INP2-PRICE-GALLON        PIC 9(2)V9(3)  VALUE 0 COMP-3.
           03 INP2-TOTAL-COST          PIC 9(7)V99    VALUE 0 COMP-3.
           03 INP3-NR-GALLONS          PIC 9(7)V99    VALUE 0 COMP-3.
           03 INP3-PRICE-GALLON        PIC 9(2)V9(3)  VALUE 0 COMP-3.
           03 INP3-TOTAL-COST          PIC 9(7)V99    VALUE 0 COMP-3.
           03 WS-PROD-BILL-FLAG        PIC X(1)     VALUE SPACE.
           03 INP-PROD-BILL-1          PIC X(1)     VALUE SPACE.
           03 INP-PROD-BILL-2          PIC X(1)     VALUE SPACE.
           03 INP-PROD-BILL-3          PIC X(1)     VALUE SPACE.
           03 WORK-PROD-CODE.
              05 WORK-PROD-CODE-CHAR OCCURS 2 TIMES PIC X.
           03 WORK-PROD-CODE-NUM REDEFINES WORK-PROD-CODE PIC 9(2).
           03 WORK-PROD-DESC           PIC X(14).
SB0814     03 HOLD-WORK-PROD-CODE      PIC X(02).
SB0914     03 WS-PUR-CATEGORY          PIC X(05).
091614     03 WS-DEFAULT-MAX-QTY       PIC 9(5) COMP-3 VALUE 99999.
100914     03 WS-UNITGRP-NR-10.
100914        05 FILLER                   PIC X(04).
100914        05 WS-UNITGRP-NR-5-10       PIC X(06).

      **** (THE RATE  FIELDS IS THE COMPANY BASE CURRENCY) ****
      **** (THE RATE2 FIELDS IS THE SC           CURRENCY) ****
      **** (THE RATE2 FIELDS IS US               CURRENCY) ****
082008     03 WS-ADVANCE-RATE           PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-ADVANCE-RATE2          PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-ADVANCE-RATE3          PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-TOTAL-RATE             PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-TOTAL-RATE2            PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-TOTAL-RATE3            PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-FUEL-RATE              PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-FUEL-RATE2             PIC S9(5)V99  COMP-3 VALUE +0.
082008     03 WS-FUEL-RATE3             PIC S9(5)V99  COMP-3 VALUE +0.
           03 WS-PPRIDE-TRANSFER-PPG    PIC S9(2)V999 COMP-3 VALUE ZERO.
           03 WS-PPRIDE-MARKUP-SC       PIC S9(2)V999 COMP-3 VALUE ZERO.
082008     03 WS-CO-FUEL-RATE-REDUCTION PIC S9(5)V99  COMP-3 VALUE ZERO.
082008     03 WS-BASE-ADVANCE-RATE      PIC S9(5)V99  COMP-3 VALUE ZERO.
082008     03 WS-MIXED-ADVANCE-RATE     PIC S9(5)V99  COMP-3 VALUE ZERO.
           03 CHECK-WORK                PIC 9(10) VALUE 0.
           03 FILLER               REDEFINES CHECK-WORK.
             05 HI-CHECK-DIGITS         PIC 9(9).
             05 LOW-CHECK-DIGIT         PIC 9.
           03 WS-CHECK-WORK             PIC 9(9).
           03 WS-CHECK-HOLD             PIC 9(10).
           03 WS-CALC-CHECK-DIGIT       PIC 9.

           03 INP-DISC.
082008       05 INP-F-SRVC-DISC    PIC  9(5)V99.
082008       05 INP-S-SRVC-DISC    PIC  9(5)V99.
           03 PC-NAME-CONSTRUCT.
             05 FILLER             PIC X(5) VALUE 'UNIT '.
             05 PC-NAME-UNIT       PIC X(10) VALUE SPACES.
             05 FILLER             PIC X VALUE SPACES.
             05 PC-NAME-MESSAGE    PIC X VALUE SPACES.
             05 FILLER             PIC X(12) VALUE SPACES.

           03 INP-COMMON-AREAS.
JS1203       05 INP-CO-CODE        PIC  X(05).
             05 INP-COMMON-DATA.
               07 FILLER           PIC X(8).
               07 FILLER.
                  09 FILLER         PIC XX.
                  09 FILLER         PIC 999.
               07 FILLER           PIC X.
               07 FILLER           PIC X(10).

DR0121     COPY CXPSW351 IN CPYREL.
DR0422*    COPY TSXCW041 IN CPYREL.
DR0422     COPY CXXCW0LE IN CPYUAT.
CW1108     COPY TSFMW210.
CW1108     COPY CXPSW352.
MP1204     COPY TSFMW673.
CP0807*****CONTAINS UNITMST-CHANGE-RECORD
CP0208     COPY TSFMW181.

SB0114*****CONTAINS WS-USER-INPUT-WORK-AREA
           COPY TSFMW280.
SB0114*****SAVE AREA FOR ORIGINAL UIWA AREA
SB0114 01 WS-ORIG-UIWA-AREA     PIC X(1500).
SB0114*****SAVE AREA FOR ORIGINAL FMLOG RECORD
SB0114 01 WS-ORIG-FMLOG-AREA    PIC X(2040).

       01  UNFORMATTED-AREA-DEF   PIC X(15)  VALUE '**UNFORMATTED**'.
082008***** INCREASED BECAUSE OF FIELDS ADDED TO COPYBOOK CXPSW351
BW0211***** INCREASED BECAUSE OF FIELDS ADDED TO COPYBOOK TSXCW030
DR0121 01  UNFORMATTED-LENG       PIC S9999   VALUE +2466  COMP.
DR0121 01  UNFORMATTED-AREA       PIC X(2452).

       01  FILLER                 REDEFINES UNFORMATTED-AREA.
           03 FILLER                PIC XXXX.
           03 INP-PC-ZON-OVERLAY.
             05 INP-PC-ZON-VER-FLAG PIC X.
DR0121       05 INP-PC-ZON-TRAILER  PIC X(2447).

       01  FILLER REDEFINES UNFORMATTED-AREA.
           03 UNF-PGRM-NAME        PIC XX.
           03 FILLER               PIC X.
DR0121     03 INP-NP-DATA          PIC X(2449).

CP1011***** CHANGED TO ALLOW EITHER 6 DIGIT OR 7 DIGIT CONTROL NUMBER
CP1011***** TO BE ENTERED ON THE CANCEL REQUEST
      **** (FP CANCEL AREA) ****
       01  WS-INP-FP-CANCEL.
              05 FILLER                PIC X(3).
              05 FP-CANCEL-REQ         PIC X(7) VALUE 'CANCEL '.
CP1011        05 FPCR-CTLNR-CARD.
CP1011           10 FPCR-CTL-6         PIC 9(6).
CP1011           10 FILLER REDEFINES FPCR-CTL-6.
CP1011              15 FPCR-CTL-6X     PIC X(6).
CP1011           10 FILLER             PIC X.
CP1011           10 FPCR-CTL6-CARD     PIC X(16).
CP1011           10 FILLER             PIC X.
CP1011        05 FILLER REDEFINES FPCR-CTLNR-CARD.
CP1011           10 FPCR-CTL-7         PIC 9(7).
CP1011           10 FILLER             PIC X.
CP1011           10 FPCR-CTL7-CARD     PIC X(16).

CP1011 01  WS-FP-CANCEL-CTL            PIC 9(7).
CP1011 01  FILLER REDEFINES WS-FP-CANCEL-CTL.
CP1011     05 WS-FP-CANCEL-CTL1        PIC X.
CP1011     05 WS-FP-CANCEL-CTLX        PIC X(6).

CP1011 01  WS-INP-FP-CANCEL-CARD.
             05 FP-CANCEL-CARD         PIC X(16).
             05 FP-CANCEL-COMMON REDEFINES FP-CANCEL-CARD.
                07 FP-CANCEL-CO-CODE.
                   09 FP-CANCEL-CO-CODE-N PIC 9(4).
                07 FP-CANCEL-ID-NR.
                   09 FILLER              PIC X(7).
                   09 FP-CANCEL-4-CHECK   PIC X.
                07 FILLER                 PIC X(4).
             05 FILLER REDEFINES FP-CANCEL-COMMON.
                07 FP-CANCEL-CO-CODE-5.
                   09 FP-CANCEL-CO-CODE-5-N PIC 9(5).
                07 FP-CANCEL-ID-NR-5.
                   09 FILLER                PIC X(7).
                   09 FP-CANCEL-5-CHECK     PIC X.
                07 FILLER                 PIC X(3).

SB0114* THE 88 LEVELS UNDER WS-XTN-REQUEST-FLAG HAVE BEEN MOVED TO
SB0114* THE WS-USER-INPUT-WORK-AREA IN COPYLIB TSFMW280
       01  WS-XTN-REQUEST-AREA.
           03 WS-XTN-REQUEST-FLAG  PIC X VALUE SPACES.
SB0114*      88 THIS-BE-A-PC-REQUEST      VALUES '+' '$' '#' '!' '?'
SB0114*                                          '%' '&' '(' ')' '*'
SB0114*                                          '>' ',' '.' '^' '<'
SB0114*                                          '\' '|' '['.
SB0114*      88 THIS-BE-AN-AUTOMATED-REQ  VALUES '$' '!' '%' '&' '('
SB0114*                                          ')' '*' '?' ',' '.'
SB0114*                                          '^' '<' '\' '|' '['.
SB0114*      88 THIS-BE-A-SETTLEMENT-REQUEST   VALUE '-'.
SB0114*      88 THIS-BE-A-CANCEL-REQUEST       VALUE '@'.
SB0114*      88 THIS-IS-A-CANCEL-REQ           VALUE 'C'.
SB0114*      88 THIS-IS-A-CANCEL-XTN           VALUE '@' 'C'.
SB0114*      88 THIS-BE-A-VRU-XTN              VALUE '#' '>' '\'.
SB0114*      88 THIS-BE-A-REAL-VRU-XTN         VALUE '#' '>'.
SB0114*      88 THIS-BE-A-VRU-EXPRESS-CASH     VALUE '#'.
SB0114*      88 THIS-BE-A-VRU-CASH-ON-CARD     VALUE '>'.
SB0114*      88 THIS-BE-A-RESTORE-REQUEST      VALUE '='.
SB0114*      88 THIS-BE-A-BATCHED-REQUEST      VALUE '&'.
SB0114*      88 THIS-BE-A-NATS-AUTH            VALUE '*'.
SB0114*      88 THIS-BE-AN-AUTO-GAS-PRE-AUTH   VALUE '!'.
SB0114*      88 THIS-BE-AN-AUTO-GAS-AUTH       VALUE '%'.
SB0114*      88 THIS-BE-AN-AUTO-GAS-XTN        VALUE '!' '%'.
SB0114*      88 THIS-BE-AN-IOL-PRE-AUTH        VALUE '('.
SB0114*      88 THIS-BE-AN-IOL-AUTH            VALUE ')'.
SB0114*      88 THIS-BE-AN-IOL-XTN             VALUE '(' ')'.
SB0114*      88 THIS-BE-A-SMART-FUEL-PRE-AUTH  VALUE ','.
SB0114*      88 THIS-BE-A-SMART-FUEL-AUTH      VALUE '.'.
SB0114*      88 THIS-BE-A-SMART-FUEL-XTN       VALUE '.'.
SB0114*      88 THIS-BE-A-PRODUCT-PRE-AUTH     VALUE '['.
SB0114*      88 THIS-BE-AN-UNATTENDED-PRE-AUTH VALUE '!' '(' ',' '['.
SB0114*      88 THIS-BE-AN-UNATTENDED-AUTH     VALUE '%' ')' '*' '.'
SB0114*                                              '^' '<'.
SB0114*      88 THIS-BE-AN-UNATTENDED-XTN      VALUE '!' '(' '%' ')'
SB0114*                                              '*' ',' '.' '^'
SB0114*                                              '<' '['.
SB0114*      88 THIS-BE-A-NO-VERIFY-XTN        VALUE '|'.
SB0114*      88 THIS-BE-AN-ATM-XTN             VALUE '?'.
SB0114*      88 THIS-BE-AN-ATM-CANCEL          VALUE '~'.
SB0114*      88 THIS-BE-A-PETRO-RECEIVABLE     VALUE '^'.
SB0114*      88 THIS-BE-A-FLEET-XTN            VALUE '<'.
SB0114*      88 THIS-BE-A-EMAIL-XTN            VALUE '\'.
SB0114*      88 THIS-BE-A-CARD-NR              VALUE '0' THRU '9'.
SB0114*      88 FPM-REBUILD                    VALUE 'R'.
SB0114*      88 FPM-OPEN                       VALUE 'O'.
           03 WS-XTN-TYPE-FLAG       PIC X(01) VALUE SPACES.
              88 WS-XTN-TYPE-LARGE-AMT         VALUE 'L'.

       01  WS-AUTOMATED-INPUT-AREA.
             05 INP-PC-XTN-REQUEST   PIC X(01).
             05 INP-PC-CARD-NR       PIC X(16).
             05 INP-PC-UNIT          PIC X(6).
             05 INP-PC-TS-CODE       PIC X(5).
             05 INP-PC-GALLONS       PIC 999V99.
             05 INP-PC-TOTAL         PIC 999V99.
             05 INP-PC-INVOICE       PIC X(8).
             05 INP-PC-TRIP-NR       PIC X(10).
             05 INP-PC-TR-GALS       PIC 999V99.
             05 INP-PC-TR-PPG        PIC 99V999.
             05 INP-PC-TR-COST       PIC 999V99.
             05 INP-PC-OIL-QTS       PIC 99.
             05 INP-PC-OIL-COST      PIC 999V99.
             05 INP-PC-HUB-READING   PIC 9(6)V9.
             05 INP-PC-HUB-REQ-FLG   PIC X.
      ****     88 PC-SAYS-HUB-AVAILABLE VALUE '*'.
             05 INP-PC-SPCL-UNIT-NR PIC X(6).
             05 INP-PC-ADV-AMT      PIC 9999V99.
             05 INP-PC-MSG-QUERY    PIC X.
             05 INP-PC-PRINT-REQ    PIC X.
             05 INP-PC-CHECK-NRX.
                10 INP-PC-CHECK-NR  PIC 9(10).
             05 INP-PC-OGALS        PIC 999V99.
             05 INP-PC-OTTL         PIC 999V99.
             05 FILLER              OCCURS 3 TIMES.
                07 INP-PC-PROD-CODE PIC XX.
                07 INP-PC-PROD-AMT  PIC XXXXXX.
                07 INP-PC-PROD-AMTN REDEFINES INP-PC-PROD-AMT
                                    PIC 9(4)V99.
             05 INP-PC-DL-NR        PIC X(20).
             05 INP-PC-DL-ST        PIC XX.
             05 INP-PC-ITTL         PIC 9999V99.
             05 INP-PC-CARD-EXP-DATE PIC X(4).
             05 FILLER              PIC X(26).
      * SUB-ID IS IN SRVC-TYPE
             05 INP-PC-SRVC-TYPE    PIC X.
             05 FILLER                     PIC X.
                88 PC-HAS-ATTACHED-PRINT   VALUE '2'.
             05 INP-PC-TRAILER-NR   PIC X(10).
             05 INP-PC-TRAILER-HUB  PIC 9(06)V9.
             05 INP-PC-PURCHASE-ORDER-NR  PIC X(10).
             05 INP-PC-DRIVER-NR          PIC X(10).
             05 INP-PC-NR1-GALS           PIC 9(3)V99.
             05 INP-PC-NR1-COST           PIC 9(3)V99.
             05 INP-PC-SWIPED-KEYED       PIC X(1).
             05 INP-PC-SC-SECU-CARD-INFO.
                10 FILLER                 PIC X(06).
                10 INP-PC-SC-SECU-CARD    PIC X(10).
             05 INP-PC-SC-SECU-PIN        PIC 9(4).
             05 INP-PC-CANADIAN-TAX       PIC 9(3)V99.
             05 INP-PC-BATCH-PROCESS-DATE PIC 9(6).
             05 INP-PC-NATS-INFO.
                10 INP-PC-NATS-PRICES OCCURS 6 TIMES.
                   15 INP-PC-NATS-PROD-CODE  PIC X(3).
                   15 INP-PC-NATS-PUMP-FEE   PIC 9(4)V99.
                   15 INP-PC-NATS-PUMP-SIGN  PIC X(1).
                   15 INP-PC-NATS-DISC-PG    PIC 9(4)V999.
                   15 INP-PC-NATS-DISC-SIGN  PIC X(1).
                   15 INP-PC-NATS-DISC-EXT   PIC 9(5)V99.
                   15 INP-PC-NATS-DISC-E-SIGN PIC X(1).
                10 INP-PC-NATS-POS-FLAG   PIC X(1).
CP1011          10 INP-PC-NATS-CTL-NR     PIC 9(7).
                10 INP-PC-NATS-FEE        PIC 9(2)V99.
                10 INP-PC-NATS-PRE-AUTH-DATE PIC 9(5).
                10 INP-PC-NATS-PRE-AUTH-SEQ  PIC 9(7).
                10 INP-PC-NATS-AUTH-NR    PIC 9(10).
             05 INP-PC-TRAILER-HRS        PIC 9(5)V9.
             05 INP-PC-IOL-RCP            PIC 9V9(05).
             05 INP-PC-DEVICE-TYPE        PIC X(4).
JS1199       05 INP-PC-MASTER-CARD.
JS1199          10 INP-PC-FLEET-PROD      PIC 9(5).
JS1199          10 INP-PC-FLEET-DATE-ORIG PIC X(10).
JS1199          10 INP-PC-FLEET-NAME      PIC X(30).
JS0600          10 INP-PC-FLEET-ADDR      PIC X(30).
JS1199          10 INP-PC-FLEET-CITY      PIC X(13).
JS1199          10 INP-PC-FLEET-STATE     PIC X(02).
JS0600          10 INP-PC-FLEET-ZIP       PIC X(10).
JS1199          10 INP-PC-FLEET-AMT-ORIG  PIC 9(05)V99.
JS1199          10 INP-PC-FLEET-KEY       PIC X(32).
JS1199          10 INP-PC-FLEET-XTN-DATE  PIC 9(06).
JS0300          10 INP-PC-FLEET-XTN-TIME  PIC 9(06).
JS0401       05 INP-PC-UNIT-EXPANDED      PIC X(10).
CC0502       05 INP-PC-SC-CITY              PIC X(20).
CC0502       05 INP-PC-SC-STATE             PIC X(02).
CC0502       05 INP-PC-SC-ZIP               PIC X(10).
CC0502       05 INP-PC-FUELING-DATE         PIC 9(06).
CC0502       05 INP-PC-FUELING-TIME         PIC 9(06).
CC0502       05 INP-PC-OTHER-FUEL-TYPE      PIC X(03).
CC0502       05 INP-PC-USFLEET-MISC-NR      PIC X(09).
CC0502       05 INP-PC-PROD-9-TYPE-1        PIC X(03).
CC0502       05 INP-PC-PROD-9-TYPE-2        PIC X(03).
CC0502       05 INP-PC-PROD-9-TYPE-3        PIC X(03).
CC0502       05 INP-PC-BASE-PPG             PIC 9(02)V999.
CC0502       05 INP-PC-DELIVERY-FEE-PPG     PIC 9(02)V999.
CC0502       05 INP-PC-TOTAL-TAX-PPG        PIC 9(02)V999.
CC0303       05 INP-PC-SYSTEM-ID            PIC 9(04).
CC0303       05 INP-PC-RECV-DATE            PIC X(10).
CC0303       05 INP-PC-TASK-NR              PIC 9(09).
CP0406       05 INP-PC-NR2-SUB-PROD         PIC X(15).
CP0406       05 INP-PC-RFR-SUB-PROD         PIC X(15).
CP0406       05 INP-PC-OTH-SUB-PROD         PIC X(15).
CP0406       05 INP-PC-NR1-SUB-PROD         PIC X(15).
MN0207       05 INP-PC-PR1-SUB-PROD-CODE    PIC X(15).
MN0207       05 INP-PC-PR2-SUB-PROD-CODE    PIC X(15).
MN0207       05 INP-PC-PR3-SUB-PROD-CODE    PIC X(15).
MN0207       05 INP-AUTH-1-PROD-CODE        PIC X(02).
MN0207       05 INP-AUTH-2-PROD-CODE        PIC X(02).
MN0207       05 INP-AUTH-3-PROD-CODE        PIC X(02).

      **** (SETTLEMENT REQUEST INPUT AREA) ****
       01  WS-SETTLEMENT-INPUT-AREA.
           03 FILLER              PIC X(4).
           03 INP-SETTLE-TS-CODE  PIC X(6).
           03 INP-SET-CHECK       PIC 9(10).
           03 INP-INVOICE         PIC X(8).
           03 FILLER REDEFINES INP-INVOICE.
              05 INP-SETTLE-PRINTER-FLAG  PIC X(1).
              05 FILLER           PIC X(7).
           03 INP-AMOUNT          PIC 9(7)V99.
           03 FILLER              PIC X(1024).

       01  WS-INP-CANCEL-AREA.
      **** (UNFORMATTED-AREA-RCNCL) ****
           03 FILLER              PIC X(4).
           03 FILLER              PIC X(1).
           03 INP-CANCEL-AREA.
              05 FILLER              PIC X(5).
              05 FILLER              PIC X(10).
              05 FILLER              PIC 9(06).
           03 FILLER              PIC X(1035).

       01  WS-OL-PT-AREA.
           03 OL-PT-AMOUNT         PIC 9(4)V99.
           03 OL-PT-CHECK-NR       PIC 9(10).
           03 OL-PT-MESSAGE-FLAG   PIC X.

      *---------------------------------------------------*
      * IOL PRE AUTH INPUT/OUTPUT AREA.                   *
      *---------------------------------------------------*
       01  WS-IOL-PRE-AUTH-AREA.
           03 FILLER                  PIC X(4).
           03 WS-IOL-PRE-AUTH-DATA.
              05 WS-IOL-SC-CODE       PIC X(05).
              05 WS-IOL-CARD-NR       PIC X(16).
              05 WS-IOL-FUEL-TYPE     PIC X(01).
                 88 WS-IOL-FUEL-TYPE-IS-TRACTOR    VALUE 'T'.
                 88 WS-IOL-FUEL-TYPE-IS-TRAILER    VALUE 'R'.
ED0899        05 WS-IOL-PRODUCT-CODE  PIC 9(08).
              05 WS-IOL-MAX-LITERS-IN PIC 9(03)V99.
              05 WS-IOL-PPL           PIC 9(01)V999.
              05 WS-IOL-DRIVER-NUMBER PIC X(16).
              05 WS-IOL-UNIT-NUMBER   PIC X(12).
              05 WS-IOL-HUB-READING   PIC 9(07).
              05 WS-IOL-TRIP-NUMBER   PIC X(12).
              05 WS-IOL-PIN-NUMBER    PIC X(04).
              05 WS-IOL-PO-NUMBER     PIC X(10).
              05 WS-IOL-LANGUAGE-IND  PIC X(01).
              05 WS-IOL-RCP           PIC 9V9(05).

       01  WS-IOL-PRE-AUTH-RESP.
           05 WS-IOL-RETURN-CODE      PIC 9(05).
           05 WS-IOL-RETURN-MESSAGE   PIC X(80).
           05 WS-IOL-ACCOUNT-CODE     PIC X(05).
           05 WS-IOL-MAX-LITERS       PIC 9(03)V99.
           05 WS-IOL-FUNDED-FLAG      PIC X(01).
           05 WS-IOL-AUTH-NUMBER-01   PIC 9(06).
           05 WS-IOL-AUTH-NUMBER-02   PIC 9(06).

         01 TERMINAL-OUTPUT-AREA.
           03 3270-CTRL.
              05 FILLER             PIC S9(8) COMP VALUE +12738833.
              05 FILLER             PIC X(208) VALUE SPACES.
           03 FILLER               REDEFINES 3270-CTRL.
              05 3270-SBA           PIC X.
              05 FILLER             PIC XX.
              05 3270-SBA-1         PIC X.
              05 FILLER             PIC X(208).
           03 FILLER               REDEFINES 3270-CTRL.
              05 FILLER             PIC X(3).
              05 3270-OUTPUT-DATA   PIC X(209).


       01  BATCH-RECORD-OUTPUT-AREA.
           05 BR-CONTROL-NR        PIC S9(7) COMP-3.
           05 BR-MESSAGE           PIC X(277).

       01  AUTO-GAS-OUTPUT-AREA.
           05 AG-ERROR-NUMBER     PIC S9(5) COMP-3.
           05 AG-ERROR-NUMBER-2   PIC 9(5)   VALUE 99999.
           05 AG-RESPONSE-FLAGS   PIC 9(16)  VALUE ZEROES.
           05 AG-MESSAGE.
              10 FILLER           PIC X(40)  VALUE SPACES.
              10 FILLER           PIC X(40)  VALUE SPACES.

       01  FILLER.
      **** (AUTOGAS WORK FIELDS          ) ****
      **** (THE FOLLOWING WS-AUTO-GAS-AVAIL FIELDS ARE FOR) ****
      **** (       1....FP LIMIT         ) ****
      **** (       2....FP TRIP ALLOWANCE) ****
      **** (       3....CARD LIMITS      ) ****
      **** (       4....CARD BALANCE     ) ****
      **** (     OIL....OIL DOLLAR LIMITS) ****
MN0407**** (     PURC...PURCHASE AMOUNT  ) ****
           05 WS-AUTO-GAS-AVAILX.
              10 WS-AUTO-GAS-AVAIL   PIC 9(5)V99 VALUE ZERO.
           05 WS-AUTO-GAS-AVAIL2     PIC 9(5)V99 VALUE ZERO.
           05 WS-AUTO-GAS-AVAIL3     PIC 9(5)V99 VALUE ZERO.
102510     05 WS-AUTO-GAS-AVAIL4     PIC S9(6)V99 VALUE ZERO.
           05 WS-AUTO-GAS-AVAIL-OIL  PIC 9(5)V99 VALUE ZERO.
MN0407     05 WS-AUTO-GAS-AVAIL-PURC PIC 9(5)V99 VALUE ZERO.

      **** (THE FOLLOWING IS THE QTY ALLOWED FOR THE SELECTED PROD) ****
      **** (IT WILL BE USED FOR AUTO-GAS ONLY                     ) ****
           05 WS-AUTO-GAS-AVAIL-QTYX.
              10 WS-AUTO-GAS-AVAIL-QTY     PIC 9(5)V99 VALUE ZERO.

      *** (THE FOLLOWING IS THE QTY OR AMT ALLOWED FOR EACH PRODUCT) ***
           05 WS-AUTO-GAS-AVAIL-ALL.
              10 WS-AUTO-GAS-AVAIL-QTY-NR2 PIC 9(5)V99 VALUE ZERO.
              10 WS-AUTO-GAS-AVAIL-QTY-NR1 PIC 9(5)V99 VALUE ZERO.
              10 WS-AUTO-GAS-AVAIL-QTY-REF PIC 9(5)V99 VALUE ZERO.
              10 WS-AUTO-GAS-AVAIL-QTY-OTH PIC 9(5)V99 VALUE ZERO.
              10 WS-AUTO-GAS-AVAIL-QTY-OIL PIC 9(5)V99 VALUE ZERO.
              10 WS-AUTO-GAS-AVAIL-AMT-CSH PIC 9(5)V99 VALUE ZERO.
           05 WS-AUTO-GAS-AVAIL-QTY-WRK    PIC 9(5)V99 VALUE ZERO.
102810     05 WS-SP14-REPLY.
             10  WS-SP14-MAX-PUR-AMT      PIC  9(05)V99.
             10  WS-SP14-MAX-PUR-QTY      PIC  9(05)V99.
             10  WS-SP14-MAX-CASH-AVAIL   PIC  9(05)V99.
             10  WS-SP14-MAX-OIL-AMT      PIC  9(05)V99.
             10  WS-SP14-MAX-OIL-QTY      PIC  9(05)V99.
             10  WS-SP14-MAX-NR2-AMT      PIC  9(05)V99.
             10  WS-SP14-MAX-NR2-QTY      PIC  9(05)V99.
             10  WS-SP14-MAX-NR1-AMT      PIC  9(05)V99.
             10  WS-SP14-MAX-NR1-QTY      PIC  9(05)V99.
             10  WS-SP14-MAX-REF-AMT      PIC  9(05)V99.
             10  WS-SP14-MAX-REF-QTY      PIC  9(05)V99.
             10  WS-SP14-MAX-OTH-AMT      PIC  9(05)V99.
             10  WS-SP14-MAX-OTH-QTY      PIC  9(05)V99.
             10  WS-SP14-MAX-PRD-AMT      PIC  9(05)V99.
             10  WS-SP14-PRODUCTS OCCURS 10 TIMES.
               15  WS-SP14-PUR-CATEGORY     PIC  X(05).
               15  WS-SP14-SUB-PROD-CD      PIC  X(03).
               15  WS-SP14-MAX-PROD-AMT     PIC  9(05)V99.
               15  WS-SP14-MAX-PROD-QTY     PIC  9(05)V99.

MN0207 01  WS-AUTO-GAS-PRODUCT-INFO.
MN0207     05 FILLER                    PIC X(1)  VALUE '~'.
MN0207     05 WS-AUTO-GAS-AVAIL-PROD1   PIC X(2)    VALUE SPACES.
MN0207     05 WS-AUTO-GAS-AVAIL-AMT1    PIC 9(5)V99 VALUE ZEROS.
MN0207     05 WS-AUTO-GAS-AVAIL-PROD2   PIC X(2)    VALUE SPACES.
MN0207     05 WS-AUTO-GAS-AVAIL-AMT2    PIC 9(5)V99 VALUE ZEROS.
MN0207     05 WS-AUTO-GAS-AVAIL-PROD3   PIC X(2)    VALUE SPACES.
MN0207     05 WS-AUTO-GAS-AVAIL-AMT3    PIC 9(5)V99 VALUE ZEROS.

       01  FILLER.
      **** (WS-POS-AREA) ****
           03 WS-POS-FLAG          PIC X(01) VALUE 'N'.
              88 THIS-IS-A-POS-TRANS         VALUE 'Y'.
              88 THIS-IS-NOT-A-POS-TRANS     VALUE 'N'.
           03 POS-DRIVER-MESSAGE-AREA.
              10 FILLER            PIC X(18) VALUE
                 'OK: DRV. MSG...>  '.
              10 POS-DRV-MESSAGE   PIC X(80)  VALUE SPACES.
              10 POS-NRM-MESSAGE   PIC X(120) VALUE SPACES.
           03 FILLER.
      *   **** (POS-CUSTOMER-RETURN-AREA) ****
081414        10 POS-CUSTOMER-NRM-MSG  PIC X(413).
              10 POS-CUSTOMER-INFO.
                 15 FILLER             PIC X(6)  VALUE '~CUST:'.
                 15 POS-CUSTOMER-NAME  PIC X(25).
                 15 POS-CUSTOMER-CITY  PIC X(15).
                 15 POS-CUSTOMER-STATE PIC X(02).
MP1004           15 POS-CUSTOMER-ID-X  PIC X(10).
           03 WS-SAVE-PRINTER-FLAG PIC X(1)     VALUE SPACES.
           03 WS-SAVE-POS-SUB-ID   PIC X(1)     VALUE SPACES.
JS0698     03 WS-SAVE-COM-SITE-ACCT PIC X(5)    VALUE SPACES.
           03 WS-SAVE-NAME.
              05 WS-SAVE-NAME-11.
                 10 FILLER         PIC X(5)   VALUE 'UNIT '.
                 10 WS-SAVE-NAME-6 PIC X(10)  VALUE SPACES.
              05 FILLER            PIC X(5)   VALUE ' AND '.
              05 WS-SAVE-NAME-44   PIC X(44)  VALUE SPACES.
           03 FILLER.
      **** (WS-JOIN-FIELDS) ****
              05 WS-FIELD-LEN-1    PIC S9(4)    COMP SYNC.
              05 WS-FIELD-LEN-2    PIC S9(4)    COMP SYNC.
              05 WS-FIELD-LEN-3    PIC S9(4)    COMP SYNC.
              05 WS-FIELD-3        PIC X(3)     VALUE SPACES.
              05 WS-FIELD-20       PIC X(20)    VALUE SPACES.
              05 WS-FIELD-63       PIC X(63)    VALUE SPACES.
              05 WS-FIELD-60       PIC X(60)    VALUE SPACES.
              05 WS-FIELD-83       PIC X(83)    VALUE SPACES.
              05 WS-FIELD-86       PIC X(86)    VALUE SPACES.
              05 WS-FIELD-39       PIC X(39)    VALUE
                 '(FP) CARD & DRIVER LISC MUST BE PRESENT'.
              05 WS-FIELD-125      PIC X(125)   VALUE SPACES.
              05 WS-CHAR-3         PIC X(3)     VALUE '`1C'.
              05 WS-FIELD-50       PIC X(50)    VALUE SPACES.
              05 WS-FIELD-53       PIC X(53)    VALUE SPACES.
              05 WS-FIELD-72       PIC X(72)    VALUE SPACES.
              05 WS-TRY-PO-MSG     PIC X(25)    VALUE
                 '/*(DID YOU ASK FOR PO #)*'.
           03 WS-PO-PROD-CODE.
              05 WS-PO-PROD-CODE-N PIC 9(2).
           03 WS-DATE-1.
              05 WS-MONTH-1        PIC 9(2).
              05 WS-DAY-1          PIC 9(2).
              05 WS-YEAR-1         PIC 9(2).
           03 FILLER REDEFINES WS-DATE-1.
              05 WS-GREG-DATE      PIC 9(6).
              05 FILLER REDEFINES WS-GREG-DATE.
                 10 WS-GREG-MM     PIC 99.
                 10 WS-GREG-DD     PIC 99.
                 10 WS-GREG-YY     PIC 99.
           03 WS-YYMMDD-DATE       PIC 9(6).
           03 FILLER REDEFINES WS-YYMMDD-DATE.
              05 WS-YYMMDD-YY      PIC 99.
              05 WS-YYMMDD-MM      PIC 99.
              05 WS-YYMMDD-DD      PIC 99.
           03 WS-DATE-3.
              05 WS-MONTH-3        PIC Z9.
              05 FILLER            PIC X(1)   VALUE '/'.
              05 WS-DAY-3          PIC 9(2).
              05 FILLER            PIC X(1)   VALUE '/'.
              05 WS-YEAR-3         PIC 9(2).
MP1011 01  WS-DATE-S-AREA.
MP1011     05 WS-DATE-S                     PIC 9(8).
MP1011     05 FILLER                        REDEFINES WS-DATE-S.
MP1011        10 WS-DATE-S-CC               PIC 9(2).
MP1011        10 WS-DATE-S-YY               PIC 9(2).
MP1011        10 WS-DATE-S-MM               PIC 9(2).
MP1011        10 WS-DATE-S-DD               PIC 9(2).
MP1011     05 WS-UPDT-FLAG                  PIC X(01) VALUE 'N'.
           03 WS-TIME-1            PIC 9(7).
           03 FILLER REDEFINES WS-TIME-1.
              05 FILLER            PIC X.
              05 WS-HOURS-1        PIC 9(2).
              05 WS-MINUTES-1      PIC 9(2).
              05 WS-SECONDS-1      PIC 9(2).
           03 FILLER REDEFINES WS-TIME-1.
              05 FILLER            PIC X(1).
              05 WS-TIME-4         PIC 9(4).
              05 FILLER            PIC X(2).
           03 WS-TIME-3.
              05 WS-HOURS-3        PIC Z9.
              05 FILLER            PIC X(1)   VALUE ':'.
              05 WS-MINUTES-3      PIC 9(2).
              05 FILLER            PIC X(1)   VALUE ':'.
              05 WS-SECONDS-3      PIC 9(2).
           03 FILLER.
      **** (WS-PT-AREA) ****
              05 WS-PT-AMOUNT         PIC 9(4)V99.
              05 WS-PT-CHECK-NR       PIC 9(10).
              05 WS-PT-MESSAGE-FLAG   PIC X.

       01  WORK-DATE              PIC 9(7).
       01  FILLER REDEFINES WORK-DATE.
           05  FILLER             PIC 9(2).
           05  WORK-DATE-X        PIC 9(5).
       01  WORK-TIME              PIC 9(7).
       01  FILLER REDEFINES WORK-TIME.
           05  FILLER             PIC 9(1).
           05  WORK-TIME-X        PIC 9(5).
           05  FILLER             PIC 9(1).

       01  ATTACHED-PRINT-RESPONSE.
           05  FILLER              PIC X(3)     VALUE '>C<'.
           05  ATT-AUTH-NUMBER     PIC 9(5)     VALUE ZEROES.
           05  FILLER              PIC X(3)     VALUE '`1C'.
           05  ATT-CTL-NUMBER      PIC 9(9)     VALUE ZEROES.
           05  FILLER              PIC X(3)     VALUE '`1C'.
           05  ATT-TOTAL-ORDER-AMT PIC 9(5)V99  VALUE ZEROES.
           05  FILLER              PIC X(3)     VALUE '`1C'.
           05  ATT-INCREMENT-AMT   PIC 9(5)V99  VALUE ZEROES.
           05  FILLER              PIC X(3)     VALUE '`1C'.
           05  ATT-DATE            PIC X(8)     VALUE SPACES.
           05  FILLER              PIC X(3)     VALUE '`1C'.
           05  ATT-TIME            PIC X(8)     VALUE SPACES.
           05  FILLER              PIC X(3)     VALUE '`1C'.
           05  ATT-REMAINDER       PIC X(125)   VALUE SPACES.

CP1011***** FORMAT CHANGED WITH CONTROL NUMBER EXPANSION - BELOW IS NEW
CP1011****  FORMAT WITH "OLD" FORMAT COMMENTED OUT UNDERNEATCH
         01 CHECK-ENTRY-COMMON-AREA.
           03 CHECK-ENTRY-CONTROL  PIC XX VALUE SPACES.
           03 CHECK-NR-AREA.
             05 1ST-10-BYTES.
               07 1ST-10-BYTES-N   PIC 9(10).
             05 2ND-10-BYTES.
               07 2ND-10-BYTES-N   PIC 9(10).
           03 FILLER               REDEFINES CHECK-NR-AREA.
             05 1ST-9-BYTES.
               07 1ST-9-BYTES-N    PIC 9(9).
             05 2ND-9-BYTES        PIC X(9).
             05 FILLER             PIC X(2).
           03 FILLER               REDEFINES CHECK-NR-AREA.
             05 1ST-8-BYTES.
               07 1ST-8-BYTES-N    PIC 9(8).
             05 2ND-8-BYTES        PIC X(8).
             05 FILLER             PIC X(4).
           03 FILLER               REDEFINES CHECK-NR-AREA.
             05 1ST-7-BYTES.
               07 1ST-7-BYTES-N    PIC 9(7).
             05 2ND-7-BYTES        PIC X(7).
             05 FILLER             PIC X(6).
CP1011     03 CHECK-AMOUNT         PIC 9(5)V99 VALUE 0.
           03 FILLER               PIC XX VALUE SPACES.
CP1011     03 CHECK-ENTRY-DATA     PIC X(18) VALUE SPACES.
           03 FILLER               PIC X VALUE SPACES.
CP1011     03 FILLER               PIC X(20) VALUE SPACES.
           03 CHECK-ENTRY-CANADIAN-AMT PIC 9(5)V99.
CP1011     03 FILLER               PIC X(7) VALUE SPACES.
           03 CHECK-ENTRY-TRAN-ID  PIC X(2).
CP1011     03 FILLER               PIC X(4) VALUE SPACES.
           03 CHECK-ENTRY-ONLRCD   PIC X(256) VALUE SPACES.
           03 CHECK-ENTRY-ORDRFIL  PIC X(212) VALUE SPACES.
CP1011     03 FILLER               PIC X(4) VALUE SPACES.

         01 FILLER                 REDEFINES CHECK-ENTRY-COMMON-AREA.
           03 FILLER               PIC XXX.
           03 CHECK-ENTRY-MESSAGE-1 PIC X(39).
           03 FILLER               PIC XXX.
           03 CHECK-ENTRY-MESSAGE-2 PIC X(39).


           EJECT
      ***************************************
      *    C I C S   O U T P U T   A R E A  *
      ***************************************
       01  FILLER.
           03 OUT-COMENT.
             05 OUT-COMENT-1       PIC X(40).
             05 OUT-COMENT-2.
MP1004          06 FILLER          PIC X(60)     VALUE SPACES.
                06 OUT-COMENT-2-E.
                   07 FILLER       PIC X(20).
             05 FILLER             PIC X.
             05 OUT-GOLD-MESSAGE   PIC X(79).
             05 FILLER             REDEFINES OUT-GOLD-MESSAGE.
                06 OUT-NR-GOLD      PIC ZZZ9.
                06 FILLER           PIC X.
                06 OUT-GOLD-GROSS   PIC ZZ,ZZZ.99-.
                06 FILLER           PIC X(64).
082008     03 OUT-NR-GALLONS       PIC Z(5).99.
           03 OUT-PRICE-GALLON     PIC 9.999.
           03 OUT-TOTAL-COST       PIC ZZZZZ.99.

         01 VOICE-RESPONSE-OUTPUT-AREA.
           03 VR-TRANS-ID                  PIC XX.
           03 FILLER                       PIC X.
           03 VR-REQUEST-ID                PIC X.
           03 VR-REQUEST-VERSION           PIC X.
           03 FILLER.
              05 FILLER                    PIC X(6)     VALUE SPACES.
              05 VR-CARD-NUMBER-10         PIC X(10).
           03 VR-TRANS-FLAG                PIC X        VALUE SPACE.
           03 FILLER                       PIC X(7)     VALUE SPACES.
           03 FILLER                       PIC X(7)     VALUE SPACES.
           03 VR-PHONE-LIMIT-FLAG          PIC X        VALUE 'N'.
           03 FILLER                       PIC X(7)     VALUE SPACES.
           03 FILLER                       PIC X(7)     VALUE SPACES.
           03 VR-VRU-CAN-DRAFT             PIC X        VALUE SPACES.
           03 VR-EXPRESS-BALANCE           PIC 9(6)V99  VALUE ZEROES.
           03 VR-EXPRESS-BALANCE-AVAIL     PIC 9(6)V99  VALUE ZEROES.
           03 VR-EXPRESS-BALANCE-CAN       PIC 9(6)V99  VALUE ZEROES.
           03 VR-EXPRESS-BALANCE-AVAIL-CAN PIC 9(6)V99  VALUE ZEROES.
           03 VR-CASH-LIMIT-US             PIC 9(6)V99  VALUE ZEROES.
           03 VR-CASH-LIMIT-CN             PIC 9(6)V99  VALUE ZEROES.
           03 FILLER                       PIC X(59)    VALUE SPACES.
           03 USUAL-FP-MESSAGE             PIC X(80).

      *----------------------------------------------------------------*
      *        OTHER WORK AREAS                                        *
      *----------------------------------------------------------------*

         01  ALPHA-TABLE.
             05  ALPHA-CONSTANTS.
                 10  FILLER           PIC X(07)  VALUE
                     'YAYB000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YBYC000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YCYD000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YDYE000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YEYF000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YFYG000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YGYH000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YHYI000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YIYJ000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YJYK000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YKYL000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YLYM000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YMYN000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YNYO000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YOYP000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YPYQ000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YQYR000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YRYS000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YSYT000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YTYU000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YUYV000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YVYW000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YWYX000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YXYY000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YYYZ000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YZZA000'.
                 10  FILLER           PIC X(07)  VALUE
                     'YZZA000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZAZB000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZBZC000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZCZD000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZDZE000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZEZF000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZFZG000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZGZH000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZHZI000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZIZJ000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZJZK000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZKZL000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZLZM000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZMZN000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZNZO000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZOZP000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZPZQ000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZQZR000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZRZS000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZSZT000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZTZU000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZUZV000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZVZW000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZWZX000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZXZY000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZYZZ000'.
                 10  FILLER           PIC X(07)  VALUE
                     'ZZYA000'.
           05  ALPHA-CONSTANTS-TABLE REDEFINES ALPHA-CONSTANTS
                                     OCCURS 53 TIMES
                                     ASCENDING KEY IS
                                       ISBN-TABLE
                                     INDEXED BY ALPHA-IND.
               15  ISBN-TABLE         PIC XX.
               15  ALPHA-TITLE-TABLE.
                   20  TABLE-ST       PIC XX.
                   20  TABLE-NR       PIC 999.

           COPY TSFMW003.

101014      03 WRK-TRIP-I-NUMERIC  PIC 9(09).

         01 DCOMP-WORK-AREA.
            03 FILLER               PIC S9999 COMP.
            03 FILLER               PIC S9999 COMP.
            03 FILLER              PIC X(60).
         01 FILLER.
      **** (DCOMP-TRIP-AREA) ****
            03 DCOMP-LENGTH        PIC S9999 COMP.
            03 DCOMP-TRIP-NR       PIC X(20).
            03 FILLER              REDEFINES DCOMP-TRIP-NR.
              05 DCOMP-TRIP-CHAR  PIC X
                                  OCCURS 20 TIMES
                                  INDEXED BY DTC-INDEX.
         01 FILLER.
      **** (DCOMP-EDIT-AREA) ****
           03 DCOMP-EDIT-NR       PIC X(10).
           03 FILLER              REDEFINES DCOMP-EDIT-NR.
              05 DCOMP-EDIT-CHAR  PIC X
                                  OCCURS 10 TIMES
                                  INDEXED BY DEC-INDEX.

         01 DEEDIT-AREA.
           03 NR-OF-BYTES          PIC S99 VALUE +0.
           03 NR-OF-DECIMALS       PIC S9 VALUE +0.
           03 DEEDIT-FIELD         PIC X(10).
           03 FILLER REDEFINES DEEDIT-FIELD.
              05 DEEDIT-FIELD-X    PIC ZZZZZ.ZZ.
              05 FILLER            PIC X(02).
       01  PLAY-DEEDIT-FLD-N       PIC 9(7)V99.
       01  FILLER REDEFINES PLAY-DEEDIT-FLD-N.
           05 PLAY-DEEDIT-FLD-C    PIC X(9).

           EJECT
      *----------------------------------------------------------------*
      *            MESSAGES AND COMMENTS                               *
      *----------------------------------------------------------------*

       01  FILLER.
      **** (TERM-MESSAGES) ****
           03 NORMAL-MESSAGE.
             05 FILLER             PIC X(40) VALUE
               '*OK..  HAVE T/S ATTENDANT GIVE DRIVER A '.
             05 FILLER             PIC X(15) VALUE
               'USI DIRECTORY  '.
             05 US-CODE-NR         PIC Z(5).
             05 FILLER             PIC X(20) VALUE SPACES.

           03 I-PRMPT-WORK.
             05 FILLER             PIC XX VALUE 'I '.
CP1011       05 FILLER             PIC X(29) VALUE SPACES.
CP1011       05 I-CTL-NR           PIC 9(7) VALUE 0.
             05 I-AMT              PIC 9(5)V99 VALUE 0.
             05 I-TIMIN            PIC 9(4) VALUE 0.
             05 FILLER             PIC X VALUE SPACES.

           03 OUTPUT-DATA-OK.
             05 FILER              PIC X(08) VALUE 'OK XMIT-'.
             05 OUT-NETXMN         PIC ZZ,ZZZ.99-.
             05 FILLER             PIC X(02) VALUE '#-'.
CP1011       05 OUT-CTL-NR         PIC 9(07) VALUE 0.
CP1011       05 FILLER             PIC X(01) VALUE SPACES.
             05 FILLER             PIC X(06) VALUE 'AUTH#-'.
             05 OUT-CK-AUTH-NR     PIC 9(04) VALUE 0.

           03 OUTPUT-2ND-LINE.
             05 FILLER             PIC X(39) VALUE
               'CHK MUST BE MADE OUT TO DRIVER AND T/S.'.
             05 FILLER             PIC XXX VALUE SPACES.
SB0614       05 OUT-TAX-HEAD-A.
SB0614          10 OUT-TAX-HEAD    PIC X(06) VALUE SPACES.
SB0614          10 OUT-TAX         PIC Z(5).ZZ.
SB0614       05 OUT-SURCH-HEAD-B REDEFINES OUT-TAX-HEAD-A.
SB0614          10 OUT-SURCH-HEAD  PIC X(06).
SB0614          10 OUT-SURCH       PIC ZZ9.99.
SB0614          10 FILLER          PIC X(02).

           03 OUTPUT-CAN-DATA-OK.
             05 FILLER             PIC X(4) VALUE 'OK- '.
             05 OUT-CAN-NETXMN     PIC ZZ,ZZZ.99-.
             05 FILLER             PIC X(5)
                VALUE 'CAN$ '.
             05 FILLER             PIC XX   VALUE '#-'.
             05 OUT-CAN-CTL-NR     PIC 9(6) VALUE 0.
             05 OUT-CAN-BRIDGE     PIC X(3) VALUE SPACES.
             05 FILLER             PIC X    VALUE SPACES.
             05 FILLER             PIC X(5) VALUE 'AUTH-'.
             05 OUT-CAN-CK-AUTH-NR PIC 9(4).

           03 OUTPUT-CAN-2ND-LINE.
             05 FILLER             PIC X(39) VALUE
               'CHK MUST BE MADE OUT TO DRIVER AND T/S.'.
             05 FILLER             PIC XXX VALUE SPACES.
             05 OUTPUT-CAN-2ND-LINE-COUNTRY   PIC X(2)   VALUE 'US'.
             05 FILLER             PIC X(13)
                VALUE ' EQUIVALENT: '.
             05 OUT-US-NETXMN     PIC ZZ,ZZZ.99-.
SB0614       05 OUT-CAN-TAX-HEAD-A.
SB0614          10 OUT-CAN-TAX-HEAD    PIC X(06) VALUE SPACES.
SB0614          10 OUT-CAN-TAX         PIC Z(4).ZZ.
SB0614       05 OUT-CAN-SURCH-HEAD-B REDEFINES OUT-CAN-TAX-HEAD-A.
SB0614          10 OUT-CAN-SURCH-HEAD  PIC X(07).
SB0614          10 OUT-CAN-SURCH       PIC ZZ9.99.

           03 AUTO-DIAL-MESSAGE.
             05 FILLER             PIC X(39) VALUE
               'CHECK IS ON THE WAY                    '.

           03 TRI-STATE-MESSAGE-1.
             05 FILLER             PIC X(6) VALUE 'DRIVER'.
             05 FILLER             PIC X VALUE QUOTE.
             05 FILLER             PIC X(20) VALUE
                'S CONTROL NUMBER IS '.

           03 TRI-STATE-MESSAGE-2  PIC X(47) VALUE
             'ENTER THE UNIT NUMBER OF THE TRACTOR..........-'.

           03 OUTPUT-GOLD-OK-1.
             05 FILLER               PIC XXX VALUE 'OK-'.
             05 OUT-GOLD-AMT         PIC ZZ,ZZZ.99-.
             05 FILLER               PIC X(6) VALUE 'REF#- '.
             05 OUT-GOLD-DAY         PIC 99.
             05 OUT-GOLD-CTL         PIC 9(7).
             05 OUT-GOLD-BRIDGE      PIC X(3).
             05 OUTPUT-GOLD-HD-1     PIC X(09) VALUE '         '.
SB0614       05 OUT-GOLD-TAX-HD-A.
SB0614          10 OUT-GOLD-TAX-HEAD    PIC X(06) VALUE SPACES.
SB0614          10 OUT-GOLD-TAX         PIC Z(5).ZZ.
SB0614       05 OUT-GOLD-SURCH-HD-B REDEFINES OUT-GOLD-TAX-HD-A.
SB0614          10 OUT-GOLD-SURCH-HEAD  PIC X(06).
SB0614          10 OUT-GOLD-SURCH       PIC ZZ9.99.
SB0614          10 FILLER               PIC X(02).

           03 OUTPUT-GOLD-OK-2.
             05 FILLER           PIC X(26) VALUE
                                 '*===DO NOT WRITE A CHECK!!'.
             05 OUTPUT-GOLD-HD-2 PIC X(29) VALUE
                                 ' DRIVER MUST SIGN INVOICE===*'.
           03 NEW-OUTPUT-GOLD-OK-2.
             05 FILLER           PIC X(50) VALUE
             'PLEASE HAVE DRIVER SIGN INVOICE, YOUR TRANSACTION '.
             05 FILLER           PIC X(10) VALUE
             'NUMBER IS '.
             05 NEW-OUTPUT-DAY   PIC 99    VALUE ZEROS.
             05 NEW-OUTPUT-TRAN  PIC 9(7)  VALUE ZEROS.
             05 FILLER           PIC X(10) VALUE SPACES.

           03 OK-G                             PIC X(40) VALUE
              'OK...G'.
           03 OK-MSG1                          PIC X(40) VALUE
              '*OK..'.
           03 OK-MSG2                          PIC X(40) VALUE
              'OK...'.
           03 OK-S                             PIC X(40) VALUE
              'OK...S'.
           03 SEE-PRINTER                      PIC X(40) VALUE
              'SEE PRINTER'.
           03 WS-CANCEL-GALLONS                PIC 9(5)V99.
           03 WS-CANCEL-COST                   PIC 9(5)V99.
           03 TRANS-CANCELLED-2.
              05 FILLER.
                 10 FILLER                     PIC X(01) VALUE ' '.
                 10 FILLER                     PIC X(17) VALUE
                    'TRANS. CANCELLED '.
              05 FILLER.
                 10 FILLER                     PIC X(01) VALUE ' '.
                 10 CANCEL-GAL-LIT             PIC X(09) VALUE
                    'GALLONS: '.
                 10 CANCEL-GALLONS             PIC 9(5).99.
              05 FILLER.
                 10 FILLER                     PIC X(01) VALUE ' '.
                 10 FILLER                     PIC X(09) VALUE
                    ' AMOUNT: '.
                 10 CANCEL-COST                PIC 9(5).99.
           03 TRANSACTION-RECORDED             PIC X(40) VALUE
              'TRANSACTION RECORDED'.
           03 THANK-YOU                        PIC X(40) VALUE
              'THANK YOU'.
JS1199     03 WS-FLEET-RESPONSE.
JS1199        10 WS-FR-CODE                    PIC 9(05).
JS1199        10 WS-FR-ACCT                    PIC X(05).
MP1004        10 WS-FR-CUST                    PIC X(10).
JS1199        10 WS-FR-AMT                     PIC 9(05)V99.
JS1199        10 WS-FR-CONTROL-NR              PIC 9(06).
JS1199        10 WS-FR-EXP-DATE                PIC 9(04).
JS1199        10 WS-FR-CARD-BLOCKED            PIC X(01).
JS1199        10 WS-FR-MESSAGE                 PIC X(80).

JS0303     03 WS-BATCH-FUEL-RESPONSE.
JS0303        10 WS-BF-MESSAGE                 PIC X(80).
JS0303        10 WS-BF-CONTROL-NR              PIC 9(09).
CC0803        10 WS-BF-FMLOG-RK-DATE           PIC 9(07).

           03 POS-OKG-LARGE.
              05 FILLER                     PIC X(04) VALUE 'CTL#'.
              05 POS-OKGL-CTL               PIC 9(06).
              05 POS-OKGL-BRIDGE            PIC X(03).
JS0907        05 FILLER                     PIC X(02) VALUE ' $'.
JS0907        05 POS-OKGL-AMT               PIC ZZZZZ9.99.
JS0699        05 POS-OKGL-TAX-HEAD          PIC X(06) VALUE SPACES.
JS0699        05 POS-OKGL-TAX               PIC ZZZZZ.ZZ.
           03 POS-OK-TERMINAL.
              05 FILLER.
                 10 FILLER                  PIC X(01) VALUE ' '.
                 10 FILLER                  PIC X(06) VALUE 'CNTL#:'.
                 10 FILLER.
                    15 POS-OKT-CTL-DD       PIC 9(02).
                    15 POS-OKT-CTL          PIC 9(06).
              05 FILLER.
                 10 FILLER                  PIC X(01) VALUE ' '.
                 10 FILLER                  PIC X(09) VALUE 'GALLONS: '.
                 10 POS-OKT-GALLONS         PIC 9(5).99.
              05 FILLER.
                 10 FILLER                  PIC X(01) VALUE ' '.
                 10 FILLER                  PIC X(09) VALUE 'AMOUNT: '.
                 10 POS-OKT-AMOUNT          PIC 9(5).99.
              05 FILLER.
                 10 FILLER                  PIC X(07) VALUE ' DATE: '.
                 10 POS-OKT-DATE            PIC X(8).
                 10 FILLER                  PIC X(07) VALUE ' TIME: '.
                 10 POS-OKT-TIME            PIC X(8).

           03 POS-OK.
              05 FILLER                     PIC X(06) VALUE 'AMOUNT'.
              05 POS-OK-AMT                 PIC ZZ,ZZZ.99-.
              05 FILLER                     PIC X(10) VALUE ' CTL#-'.
              05 POS-OK-CTL                 PIC 9(6).
              05 FILLER                     PIC X(7) VALUE ' AUTH#-'.
              05 POS-OK-AUTH                PIC 9(4).
JS0699        05 POS-OK-TAX-HEAD            PIC X(06).
082008        05 POS-OK-TAX                 PIC Z(5).ZZ.
           03 POS-OK-EXPANDED.
              05 FILLER.
                 10 FILLER                  PIC X(01) VALUE ' '.
                 10 FILLER                  PIC X(04) VALUE 'CTL#'.
                 10 FILLER.
                    15 POS-OKX-CTL          PIC 9(06).
                    15 POS-OKX-XTN-TYPE     PIC X(03) VALUE SPACES.
              05 FILLER.
                 10 FILLER                  PIC X(11)
JS0903              VALUE ' NET AMOUNT'.
JS0903           10 POS-OKX-NET             PIC $$$$$9.99.
              05 FILLER.
                 10 FILLER                  PIC X(18)
                    VALUE ' - FEE REDUCED BY '.
082008           10 POS-OKX-FEE-DEDUCT      PIC 9(5).99.
JS0699        05 FILLER.
JS0699           10 POS-OKX-TAX-HEAD        PIC X(06) VALUE SPACES.
082008           10 POS-OKX-TAX             PIC Z(5).ZZ.
           03 POS-OK-DISCOUNT.
              05 FILLER.
                 10 FILLER                  PIC X(01) VALUE ' '.
                 10 FILLER                  PIC X(04) VALUE 'CTL#'.
                 10 FILLER.
                    15 POS-OKD-CTL          PIC 9(06).
                    15 POS-OKD-XTN-TYPE     PIC X(03) VALUE SPACES.
              05 FILLER.
                 10 FILLER                  PIC X(11)
JS0903              VALUE ' NET AMOUNT'.
JS0903           10 POS-OKD-NET             PIC $$$$$9.99.
JS0699        05 FILLER.
JS0699           10 POS-OKD-TAX-HEAD        PIC X(06) VALUE SPACES.
082008           10 POS-OKD-TAX             PIC Z(5).ZZ.
           03 POS-OK-FEE.
              05 FILLER.
                 10 FILLER                  PIC X(01) VALUE ' '.
                 10 FILLER                  PIC X(04) VALUE 'CTL#'.
                 10 FILLER.
                    15 POS-OKF-CTL          PIC 9(06).
                    15 POS-OKF-XTN-TYPE     PIC X(03) VALUE SPACES.
              05 FILLER.
                 10 FILLER                  PIC X(18)
                    VALUE ' - FEE REDUCED BY '.
082008           10 POS-OKF-FEE-DEDUCT      PIC 9(5).99.
JS0699        05 FILLER.
JS0699           10 POS-OKF-TAX-HEAD        PIC X(06) VALUE SPACES.
082008           10 POS-OKF-TAX             PIC Z(5).ZZ.
           03 POS-SETTLE-OK.
JS0903        05 FILLER                     PIC X(07) VALUE 'CHK AMT'.
JS0903        05 POS-SETTLE-AMT             PIC $$$$$9.99.
              05 FILLER                     PIC X(8) VALUE ' AUTH# '.
              05 POS-SETTLE-AUTH            PIC 9(4).
              05 FILLER                     PIC X(4) VALUE SPACES.
              05 FILLER                     PIC X(11) VALUE
                 ' XTN CNT -'.
              05 POS-SETTLE-CNT             PIC ZZZZ9.
              05 FILLER                     PIC X(11) VALUE
                 '  XTN TOT '.
              05 POS-SETTLE-TOT             PIC $$,$$9.99-.
MP1001     03 EMAIL-OK-RESP.
MP1001        05  EOR-ACCT-CODE             PIC X(10).
MP1001        05  EOR-CUST-ID               PIC X(10).
MP1001        05  EOR-CTL-NR                PIC 9(6).

      ******************************************************************
      *  TRANSACTION RESPONSES.  (ERRORS ONLY)                         *
      ******************************************************************

       01  FILLER.
      **** (TRANSACTION-MESSAGES) ****
           05 CALL-COMPANY-MSG.
              10  FILLER                    PIC X(21) VALUE
              'CALL COMPANY - ERROR '.
              10  CALL-COMPANY-NBR          PIC 9(3)  VALUE ZEROS.

           05 NEW-OUT-MESSAGE.
              10  NEW-OUT-MSG1              PIC X(40) VALUE SPACES.
              10  NEW-OUT-MSG2              PIC X(79) VALUE SPACES.

           05 NO-MSG-NBR                    PIC 9(3)  VALUE 002.
           05 INVALID-UNIT-NR-NBR           PIC 9(3)  VALUE 030.
           05 CUST-NOT-ACTIVE-NBR           PIC 9(3)  VALUE 088.
           05 INACTIVE-CARD-NBR             PIC 9(3)  VALUE 054.
           05 INVALID-DL-NBR                PIC 9(3)  VALUE 056.
           05 INVALID-RATE-NBR              PIC 9(3)  VALUE 084.
           05 INVALID-TRIP-NR-NBR           PIC 9(3)  VALUE 022.
           05 FUEL-NOT-ALLOWED-NBR          PIC 9(3)  VALUE 052.
           05 ID-MISSING-NBR                PIC 9(3)  VALUE 086.
           05 PURCHASE-NOT-ALLOWED-NBR      PIC 9(3)  VALUE 042.
           05 ALLOWANCE-EXCEEDED-NBR        PIC 9(3)  VALUE 044.
           05 MAX-DAILY-NBR                 PIC 9(3)  VALUE 046.
           05 CARD-BLOCKED-NBR              PIC 9(3)  VALUE 048.
           05 LIMIT-EXCEEDED-NBR            PIC 9(3)  VALUE 058.
           05 HUB-READING-NBR               PIC 9(3)  VALUE 060.
           05 TRIP-ALLOW-EXCEEDED-NBR       PIC 9(3)  VALUE 050.

           05 SETTLE-NOT-POSSIBLE-N         PIC S9(5) COMP-3 VALUE +01.
           05 SETTLE-NOT-POSSIBLE           PIC X(40) VALUE
              '001 SETTLEMENT NOT POSSIBLE'.

           05 DRIVER-MAY-NOT-FUEL-NO-PROD-N PIC S9(5) COMP-3 VALUE +02.
           05 DRIVER-MAY-NOT-FUEL-NO-PROD.
              10 FILLER                     PIC X(40) VALUE
                 'DRIVER MAY NOT FUEL HERE'.
              10 FILLER                     PIC X(80) VALUE
                 'NO PRODUCTS ARE AVAILABLE'.

           05 DRIVER-MAY-NOT-PURC-PROD-N    PIC S9(5) COMP-3 VALUE +03.
           05 DRIVER-MAY-NOT-PURC-PROD.
              10 FILLER                     PIC X(40) VALUE
                 'THIS DRIVER MAY NOT PURCHASE'.
              10 FILLER                     PIC X(80) VALUE
                 'THIS PRODUCT'.

           05 MUST-ANSWER-Y-N-N             PIC S9(5) COMP-3 VALUE +04.
           05 MUST-ANSWER-Y-N               PIC X(40) VALUE
              'YOU MUST ANSWER Y OR N'.

           05 MUST-ENTER-CHECK-N            PIC S9(5) COMP-3 VALUE +05.
           05 MUST-ENTER-CHECK              PIC X(40) VALUE
              'YOU MUST ENTER A CHECK NR'.

           05 INVALID-CHECK-NR-N            PIC S9(5) COMP-3 VALUE +06.
           05 INVALID-CHECK-NR              PIC X(40) VALUE
              'INVALID CHECK NUMBER'.
           05 INVALID-CAN-CHECK-NR          PIC X(40) VALUE
              'INVALID CANADIAN CHECK NUMBER'.
           05 INVALID-US-CHECK-NR           PIC X(40) VALUE
              'INVALID US CHECK NUMBER'.

           05 VERIFY-PRODUCTS-N             PIC S9(5) COMP-3 VALUE +07.
           05 VERIFY-PRODUCTS               PIC X(40) VALUE
              'VERIFY PRODUCTS..'.

           05 VERIFY-PRODUCTS-DUP-N         PIC S9(5) COMP-3 VALUE +07.
           05 VERIFY-PRODUCTS-DUP           PIC X(40) VALUE
              'DUPLICATE PRODUCT ENTERED'.

           05 INVALID-AMOUNT-ENTERED-N      PIC S9(5) COMP-3 VALUE +08.
           05 INVALID-AMOUNT-ENTERED        PIC X(40) VALUE
              'INVALID AMOUNT ENTERED.'.

           05 INVALID-NUM-VALUE-N           PIC S9(5) COMP-3 VALUE +08.
           05 INVALID-NUM-VALUE             PIC X(40) VALUE
              'INVALID NUMERIC VALUE ENTERED'.
           05 INVALID-NUM-VALUE2            PIC X(40) VALUE
              'MAX QTY/AMOUNT EXCEEDED      '.

           05 INVALID-PRODUCT-CODE-N        PIC S9(5) COMP-3 VALUE +09.
           05 INVALID-PRODUCT-CODE          PIC X(40) VALUE
              'INVALID PRODUCT CODE'.

           05 PRODUCT-ALLOWANCE-EXCEEDED-N  PIC S9(5) COMP-3 VALUE +10.
           05 PRODUCT-ALLOWANCE-EXCEEDED    PIC X(40) VALUE
              'PRODUCT ALLOWANCE EXCEEDED'.

           05 MAX-DAILY-PROD-PURC-N         PIC S9(5) COMP-3 VALUE +11.
           05 MAX-DAILY-PROD-PURC.
              10 FILLER                     PIC X(40) VALUE
                 'MAXIMUM DAILY PRODUCT PURCHASE'.
              10 FILLER                     PIC X(40) VALUE
                 'EXCEEDED'.

           05 INVALID-CARD-NR-N             PIC S9(5) COMP-3 VALUE +12.
           05 INVALID-CARD-NR               PIC X(40) VALUE
              'INVALID CARD NR'.

DR0121     05 INVALID-CVC1-N                PIC S9(5) COMP-3
DR0121                                                     VALUE +1557.
DR0121     05 INVALID-CVC1                  PIC X(40) VALUE
DR0121        'INVALID CVC1 ON CARD'.

           05 INVALID-RESP-QUERY-N          PIC S9(5) COMP-3 VALUE +13.
           05 INVALID-RESP-QUERY            PIC X(40) VALUE
              'INVALID RESPONSE TO QUERY'.

           05 CHECK-ENTRY-ERROR-N           PIC S9(5) COMP-3 VALUE +14.
           05 CHECK-ENTRY-ERROR             PIC X(40) VALUE
              'CHECK ENTRY ERROR'.

           05 SYSTEM-UNDER-INQUIRY-N        PIC S9(5) COMP-3 VALUE +15.
           05 SYSTEM-UNDER-INQUIRY          PIC X(40) VALUE
              'SYSTEM UNDER INQUIRY'.
           05 NEW-SYSTEM-UNDER-INQUIRY      PIC X(40) VALUE
              'SYSTEM UNDER INQUIRY, USE FORMS SCREEN  '.

           05 ID-NR-MISSING-N               PIC S9(5) COMP-3 VALUE +16.
           05 ID-NR-MISSING                 PIC X(40) VALUE
              'ID NR IS MISSING OR INVALID'.

           05 TS-IS-INVALID-N               PIC S9(5) COMP-3 VALUE +17.
           05 TS-IS-INVALID                 PIC X(40) VALUE
              'T/S IS INVALID'.
MP0706     05  IN-NETW-TS-INVALID-N         PIC S9(5) VALUE +17 COMP-3.
MP0706     05  IN-NETW-TS-INVALID           PIC X(40)
MP0706                               VALUE 'BUSSINESS TYPE IS INVALID'.
           05 YCODE-IS-INVALID              PIC X(40) VALUE
              'YCODE NOT ALLOWED'.

           05 DO-NOT-HONOR-N                PIC S9(5) COMP-3 VALUE +18.
           05 DO-NOT-HONOR                  PIC X(40) VALUE
              'DO NOT HONOR'.

           05 NEW-DO-NOT-HONOR1             PIC X(40) VALUE
              'FUEL SCREEN BLOCKED                     '.
           05 NEW-DO-NOT-HONOR2.
              10 FILLER                     PIC X(21) VALUE
              'CALL COMPANY - ERROR '.
              10 NEW-DO-NOT-HONOR-NBR       PIC 9(3)  VALUE ZEROS.
              10 FILLER                     PIC X(55) VALUE SPACES.

071509***** THIS OBSOLETE MESSAGE REUSED FOR VIRTUAL CARD MESSAGE
071509     05 VIRTUAL-CARD-NOT-ALLOWED-N    PIC S9(5) COMP-3 VALUE +19.
071509     05 VIRTUAL-CARD-NOT-ALLOWED      PIC X(40) VALUE
071509        'VIRTUAL CARD NOT ALLOWED'.

           05 TERMINAL-FUEL-NOT-ALLOWED-N   PIC S9(5) COMP-3 VALUE +449.
           05 TERMINAL-FUEL-NOT-ALLOWED     PIC X(40) VALUE
              'TERMINAL FUEL NOT ALLOWED'.

           05 TRIP-ALLOW-EXCEEDED-N         PIC S9(5) COMP-3 VALUE +20.
           05 TRIP-ALLOW-EXCEEDED.
              10 FILLER                     PIC X(40) VALUE
                 'CONTACT SUPERVISOR:'.
              10 FILLER                     PIC X(80) VALUE
                 'TRIP ALLOWANCE HAS BEEN EXCEEDED'.

           05 DRIVER-MAY-NOT-FUEL-HERE-N    PIC S9(5) COMP-3 VALUE +21.
           05 DRIVER-MAY-NOT-FUEL-HERE      PIC X(40) VALUE
              'DRIVER MAY NOT FUEL HERE'.

           05 DRIVER-MAY-NOT-FUEL-CNET.
              10 FILLER                     PIC X(40) VALUE
                 'DRIVER MAY NOT FUEL HERE'.
              10 FILLER                     PIC X(80) VALUE
                 'USING LIMITED NETWORK BY CARD'.

           05 CHECK-NR-BIGGER-N             PIC S9(5) COMP-3 VALUE +22.
           05 CHECK-NR-BIGGER.
              10 FILLER                     PIC X(40) VALUE
                 'BEFORE YOU MAY MOVE ON TO "BIGGER AND'.
              10 FILLER                     PIC X(80) VALUE
                 'BETTER" THINGS, YOU MUST ENTER THE CHECK'.

           05 YOU-ARE-RELEASED-N            PIC S9(5) COMP-3 VALUE +23.
           05 YOU-ARE-RELEASED              PIC X(40) VALUE
              'YOU ARE RELEASED'.

           05 INVALID-RESP-MSG-QUERY-N      PIC S9(5) COMP-3 VALUE +24.
           05 INVALID-RESP-MSG-QUERY.
              10 FILLER                     PIC X(40) VALUE
                 'INVALID RESPONSE TO MESSAGE QUERY'.
              10 FILLER                     PIC X(80) VALUE
                 'CORRECT AND RETRY'.

           05 INVOICE-NR-REQUIRED-N         PIC S9(5) COMP-3 VALUE +25.
           05 INVOICE-NR-REQUIRED           PIC X(40) VALUE
              'INVOICE NR REQUIRED'.

           05 INVOICE-NR-INVALID-N          PIC S9(5) COMP-3 VALUE +25.
           05 INVOICE-NR-INVALID            PIC X(40) VALUE
              'INVOICE NR MUST BE NUMERIC'.

           05 CC-INVOICE-NR-INVALID-N       PIC S9(5) COMP-3 VALUE +25.
           05 CC-INVOICE-NR-INVALID         PIC X(40) VALUE
              'INVOICE NR IS DUPLICATE OF LAST TRANS.'.
           05 FILLER                        PIC X(20) VALUE
              'REFER TO CONTROL #: '.
           05 CC-INVOICE-NR-CTL             PIC 9(7).

           05 FUEL-NOT-ALLOWED-N            PIC S9(5) COMP-3 VALUE +26.
           05 FUEL-NOT-ALLOWED              PIC X(40) VALUE
              'FUEL NOT ALLOWED AT THIS LOCATION'.
           05 FUEL-NOT-ALLOWED2             PIC X(40) VALUE
              'FUEL NOT ALLOWED'.

           05 OIL-NOT-ALLOWED-N             PIC S9(5) COMP-3 VALUE +27.
           05 OIL-NOT-ALLOWED               PIC X(40) VALUE
              'OIL NOT ALLOWED AT THIS LOCATION'.
           05 OIL-NOT-ALLOWED2              PIC X(40) VALUE
              'OIL NOT ALLOWED'.

           05 CASH-NOT-ALLOWED-N            PIC S9(5) COMP-3 VALUE +28.
           05 CASH-NOT-ALLOWED              PIC X(40) VALUE
              'CASH NOT ALLOWED AT THIS LOCATION'.
           05 CASH-NOT-ALLOWED2             PIC X(40) VALUE
              'CASH NOT ALLOWED'.

           05 PROD-NOT-ALLOWED-N            PIC S9(5) COMP-3 VALUE +29.
           05 PROD-NOT-ALLOWED              PIC X(40) VALUE
              'PRODUCTS NOT ALLOWED AT THIS LOCATION'.
           05 PROD-NOT-ALLOWED2             PIC X(40) VALUE
              'PRODUCTS NOT ALLOWED'.

           05 TRIP-NR-REQUIRED-N            PIC S9(5) COMP-3 VALUE +30.
           05 TRIP-NR-REQUIRED              PIC X(40) VALUE
              'TRIP NR IS REQUIRED TO PROCEED'.

           05 TRIP-NR-INVALID-N             PIC S9(5) COMP-3 VALUE +31.
           05 TRIP-NR-INVALID               PIC X(40) VALUE
              'TRIP NR IS INVALID'.

           05 INVALID-CHAR-IN-NAME-N        PIC S9(5) COMP-3 VALUE +32.
           05 INVALID-CHAR-IN-NAME          PIC X(40) VALUE
              'INVALID CHARACTER IN DRIVER NAME'.

           05 MAX-PURC-MNX-DRIVER-N         PIC S9(5) COMP-3 VALUE +33.
           05 MAX-PURC-MNX-DRIVER.
              10 FILLER                     PIC X(40) VALUE
                 'CONTACT SUPERVISOR: MAXIMUM PURCHASE'.
              10 FILLER                     PIC X(80) VALUE
                 'AMOUUNT FOR MNX DRIVER EXCEEDED'.

           05 NEW-MAX-PURC-MNX-DRIVER       PIC X(40) VALUE
              'MNX DRIVER MAY ONLY HAVE A $60 PURCHASE '.

           05 INVOICE-TOTAL-ERROR-N         PIC S9(5) COMP-3 VALUE +34.
           05 INVOICE-TOTAL-ERROR.
              10 FILLER                     PIC X(40) VALUE
                 'INVOICE DETAIL AMOUNTS DOES NOT'.
              10 FILLER                     PIC X(80) VALUE
                 'MATCH EXPECTED TOTAL'.

           05 INVALID-RATE-CODE-N           PIC S9(5) COMP-3 VALUE +35.
           05 INVALID-RATE-CODE             PIC X(40) VALUE
              'INVALID RATE CODE'.

           05 CTL-NR-MAX-N                  PIC S9(5) COMP-3 VALUE +36.
           05 CTL-NR-MAX                    PIC X(40) VALUE
              'CTL # EXCEEDES MAXIMUM'.

           05 INVALID-CANCEL-REQ-N          PIC S9(5) COMP-3 VALUE +37.
           05 INVALID-CANCEL-REQ            PIC X(40) VALUE
              'INVALID CANCEL REQUEST'.

           05 INVALID-ID-NR-N               PIC S9(5) COMP-3 VALUE +38.
           05 INVALID-ID-NR                 PIC X(40) VALUE
              'INVALID ID NR'.

CP1011     05 CALL-TO-CANCEL-N            PIC S9(5) COMP-3 VALUE +1165.
CP1011     05 CALL-TO-CANCEL              PIC X(40) VALUE
CP1011        'PLEASE CALL COMDATA FOR CANCELLATION'.

           05 TRANS-ALREADY-CANCELLED-N     PIC S9(5) COMP-3 VALUE +39.
           05 TRANS-ALREADY-CANCELLED       PIC X(40) VALUE
              'THIS TRANS ALREADY CANCELLED'.

           05 RECORD-MISMATCH-N             PIC S9(5) COMP-3 VALUE +40.
           05 RECORD-MISMATCH               PIC X(40) VALUE
              'RECORD MISMATCH: CANCEL NOT POSSIBLE'.

           05 INVALID-TRANS-NR-N            PIC S9(5) COMP-3 VALUE +41.
           05 INVALID-TRANS-NR              PIC X(40) VALUE
              'INVALID TRANS NR'.

           05 INVALID-TRANS-NR-TS-N         PIC S9(5) COMP-3 VALUE +42.
           05 INVALID-TRANS-NR-TS           PIC X(40) VALUE
              'INVALID TRANS NR / TSCODE'.

           05 TRANSACTION-PURGED-N          PIC S9(5) COMP-3 VALUE +43.
           05 TRANSACTION-PURGED            PIC X(40) VALUE
              'TRANSACTION PURGED'.

           05 FUNCTION-COMPLETE-N           PIC S9(5) COMP-3 VALUE +44.
           05 FUNCTION-COMPLETE             PIC X(40) VALUE
              'FUNCTION COMPLETE'.

           05 INACTIVE-CARD-N               PIC S9(5) COMP-3 VALUE +45.
           05 INACTIVE-CARD                 PIC X(40) VALUE
              'INACTIVE CARD'.

           05 MUST-USE-IN-STATION-N         PIC S9(5) COMP-3 VALUE +46.
           05 MUST-USE-IN-STATION           PIC X(40) VALUE
              'MUST USE IN-STATION CARD'.

           05 INVALID-DL-N                  PIC S9(5) COMP-3 VALUE +47.
           05 INVALID-DL                    PIC X(40) VALUE
              'INVALID DL#'.

           05 NOT-INSTATION-N               PIC S9(5) COMP-3 VALUE +48.
           05 NOT-INSTATION                 PIC X(40) VALUE
              'NOT IN-STATION CARD'.
           05 NEW-NOT-INSTATION1            PIC X(40) VALUE
              'CONTACT SUPERVISTOR                     '.
           05 NEW-NOT-INSTATION2.
              10  FILLER                    PIC X(40) VALUE
              'IN-STATION CARD FLAGGED WRONG           '.
              10  FILLER                    PIC X(39) VALUE SPACES.

           05 IN-STATION-PURC-NOT-ALLOWED-N PIC S9(5) COMP-3 VALUE +49.
           05 IN-STATION-PURC-NOT-ALLOWED   PIC X(40) VALUE
              'IN STATION CARD - PURCHASE NOT ALLOWED'.

           05 CUST-NOT-ACTIVE-N             PIC S9(5) COMP-3 VALUE +50.
           05 CUST-NOT-ACTIVE               PIC X(40) VALUE
              'CUSTOMER NOT ACTIVE'.

           05 INVALID-UNIT-NR-N             PIC S9(5) COMP-3 VALUE +51.
           05 INVALID-UNIT-NR               PIC X(40) VALUE
              'INVALID UNIT NR'.

           05 INVALID-UNIT-NR-LEN-N         PIC S9(5) COMP-3 VALUE +51.
           05 INVALID-UNIT-NR-LEN           PIC X(40) VALUE
              'INVALID UNIT NR - INVALID LENGTH'.

           05 CUST-NOT-ON-FUEL-N            PIC S9(5) COMP-3 VALUE +52.
           05 CUST-NOT-ON-FUEL              PIC X(40) VALUE
              'CUSTOMER NOT SET UP FOR FUEL PROGRAM'.

           05 CARD-NOT-ON-FUEL-N            PIC S9(5) COMP-3 VALUE +52.
           05 CARD-NOT-ON-FUEL              PIC X(40) VALUE
              'CARD IS NOT SET UP FOR FUEL PROGRAM'.

           05 NEW-CUST-NOT-ON-FUEL1         PIC X(40) VALUE
              'PLEASE CALL VOICE RESPONSE              '.
           05 NEW-CUST-NOT-ON-FUEL2.
              10 FILLER                     PIC X(23) VALUE
              '- GIVE THE PHONE NUMBER'.
              10 FILLER                     PIC X(56) VALUE SPACES.

           05 NEW-CARD-NOT-ON-FUEL1         PIC X(40) VALUE
              'PLEASE CALL VOICE RESPONSE              '.
           05 NEW-CARD-NOT-ON-FUEL2.
              10 FILLER                     PIC X(23) VALUE
              '- GIVE THE PHONE NUMBER'.
              10 FILLER                     PIC X(56) VALUE SPACES.

           05 CUST-RECORD-NOT-FOUND-N       PIC S9(5) COMP-3 VALUE +53.
           05 CUST-RECORD-NOT-FOUND         PIC X(40) VALUE
              'CUSTOMER RECORD NOT FOUND'.

           05 INACTIVE-DRIVER-N             PIC S9(5) COMP-3 VALUE +54.
           05 INACTIVE-DRIVER               PIC X(40) VALUE
              'INACTIVE DRIVER'.

           05 ENTER-PROPER-TS-PHONE-N       PIC S9(5) COMP-3 VALUE +55.
           05 ENTER-PROPER-TS-PHONE         PIC X(40) VALUE
              'ENTER PROPER T/S PHONE NR'.

           05 INACTIVE-LOCATION-N           PIC S9(5) COMP-3 VALUE +464.
           05 INACTIVE-LOCATION             PIC X(40) VALUE
              'THIS LOCATION IS NOT ACTIVE'.

           05 UNAUTHORIZED-TERM-N           PIC S9(5) COMP-3 VALUE +56.
           05 UNAUTHORIZED-TERM             PIC X(40) VALUE
              'UNAUTHORIZED TERMINAL'.

           05 THIS-CARD-MUST-CALL-N         PIC S9(5) COMP-3 VALUE +57.
           05 THIS-CARD-MUST-CALL           PIC X(40) VALUE
              'THIS CARD MUST CALL'.

           05 CANCEL-MUST-CALL-N            PIC S9(5) COMP-3 VALUE +603.
           05 CANCEL-MUST-CALL              PIC X(40) VALUE
              'CAN NOT CANCEL XTN AFTER 2 HOURS'.

           05 DAILY-LIMIT-EXCEEDED-N        PIC S9(5) COMP-3 VALUE +58.
           05 DAILY-LIMIT-EXCEEDED          PIC X(40) VALUE
              'DAILY LIMIT EXCEEDED'.

           05 CASH-ADVANCE-NOT-AVAIL-N      PIC S9(5) COMP-3 VALUE +59.
           05 CASH-ADVANCE-NOT-AVAIL        PIC X(40) VALUE
              'CASH ADVANCE NOT AVAILABLE'.

           05 NO-OIL-THIS-UNIT-N            PIC S9(5) COMP-3 VALUE +60.
           05 NO-OIL-THIS-UNIT              PIC X(40) VALUE
              'NO OIL THIS UNIT'.

           05 PROD-CODES-NOT-ALLOWED-N      PIC S9(5) COMP-3 VALUE +61.
           05 PROD-CODES-NOT-ALLOWED        PIC X(40) VALUE
              'PRODUCT CODES NOT ALLOWED'.

           05 AUTO-DIAL-DOWN-N              PIC S9(5) COMP-3 VALUE +62.
           05 AUTO-DIAL-DOWN                PIC X(40) VALUE
              'AUTO DIAL IS DOWN'.

           05 FUEL-PRICE-ERR-N              PIC S9(5) COMP-3 VALUE +63.
           05 FUEL-PRICE-ERR                PIC X(40) VALUE
              'FUEL PRICE ERROR'.

           05 FUEL-PRICE-ERR-CREDIT-N       PIC S9(5) COMP-3 VALUE +621.
           05 FUEL-PRICE-ERR-CREDIT         PIC X(40) VALUE
              'FUEL PRICE ERROR, USE CREDIT PRICE'.

           05 NEW-FUEL-PRICE-ERR1           PIC X(17) VALUE
              'FUEL PRICE ERROR '.
           05 NEW-FUEL-PRICE-TYPE           PIC X(23) VALUE '(CASH)'.
           05 NEW-FUEL-PRICE-ERR2.
              10 FILLER                     PIC X(42) VALUE
              'PRESS "F5" TO UPDATE T/S, RE-ENTER ORDER, '.
              10 FILLER                     PIC X(22) VALUE
              'PRESS "F7" TO OVERRIDE'.
              10 FILLER                     PIC X(15) VALUE SPACES.

           05 ZERO-OR-NEG-N                 PIC S9(5) COMP-3 VALUE +64.
           05 ZERO-OR-NEG                   PIC X(40) VALUE
              'ZERO OR NEGATIVE AMT ENTERED'.

           05 UNIT-NR-REQ-N                 PIC S9(5) COMP-3 VALUE +65.
           05 UNIT-NR-REQ                   PIC X(40) VALUE
              'UNIT NR IS REQUIRED TO PROCEED'.

           05 OTHER-FUEL-NOT-ALLOWED-N      PIC S9(5) COMP-3 VALUE +66.
           05 OTHER-FUEL-NOT-ALLOWED        PIC X(40) VALUE
              'OTHER FUEL NOT ALLOWED THIS COMP'.

           05 NR1-FUEL-NOT-ALLOWED-N        PIC S9(5) COMP-3 VALUE +66.
           05 NR1-FUEL-NOT-ALLOWED          PIC X(40) VALUE
              'NR1 FUEL NOT ALLOWED THIS COMP'.

           05 NO-REFER-PURC-N               PIC S9(5) COMP-3 VALUE +67.
           05 NO-REFER-PURC                 PIC X(40) VALUE
              'NO REFER PURCHASE ALLOWED THIS UNIT'.

           05 PRICE-EXCEEDS-MAX-N           PIC S9(5) COMP-3 VALUE +68.
           05 PRICE-EXCEEDS-MAX.
              10 FILLER                     PIC X(40) VALUE
                 'FUEL PRICE OUT OF RANGE'.
              10 FILLER                     PIC X(05) VALUE
                 'MAX: '.
              10 PRICE-EXCEEDS-MAX-MAX      PIC Z.999.
              10 FILLER                     PIC X(06) VALUE
                 ' MIN: '.
              10 PRICE-EXCEEDS-MAX-MIN      PIC Z.999.

           05 EXCESSIVE-OIL-REQUEST-N       PIC S9(5) COMP-3 VALUE +69.
           05 EXCESSIVE-OIL-REQUEST.
              10 FILLER                     PIC X(40) VALUE
                'OIL REQUEST EXCEEDS AVAILABLE. '.
              10 FILLER                     PIC X(05) VALUE 'ONLY '.
              10 XCS-OIL-REQ                PIC ZZ9.
              10 XCS-OIL-REQ-MSG            PIC X(6).
              10 FILLER                     PIC X(76) VALUE
                ' ARE ALLOWED PER TRANSACTION'.

           05 OIL-EXCEEDS-MAX-N             PIC S9(5) COMP-3 VALUE +69.
           05 OIL-EXCEEDS-MAX.
              10 FILLER                     PIC X(40) VALUE
                 'OIL REQUEST EXCEEDS AVAILABLE. '.
              10 OIL-EXCEEDS-MAX-QTY        PIC ---9.
              10 FILLER                     PIC X(1) VALUE ' '.
              10 OIL-EXCEEDS-MAX-QTY-MSG    PIC X(6).
              10 FILLER                     PIC X(5) VALUE ' AND '.
              10 OIL-EXCEEDS-MAX-DOL        PIC ---9.99.
              10 FILLER                     PIC X(25) VALUE
                 ' DOLLARS ARE AVAILABLE'.

           05 EXCESSIVE-BALANCE-REQUEST-N   PIC S9(5) COMP-3 VALUE +70.
           05 EXCESSIVE-BALANCE-REQUEST.
              10 FILLER                     PIC X(40) VALUE
                'EXPENSE BALANCE HAS BEEN EXCEEDED.'.
              10 XCS-BAL-REQ-AMT            PIC ZZZ,ZZZ.99-.
              10 FILLER                     PIC X(70) VALUE
                'IS AVAILABLE.'.

           05 NEW-EXCESSIVE-BALANCE-REQUEST PIC X(40) VALUE
              'EXPENSE BALANCE HAS BEEN EXCEEDED       '.

           05 CHECK-ADJUSTMENT-MSG.
              10 FILLER                     PIC X(40) VALUE
                 'NOTIFY SERVICE CENTER OF PROCESSING FEE'.
              10 FILLER                     PIC X(18) VALUE
                 'CHECK AMT WILL BE '.
              10 CHECK-ADJUSTMENT-AMT       PIC ZZZZ.99.
              10 FILLER                     PIC X(08) VALUE
                 ' FP FEE '.
              10 CHECK-ADJUSTMENT-FEE       PIC ZZ.99.
              10 FILLER                     PIC X(12) VALUE
                 ' OTHER FEES '.
              10 CHECK-ADJUSTMENT-OT-FEE    PIC ZZZ.99.

           05 MULTIPLY-ERROR-MESSAGE.
              10 FILLER                     PIC X(40) VALUE
                 'TOTAL PRICE DOES NOT EQUAL NR OF GLLNS'.
              10 FILLER                     PIC X(80) VALUE
                 'TIMES PRICE PER GALLON'.

           05 CHECK-DIGIT-ERROR-MESSAGE-N   PIC S9(5) COMP-3 VALUE +73.
           05 CHECK-DIGIT-ERROR-MESSAGE.
              10 FILLER                     PIC X(40) VALUE
                 'ID NR IS MISSING OR INVALID..'.

           05 SRVC-TYPE-ERROR-MESSAGE-N     PIC S9(5) COMP-3 VALUE +74.
           05 SRVC-TYPE-ERROR-MESSAGE.
              10 FILLER                     PIC X(40) VALUE
                 'FULL/SELF SERVICE CODE INVALID, OR'.
              10 FILLER                     PIC X(80) VALUE
                 'DRIVER MAY NOT USE THIS SERVICE.'.

           05 NO-MSG-N                      PIC S9(5) COMP-3 VALUE +75.
           05 NO-MSG.
              10 FILLER                     PIC X(4) VALUE 'NO  '.
              10 NO-TYPE                    PIC X(1) VALUE ' '.
              10 ERR-AMT                    PIC ZZZ,ZZZ.99-.
              10 FILLER                     PIC X(10) VALUE SPACES.
              10 ERR-SML-NAM                PIC X(7).
           05 CREDIT-HARD-HALT-MSG-N        PIC S9(5) COMP-3 VALUE +75.
           05 CREDIT-HARD-HALT-MSG.
              10 FILLER                     PIC X(40) VALUE
                 'PLEASE HAVE THE DRIVERS COMPANY CALL'.
              10 FILLER                     PIC X(40) VALUE
                 'THE COMDATA CREDIT DEPARTMENT'.

           05 MINIMUM-GALLON-MESSAGE-N      PIC S9(5) COMP-3 VALUE +76.
           05 MINIMUM-GALLON-MESSAGE.
              10 FILLER                     PIC X(21) VALUE
                 'DRIVER MUST PURCHASE'.
              10 MINIMUM-GALLON-NR          PIC ZZZ.ZZ.
              10 MINIMUM-GALLON-MSG         PIC X(16) VALUE
                 ' GALLONS'.
              10 FILLER                     PIC X(80) VALUE
                 'OF FUEL FOR CASH ADVANCE'.

           05 MINIMUM-GALLON-MESSAGE2-N     PIC S9(5) COMP-3 VALUE +76.
           05 MINIMUM-GALLON-MESSAGE2.
              10 FILLER                     PIC X(21) VALUE
                 'DRIVER MUST PURCHASE'.
              10 MINIMUM-GALLON-NR2         PIC ZZZ.ZZ.
              10 MINIMUM-GALLON-MSG2        PIC X(16) VALUE
                 ' GALLONS'.
              10 FILLER                    PIC X(80) VALUE
                 'OF FUEL FOR OIL PURCHASE'.

           05 MAXIMUM-GALLON-MESSAGE-N      PIC S9(5) COMP-3 VALUE +76.
           05 MAXIMUM-GALLON-MESSAGE.
              10 FILLER                     PIC X(25) VALUE
                 'DRIVER MAY ONLY PURCHASE '.
              10 MAXIMUM-GALLON-NR          PIC ZZ9-.
              10 MAXIMUM-GALLON-MSG         PIC X(11) VALUE
                 ' GALLONS OF'.
              10 FILLER                    PIC X(80) VALUE
                 'FUEL AT THIS LOCATION.  SEE FMRM 02.'.
           05 MAXIMUM-GALLON-MESSAGE2.
              10 FILLER                     PIC X(40) VALUE
                 'COMPANY MAY ONLY PURCHASE 263 GALLONS'.
              10 FILLER                    PIC X(80) VALUE
                 'OF FUEL AT THIS LOCATION.  (CONVERSION PROBLEM)'.
           05 MAXIMUM-GALLON-MESSAGE3.
              10 FILLER                     PIC X(20) VALUE
                 'DRIVER MAY ONLY GET '.
              10 MAXIMUM-GALLON-NR3         PIC ZZZZ9-.
              10 MAXIMUM-GALLON-MSG3        PIC X(14) VALUE
                 ' GALLONS OF   '.
              10 MAXIMUM-GALLON-MSG3T       PIC X(08) VALUE
                 ' DIESEL '.
              10 FILLER                     PIC X(30) VALUE
                 'FUEL, DUE TO COMPANY LIMITS.'.

           05 EXCESSIVE-ADVANCE-REQUEST-N   PIC S9(5) COMP-3 VALUE +77.
           05 EXCESSIVE-ADVANCE-REQUEST.
              10 FILLER                     PIC X(40) VALUE
                 'ADVANCE REQUEST AMT EXCEEDS AVAILABLE'.
              10 FILLER                     PIC X(07) VALUE
                 'FUNDS. '.
              10 XCS-ADV-REQ-AMT            PIC ZZ,ZZZ.99-.
              10 FILLER                     PIC X(63) VALUE
                 'IS AVAILABLE.'.
           05 EXCESSIVE-ADVANCE-REQUEST1    PIC X(40) VALUE
              'ADVANCE AMOUNT CAN NOT EXCEED 999.99   '.
           05 EXCESSIVE-ADVANCE-REQUEST2.
              10 FILLER                     PIC X(40) VALUE
                 'DUE TO CONVERSION RATES THIS COMPANY MAY'.
              10 FILLER                     PIC X(13) VALUE
                 'ONLY RECEIVE '.
              10 XCS-ADV-REQ-AMT2           PIC ZZZ.99.
              10 FILLER                     PIC X(61) VALUE
                 ' DOLLARS IN CASH'.

           05 NEW-EXCESSIVE-ADVANCE-REQUEST PIC X(40) VALUE
              'ADV REQUEST AMT EXCEEDS AVAILABLE FUNDS '.

           05 CARD-PURCHASE-EXCEEDED-N      PIC S9(5) COMP-3 VALUE +78.
           05 CARD-PURCHASE-EXCEEDED.
              10 FILLER                     PIC X(40) VALUE
                 'PREMIER CARD PURCHASE LIMIT EXCEEDED'.
              10 XCS-PURC-REQ               PIC ZZ,ZZZ.99-.
              10 FILLER                     PIC X(70) VALUE
                 'IS AVAILABLE.'.

SB0217     05 COMCHEK-MOB-LIMIT-EXCEEDED-N  PIC S9(5) COMP-3
SB0217                                                VALUE +1443.
SB0217     05 COMCHEK-MOB-LIMIT-EXCEEDED.
SB0217        10 FILLER                     PIC X(46) VALUE
SB0217           'COMCHEK MOBILE FUEL WITHDRAWAL LIMIT EXCEEDED '.
SB0217        10 CMCKMOB-AVAIL-AMT          PIC ZZ,ZZZ.99-.
SB0217        10 FILLER                     PIC X(70) VALUE
SB0217           'IS AVAILABLE.'.

           05 FUEL-PRICE-ERROR-N            PIC S9(5) COMP-3 VALUE +79.
           05 FUEL-PRICE-ERROR.
              10 FILLER                     PIC X(05) VALUE
                 'FUEL '.
              10 PRICE-ERROR-TYPE           PIC X(07) VALUE 'CASH'.
              10 FILLER                     PIC X(19) VALUE
                 'PRICE ERROR: AS OF '.
              10 PRICE-ERROR-DATE           PIC X(8).
              10 FILLER                     PIC X(1) VALUE SPACES.

              10 FILLER                     PIC X(21) VALUE
                 'WE SHOW THE PRICE AS '.
              10 PRICE-ERROR-AMT            PIC ZZ.999.
              10 FILLER                     PIC X(1)  VALUE SPACES.
              10 PRICE-ERROR-OVER-FLAG      PIC X(12) VALUE SPACES.
              10 PRICE-ERROR-TAX-MSG        PIC X(40) VALUE SPACES.

           05 FUEL-PRICE-ERROR-TAX-N        PIC S9(5) COMP-3 VALUE +79.
           05 FUEL-PRICE-ERROR-TAX.
              10 FILLER                     PIC X(05) VALUE
                 'FUEL '.
              10 PRICE-ERROR-TYPE-TAX       PIC X(07) VALUE 'CASH'.
              10 FILLER                     PIC X(19) VALUE
                 'PRICE ERROR: AS OF '.
              10 PRICE-ERROR-DATE-TAX       PIC X(8).
              10 FILLER                     PIC X(1) VALUE SPACES.

              10 FILLER                     PIC X(22) VALUE
                 'WE SHOW PRICE W/TAX AS'.
              10 PRICE-ERROR-AMT-TAX        PIC ZZ.999.
              10 FILLER                     PIC X(1)  VALUE SPACES.
              10 PRICE-ERROR-OVER-FLAG-TAX  PIC X(12) VALUE SPACES.
              10 PRICE-ERROR-TAX-MSG-TAX    PIC X(39) VALUE SPACES.

           05 FP-CALC-ERR-MESSAGE-N         PIC S9(5) COMP-3 VALUE +80.
           05 FP-CALC-ERR-MESSAGE.
              10 FILLER                     PIC X(40) VALUE
                 'CALCULATION ERROR. VERIFY ALL FIGURES.'.
              10 FILLER                     PIC X(80) VALUE
                 'VERIFY THAT ALL PRICES ARE CASH PRICES. '.

           05 FP-CALC-ERR-MESSAGE2.
              10 FILLER                     PIC X(40) VALUE
                 'CALCULATION ERROR. VERIFY ALL FIGURES.'.
              10 FILLER                     PIC X(18) VALUE
                 'SUGGESTED COST IS '.
              10 CALC-ERROR-SUGGESTED       PIC Z.ZZZ.
              10 FILLER                     PIC X(16) VALUE
                 ' PER GALLON.'.

           05 FP-CALC-ERR-MESSAGE3.
              10 FILLER                     PIC X(40) VALUE
                 'CALCULATION ERROR. VERIFY ALL FIGURES.'.
              10 FILLER                     PIC X(18) VALUE
                 'SUGGESTED COST IS '.
              10 CALC-ERROR-SUGGESTED-3     PIC Z.ZZZ.
              10 FILLER                     PIC X(16) VALUE
                 ' PER LITER.'.

           05 DUPLICATE-MESSAGE-N           PIC S9(5) COMP-3 VALUE +82.
           05 DUPLICATE-MESSAGE.
              10 DUP-MESSAGE-LINE-1         PIC X(40) VALUE
                 '2ND TRANSACTION IN 2 HRS:'.
              10 FILLER                     PIC X(14) VALUE
                 'REFER TO CTL#'.
              10 DUPLICATE-TRANSACTION      PIC 9(07).

           05 DUPLICATE-NATS-PRE-AUTH-N     PIC S9(5) COMP-3 VALUE +594.
           05 DUPLICATE-NATS-PRE-AUTH       PIC X(40) VALUE
              'DUPLICATE NATS PRE-AUTH REQUEST'.

           05 NEW-DUPLICATE-MESSAGE1        PIC X(40) VALUE
              '2ND TRANSACTION IN 1 HOUR               '.
           05 NEW-DUPLICATE-MESSAGE2.
              10 FILLER                     PIC X(17) VALUE
              'TRANSACTION NBR: '.
              10 NEW-DUPLICATE-TRANSACTION  PIC 9(7)  VALUE ZEROS.
              10 FILLER                     PIC X(9)  VALUE
              ' AT T/S: '.
              10 NEW-DUPLICATE-TS           PIC X(5)  VALUE SPACES.
              10 FILLER                     PIC X(51) VALUE SPACES.

           05 HUB-MESSAGE-N                 PIC S9(5) COMP-3 VALUE +83.
           05 HUB-MESSAGE.
              10 FILLER                     PIC X(12) VALUE
                 'HUB READING '.
              10 HUB-ERROR                  PIC X(28).

           05 PURC-MAX-MESSAGE-N            PIC S9(5) COMP-3 VALUE +84.
           05 PURC-MAX-MESSAGE.
              10 FILLER                     PIC X(40) VALUE
                 'MAXIMUM DAILY PURCHASE LIMIT EXCEEDED'.
              10 FILLER                     PIC X(04) VALUE 'MAX-'.
              10 PURC-MAX-NR                PIC ZZZ9.99.
              10 FILLER                     PIC X(05) VALUE ' VAR-'.
              10 PURC-VAR-NR                PIC Z9.
              10 FILLER                     PIC X(08) VALUE '% AVAIL-'.
              10 PURC-TOTAL-NR              PIC ZZZ9.99.
              10 FILLER                     PIC X(06) VALUE ' USED-'.
              10 PURC-USED-NR               PIC ZZZ9.99.
              10 PURC-DIFF-HD               PIC X(06) VALUE ' OVER-'.
              10 PURC-DIFF-NR               PIC ZZZ9.99.

           05 NEW-PURC-MAX-MESSAGE1         PIC X(40) VALUE
              'MAXIMUM DAILY PURCHASE LIMIT EXCEEDED,  '.
           05 NEW-PURC-MAX-MESSAGE2.
              10 FILLER                     PIC X(06) VALUE ' OVER-'.
              10 NEW-PURC-DIFF-NBR          PIC ZZZ9.99.
              10 FILLER                     PIC X(66) VALUE SPACES.

           05 INQUIRY-MESSAGE-N            PIC S9(5) COMP-3 VALUE +85.
           05 INQUIRY-MESSAGE.
              10 FILLER                     PIC X(40) VALUE
                 '*OK.. SYSTEM IS UNDER INQUIRY.'.
              10 FILLER                     PIC X(80) VALUE
                 'WRITE THIS ORDER UP'.

           05 INVALID-MONEY-SERVICE-N       PIC S9(5) COMP-3 VALUE +88.
           05 INVALID-MONEY-SERVICE         PIC X(40) VALUE
              'INVALID MONEY SERVICE FLAG'.

           05 MUST-USE-MMVC-N               PIC S9(5) COMP-3 VALUE +522.
           05 MUST-USE-MMVC                 PIC X(40) VALUE
              'THIS CUSTOMER MUST USE "MMVC"'.

           05 INVALID-IN-STATION-N          PIC S9(5) COMP-3 VALUE +89.
           05 INVALID-IN-STATION            PIC X(40) VALUE
              'INVALID IN-STATION FLAG'.

           05 CARD-NOT-PRM-EXPENSE-ACCT-N   PIC S9(5) COMP-3 VALUE +91.
           05 CARD-NOT-PRM-EXPENSE-ACCT     PIC X(40) VALUE
              'CARD NOT PREMIER EXPENSE ACCOUNT'.

           05 INVALID-PICKUP-RATE-N         PIC S9(5) COMP-3 VALUE +92.
           05 INVALID-PICKUP-RATE           PIC X(40) VALUE
              'INVALID PICKUP RATE (NOT NUMERIC)'.

           05 INVALID-CASH-ON-CARD-N        PIC S9(5) COMP-3 VALUE +93.
           05 INVALID-CASH-ON-CARD          PIC X(40) VALUE
              'INVALID CASH ON CARD FLAG'.

           05 TRAILER-NR-REQUIRED-N         PIC S9(5) COMP-3 VALUE +434.
           05 TRAILER-NR-REQUIRED           PIC X(40) VALUE
              'TRAILER NUMBER REQUIRED'.

           05 TRAILER-NR-INVALID-N          PIC S9(5) COMP-3 VALUE +435.
           05 TRAILER-NR-INVALID            PIC X(40) VALUE
              'TRAILER NUMBER INVALID'.

           05 TRAILER-HUB-REQUIRED-N        PIC S9(5) COMP-3 VALUE +436.
           05 TRAILER-HUB-REQUIRED          PIC X(40) VALUE
              'TRAILER HUB READING REQUIRED'.

           05 TRAILER-HUB-INVALID-N         PIC S9(5) COMP-3 VALUE +437.
           05 TRAILER-HUB-INVALID           PIC X(40) VALUE
              'TRAILER HUB READING INVALID'.

           05 TRAILER-HR-REQUIRED-N         PIC S9(5) COMP-3 VALUE +589.
           05 TRAILER-HR-REQUIRED           PIC X(40) VALUE
              'TRAILER HOURS REQUIRED'.

           05 TRAILER-HR-INVALID-N          PIC S9(5) COMP-3 VALUE +590.
           05 TRAILER-HR-INVALID            PIC X(40) VALUE
              'TRAILER HOURS INVALID'.

           05 CANADIAN-TAX-AMT-REQ-N        PIC S9(5) COMP-3 VALUE +677.
           05 CANADIAN-TAX-AMT-REQ          PIC X(40) VALUE
              'CANADIAN GOODS & SVCS TAX AMT IS REQ'.

           05 CANADIAN-TAX-AMT-NOT-REQ-N    PIC S9(5) COMP-3 VALUE +678.
           05 CANADIAN-TAX-AMT-NOT-REQ      PIC X(40) VALUE
              'CANADIAN GOODS & SVCS TAX AMT NOT REQ'.

           05 PURCHASE-ORDER-REQUIRED-N     PIC S9(5) COMP-3 VALUE +438.
           05 PURCHASE-ORDER-REQUIRED       PIC X(40) VALUE
              'PURCHASE ORDER NR REQUIRED'.

           05 PURCHASE-ORDER-INVALID-N      PIC S9(5) COMP-3 VALUE +439.
           05 PURCHASE-ORDER-INVALID        PIC X(40) VALUE
              'PURCHASE ORDER NR INVALID'.

           05 PO-NOT-VALID-HERE-N           PIC S9(5) COMP-3 VALUE +440.
           05 PO-NOT-VALID-HERE             PIC X(40) VALUE
              'P.O. MAY NOT BE USED AT THIS LOCATION'.

           05 PO-NOT-VALID-FOR-CARD-N       PIC S9(5) COMP-3 VALUE +441.
           05 PO-NOT-VALID-FOR-CARD         PIC X(40) VALUE
              'P.O. MAY NOT BE USED BY THIS CARDHOLDER'.

           05 PO-LIMIT-EXCEEDED-N           PIC S9(5) COMP-3 VALUE +442.
           05 PO-LIMIT-EXCEEDED             PIC X(40) VALUE
              'REQUEST EXCEEDS PURCHASE ORDER LIMITS'.

           05 PO-REQUIRED-TO-FUEL-HERE-N    PIC S9(5) COMP-3 VALUE +443.
           05 PO-REQUIRED-TO-FUEL-HERE      PIC X(40) VALUE
              'P.O. NUMBER REQUIRED TO FUEL HERE'.

CP0298     05 MUST-BE-AT-A-CREDIT-LOC-N     PIC S9(5) COMP-3 VALUE +772.
  ||       05 MUST-BE-AT-A-CREDIT-LOC.
  ||          10 FILLER                     PIC X(40) VALUE
CP0298           'DRIVER MUST FUEL AT CREDIT LOCATION'.

           05 ACCT-BR000-MUST-BE-BRIDGE-N   PIC S9(5) COMP-3 VALUE +999.
           05 ACCT-BR000-MUST-BE-BRIDGE     PIC X(40) VALUE
              'ACCT BR000 MUST BE BRIDGE TRANSACTION  '.

           05 FUNDED-NOT-ALLOWED-N          PIC S9(5) COMP-3 VALUE +999.
           05 FUNDED-NOT-ALLOWED            PIC X(40) VALUE
              'ACCT BR000 NOT ALLOWED FUNDED PRODUCTS'.

           05 BRIDGE-LIMIT-EXCEEDED-N       PIC S9(5) COMP-3 VALUE +999.
           05 BRIDGE-LIMIT-EXCEEDED         PIC X(40) VALUE
              'BRIDGE LIMIT EXCEEDED'.
           05 BRIDGE-LIMIT-EXCEEDED-2       PIC X(40) VALUE
              'PRESS F4 TO RETRY TRANSACTION AS FUNDED'.

           05 DIRECT-LIMIT-EXCEEDED-N       PIC S9(5) COMP-3 VALUE +999.
           05 DIRECT-LIMIT-EXCEEDED         PIC X(40) VALUE
              'DIRECT BILL LIMIT EXCEEDED'.
           05 DIRECT-LIMIT-EXCEEDED-2       PIC X(40) VALUE
              'PRESS F4 TO RETRY TRANSACTION AS FUNDED'.

           05 INVALID-DRIVER-NR-N        PIC S9(5) COMP-3 VALUE +445.
           05 INVALID-DRIVER-NR             PIC X(40) VALUE
              'INVALID EMPLOYEE NUMBER'.
           05 INVALID-DRIVER-NR-VEHICLE     PIC X(40) VALUE
              'INVALID EMPLOYEE NUMBER (VEHICLE CARD)'.

           05 OIL-AMOUNT-TOO-LARGE-N     PIC S9(5) COMP-3 VALUE +999.
           05 OIL-AMOUNT-TOO-LARGE          PIC X(40) VALUE
              'OIL AMOUNT TOO LARGE. MAX IS 99.99'.

           05 CARD-IN-USE-N                 PIC S9(5) COMP-3 VALUE +453.
           05 CARD-IN-USE                   PIC X(40) VALUE
              'CARD ALREADY IN USE, PLEASE RETRY'.

           05 SC-IN-USE-N                   PIC S9(5) COMP-3 VALUE +453.
           05 SC-IN-USE                     PIC X(40) VALUE
              'SC ALREADY IN USE, PLEASE RETRY'.

           05 WS-CC-FUNDED-CREDIT-ERR-N     PIC S9(5) COMP-3 VALUE +516.
           05 WS-CC-FUNDED-CREDIT-ERR.
              10 FILLER                     PIC X(33) VALUE
                 'CALL CREDIT, NO RECOURSE AVAIL - '.
              10 WS-CC-FUNDED-CREDIT-ACCT   PIC X(07).
              10 FILLER                     PIC X(79)  VALUE
               'IF NO CREDIT IS AVAILABLE, T/S MUST CALL TRUCK COMPANY'.


           05 WS-CC-RELATION-CREDIT-ERR-N   PIC S9(5) COMP-3 VALUE +517.
           05 WS-CC-RELATION-CREDIT-ERR.
              10 FILLER                     PIC X(40) VALUE
                 'THE T/S HAS SET A RELATIONSHIP LIMIT FOR'.
              10 FILLER                     PIC X(70) VALUE
                 'THIS TRUCK COMPANY. THIS LIMIT HAS BEEN EXCEEDED. REFE
      -          'R TO FMRM 09'.

           05 WS-CC-RELATION-CREDIT-ERR2-N  PIC S9(5) COMP-3 VALUE +519.
           05 WS-CC-RELATION-CREDIT-ERR2.
              10 FILLER                     PIC X(40) VALUE
                 'THE T/S HAS SET A RELATIONSHIP LIMIT FOR'.
              10 FILLER                     PIC X(70) VALUE
                 'THIS TRUCK COMPANY. THIS LIMIT HAS BEEN EXCEEDED. REFE
      -          'R TO FMRM 09'.

           05 WS-CC-SC-CREDIT-ERR-N         PIC S9(5) COMP-3 VALUE +518.
           05 WS-CC-SC-CREDIT-ERR.
              10 FILLER                     PIC X(40) VALUE
                 'THE T/S HAS REACHED ITS CREDIT LIMIT FOR'.
              10 FILLER                     PIC X(30) VALUE
                 'RECOURSE XTNS.  CALL CREDIT - '.
              10 WS-CC-SC-CREDIT-ACCT       PIC X(05).

           05 WS-CC-RECOURSE-SECURITY-REQ-N PIC S9(5) COMP-3 VALUE +515.
           05 WS-CC-RECOURSE-SECURITY-REQ   PIC X(100) VALUE
              'INFORM THE ATTENDANT THAT THE CUSTOMERS CREDIT HAS BEEN E
      -       'XCEEDED. RECOURSE SECURITY CARD IS REQUIRED'.

           05 SECURITY-CARD-IS-INVALID      PIC X(40) VALUE
              'SECURITY CARD IS INVALID'.
           05 SECURITY-CARD-IS-INVALID-N    PIC S9(5) COMP-3 VALUE +508.
           05 SECURITY-CARD-NOT-ACTIVE      PIC X(40) VALUE
              'SECURITY CARD IS NOT ACTIVE'.
           05 SECURITY-CARD-IS-REQUIRED     PIC X(40) VALUE
              'SECURITY CARD IS REQUIRED'.
           05 SECURITY-CARD-IS-REQUIRED-N   PIC S9(5) COMP-3 VALUE +508.

           05 SECURITY-PIN-IS-INVALID       PIC X(40) VALUE
              'SECURITY PIN IS INVALID'.
           05 SECURITY-PIN-IS-INVALID-N     PIC S9(5) COMP-3 VALUE +508.
           05 SECURITY-PIN-EXCESSIVE        PIC X(40) VALUE
              'EXCESSIVE PIN TRIES    '.
           05 SECURITY-PIN-EXCESSIVE-N      PIC S9(5) COMP-3 VALUE +591.
           05 INVALID-ATM-NETWORK           PIC X(40) VALUE
              'CARD USED ON WRONG NETWORK'.
           05 INVALID-ATM-NETWORK-N         PIC S9(5) COMP-3 VALUE +665.

           05 SETTLEMENT-DETAIL-NOT-FOUND-N PIC S9(5) COMP-3 VALUE +000.
           05 SETTLEMENT-DETAIL-NOT-FOUND   PIC X(40) VALUE
              'SETTLEMENT DETAIL NOT FOUND'.
           05 SETTLEMENT-ALREADY-PAID-N     PIC S9(5) COMP-3 VALUE +613.
           05 SETTLEMENT-ALREADY-PAID       PIC X(40) VALUE
              'TRANSACTION ALREADY PAID - ADJ REQUIRED'.
           05 UNATTENDED-CANCEL-MSG         PIC X(40) VALUE
              'AN UNATTENDED XTN CAN NOT BE CANCELLED'.
           05 CANCEL-SETTLE-MSG             PIC X(40) VALUE
              'VERIFY SETTLEMENT IS ACTIVE & PRESS PF3.'.

JS0699     05 TAX-NOT-ALLOWED-N             PIC S9(5) COMP-3 VALUE +678.
JS0699     05 TAX-NOT-ALLOWED               PIC X(40) VALUE
JS0699        'TAX AMT NOT ALLOWED.'.
JS1199     05 CARD-IS-OFF-HOURS             PIC X(40) VALUE
JS1199        'CARD IS BEING USED OFF HOURS'.
JS1199     05 CARD-IS-OFF-HOURS-N           PIC S9(5) COMP-3 VALUE +783.
JS1199     05 CARD-HAS-EXPIRED-N            PIC S9(5) COMP-3 VALUE +784.
JS1199     05 CARD-HAS-EXPIRED              PIC X(40) VALUE
JS1199        'CARD HAS EXPIRED'.
102810***** EDITS FOR ERRORS 785 - 790 MOVED TO PGM TSFMO0LP
102810***** EDITS FOR ERRORS 1146 - 1149 ADDED TO PGM TSFMO0LP
JS1199***  05 FLEET-LIMITS-NOT-AVAIL-N      PIC S9(5) COMP-3 VALUE +790.
JS1199***  05 FLEET-LIMITS-NOT-AVAIL        PIC X(40) VALUE
JS1199***     'FLEET PURCHASE NOT AVAILABLE'.
JS1199***  05 FLEET-XTN-AMT-EXCEEDED-N      PIC S9(5) COMP-3 VALUE +785.
JS1199***  05 FLEET-XTN-AMT-EXCEEDED        PIC X(40) VALUE
JS1199***     'FLEET XTN AMOUNT EXCEEDED'.
JS1199***  05 FLEET-DAY-AMT-EXCEEDED-N      PIC S9(5) COMP-3 VALUE +786.
JS1199***  05 FLEET-DAY-AMT-EXCEEDED        PIC X(40) VALUE
JS1199***     'FLEET DAILY AMOUNT EXCEEDED'.
JS1199***  05 FLEET-CYC-AMT-EXCEEDED-N      PIC S9(5) COMP-3 VALUE +787.
JS1199***  05 FLEET-CYC-AMT-EXCEEDED        PIC X(40) VALUE
JS1199***     'FLEET CYCLE AMOUNT EXCEEDED'.
JS1199***  05 FLEET-DAY-XTN-EXCEEDED-N      PIC S9(5) COMP-3 VALUE +788.
JS1199***  05 FLEET-DAY-XTN-EXCEEDED        PIC X(40) VALUE
JS1199***     'FLEET DAILY XTNS EXCEEDED'.
JS1199***  05 FLEET-CYC-XTN-EXCEEDED-N      PIC S9(5) COMP-3 VALUE +789.
JS1199***  05 FLEET-CYC-XTN-EXCEEDED        PIC X(40) VALUE
JS1199***     'FLEET CYCLE XTNS EXCEEDED'.
MP0800     05 INVALID-ATM-TRANS-N           PIC S9(5) COMP-3 VALUE +830.
MP0800     05 INVALID-ATM-TRANS             PIC X(40) VALUE
MP0800        'INVALID ATM TRANSACTION'.
MP0600     05 PETRO-CANADA-RESTRICTED-N     PIC S9(5) COMP-3 VALUE +831.
MP0600     05 PETRO-CANADA-RESTRICTED       PIC X(40) VALUE
MP0600        'CUSTOMER MAY NOT FUEL AT PETRO CANADA'.
MP0800     05 ATM-BLOCKED-CARD-N            PIC S9(5) COMP-3 VALUE +832.
MP0800     05 ATM-BLOCKED-CARD              PIC X(40) VALUE
MP0800        'ATM CARD BLOCKED'.

JS1101     05 WS-E-EXP-DATE-N           PIC 9(05) VALUE 784.
JS1101     05 WS-E-EXP-DATE             PIC X(80) VALUE
JS1101        'INVALID EXPIRATION DATE (FORMAT MMYY)'.
JS1101
JS1101     05 WS-E-EXP-DATE1-N          PIC 9(05) VALUE 784.
JS1101     05 WS-E-EXP-DATE1            PIC X(80) VALUE
JS1101        'INVALID EXPIRATION DATE (EXPIRED)'.
JS1101
JS1101     05 WS-E-EXP-DATE2-N          PIC 9(05) VALUE 784.
JS1101     05 WS-E-EXP-DATE2            PIC X(80) VALUE
JS1101        'INVALID EXPIRATION DATE (MISMATCH)'.
JS1101
JS1101     05 WS-E-EXP-DATE3-N          PIC 9(05) VALUE 784.
JS1101     05 WS-E-EXP-DATE3            PIC X(80) VALUE
JS1101        'INVALID EXPIRATION DATE (RENEWAL)'.

CP0406     05 INVALID-PROD-9-TYPE          PIC S9(5) COMP-3 VALUE +1086.
CC0502     05 INVALID-PROD-9-TYPE-MSG       PIC X(40) VALUE
CC0502        'INVALID PRODUCT 9 TYPE'.

CP0406     05 INVALID-OTHER-FUEL-TYPE      PIC S9(5) COMP-3 VALUE +1087.
CC0502     05 INVALID-OTHER-FUEL-TYPE-MSG   PIC X(40) VALUE
CC0502        'INVALID OTHER FUEL TYPE'.

CP0406     05 OTHER-FUEL-TYPE-REQUIRED     PIC S9(5) COMP-3 VALUE +1079.
CP0406     05 OTHER-FUEL-TYPE-REQUIRED-MSG PIC X(40) VALUE
CP0406        'OTHER FUEL PROD CODE REQUIRED'.

CP0406     05 INVALID-REEFER-SUB-PROD      PIC S9(5) COMP-3 VALUE +1080.
CP0406     05 INVALID-REEFER-SUB-PROD-MSG  PIC X(40) VALUE
CP0406        'INVALID REEFER SUB PROD CODE'.

CP0406     05 REEFER-SUB-PROD-REQUIRED     PIC S9(5) COMP-3 VALUE +1081.
CP0406     05 REEFER-SUB-PROD-REQUIRED-MSG PIC X(40) VALUE
CP0406        'REEFER SUB PROD CODE REQUIRED'.

CP0406     05 INVALID-NR1-SUB-PROD         PIC S9(5) COMP-3 VALUE +1082.
CP0406     05 INVALID-NR1-SUB-PROD-MSG     PIC X(40) VALUE
CP0406        'INVALID NR1 DIESEL SUB PROD CODE'.

CP0406     05 NR1-SUB-PROD-REQUIRED        PIC S9(5) COMP-3 VALUE +1083.
CP0406     05 NR1-SUB-PROD-REQUIRED-MSG    PIC X(40) VALUE
CP0406        'NR1 DIESEL SUB PROD CODE REQUIRED'.

CP0406     05 INVALID-NR2-SUB-PROD         PIC S9(5) COMP-3 VALUE +1084.
CP0406     05 INVALID-NR2-SUB-PROD-MSG     PIC X(40) VALUE
CP0406        'INVALID NR2 DIESEL SUB PROD CODE'.

CP0406     05 NR2-SUB-PROD-REQUIRED        PIC S9(5) COMP-3 VALUE +1085.
CP0406     05 NR2-SUB-PROD-REQUIRED-MSG    PIC X(40) VALUE
CP0406        'NR2 DIESEL SUB PROD CODE REQUIRED'.

040606     05 NR2-FUEL-NOT-ALLOWED-N       PIC S9(5) COMP-3 VALUE +1078.
040606     05 NR2-FUEL-NOT-ALLOWED         PIC X(40) VALUE
040606        'NR2 FUEL NOT ALLOWED THIS COMPANY'.

080210     05 WS-E-IRIS-DENIED-N           PIC S9(5) COMP-3 VALUE +1100.
080210     05 WS-E-IRIS-DENIED             PIC X(80) VALUE
080210        'TRANSACTION DENIED - PLEASE CALL YOUR COMPANY'.

021908     05 INACTIVE-NODE-ID-N           PIC S9(5) COMP-3 VALUE +1103.
021908     05 INACTIVE-NODE-ID             PIC X(40) VALUE
021908        'INACTIVE NODE ID FOR THIS CARD   '.

021908     05 NODE-ID-NOT-FOUND-N          PIC S9(5) COMP-3 VALUE +1104.
021908     05 NODE-ID-NOT-FOUND            PIC X(40) VALUE
021908        'NODE ID NOT FOUND FOR THIS CARD  '.

021908     05 HIER-ID-NOT-FOUND-N          PIC S9(5) COMP-3 VALUE +1105.
021908     05 HIER-ID-NOT-FOUND            PIC X(40) VALUE
021908        'HIERARCHY ID NOT FOUND FOR THIS CARD  '.

072811     05 INVALID-CARD-CNTRY-CD-N      PIC S9(5) COMP-3 VALUE +1161.
072811     05 INVALID-CARD-CNTRY-CD        PIC X(40) VALUE
072811        'INVALID CARD FOR COUNTRY CODE'.

041112     05 INVALID-RFID-NBR-N           PIC S9(5) COMP-3 VALUE +1187.
041112     05 INVALID-RFID-NBR             PIC X(40) VALUE
041112        'RFID TAG NOT FOUND, PLEASE SWIPE CARD'.

SB0614     05 SURCHARGE-LOCATION-ERR-N     PIC S9(5) COMP-3 VALUE +1298.
SB0614     05 SURCHARGE-LOCATION-ERR       PIC X(40) VALUE
SB0614        'TRANS EXCEEDS 2 PRODUCTS @ SURCHARGE LOC'.

           02 FIELD-LENGTH         PIC S99 COMP SYNC VALUE +0.

      *----------------------------------------------------------------*
      *    LETTER TRANSLATION TABLES                                   *
      *----------------------------------------------------------------*

         01 TAB-LTR.
      *  DATA FORMAT IS  LTR/DRVN PTR
           03 TAB-A                PIC X(3) VALUE 'A01'.
           03 TAB-B                PIC X(3) VALUE 'B02'.
           03 TAB-C                PIC X(3) VALUE 'C03'.
           03 TAB-D                PIC X(3) VALUE 'D04'.
           03 TAB-E                PIC X(3) VALUE 'E05'.
           03 TAB-F                PIC X(3) VALUE 'F06'.
           03 TAB-G                PIC X(3) VALUE 'G07'.
           03 TAB-H                PIC X(3) VALUE 'H08'.
           03 TAB-I                PIC X(3) VALUE 'I09'.
           03 TAB-J                PIC X(3) VALUE 'J10'.
           03 TAB-K                PIC X(3) VALUE 'K11'.
           03 TAB-L                PIC X(3) VALUE 'L12'.
           03 TAB-M                PIC X(3) VALUE 'M13'.
           03 TAB-N                PIC X(3) VALUE 'N14'.
           03 TAB-O                PIC X(3) VALUE 'O15'.
           03 TAB-P                PIC X(3) VALUE 'P16'.
           03 TAB-Q                PIC X(3) VALUE 'Q17'.
           03 TAB-R                PIC X(3) VALUE 'R18'.
           03 TAB-S                PIC X(3) VALUE 'S19'.
           03 TAB-T                PIC X(3) VALUE 'T20'.
           03 TAB-U                PIC X(3) VALUE 'U21'.
           03 TAB-V                PIC X(3) VALUE 'V22'.
           03 TAB-W                PIC X(3) VALUE 'W23'.
           03 TAB-X                PIC X(3) VALUE 'X24'.
           03 TAB-Y                PIC X(3) VALUE 'Y25'.
           03 TAB-Z                PIC X(3) VALUE 'Z26'.

         01 TAB-LTR-R REDEFINES TAB-LTR.
           03 TABLTR               OCCURS 26 TIMES INDEXED BY LTR-INDX.
             05 LTR-SRCH           PIC X.
             05 TABNBR             PIC 99.

         01 DATA-CAPTURE-TABLE.
           03 FILLER               PIC X(10) VALUE '06155SPEC'.
           03 FILLER               PIC X(10) VALUE '02077SPEC'.
           03 FILLER               PIC X(10) VALUE HIGH-VALUES.
         01 DATA-CAPTURE-TABLE-R   REDEFINES DATA-CAPTURE-TABLE.
           03 DCT-ENTRY            OCCURS 3 TIMES
                                   INDEXED BY DCT-INDX.
              05 DCT-FUEL-CODE     PIC X(5).
              05 DCT-FUEL-TYPE     PIC X(5).

       01  FILLER.
      **** (RELATIONSHIP-MANAGEMENT-FLDS) ****
           02  WS-LIMITED-NETWORK-PRODUCTS.
               03  WS-PUR-OPTIONS.
                   04  WS-PUR-OPT-AREA     PIC X OCCURS 3 TIMES.
               03  WS-PROD-OPT-AREA        PIC X(36).
           02  WS-DIRECT-BILL-PRODUCTS.
               03  WS-DB-PRODUCTS          PIC X(36).
               03  WS-DB-PURCHASE          PIC X OCCURS 3 TIMES.
           02  RMR-FOUND-SW                PIC 9        VALUE 0.
               88  RMR-RECORD-FOUND                     VALUE 1.
           02  RMR-CREDIT-SW               PIC 9        VALUE 0.
           02  RMR-MASTER-CODE-1           PIC 9(4).
           02  RMR-MASTER-CODE-2           PIC 9(5).
           02  CONTINUE-WORK-FIELDS.
              05  CONTINUE-NETWORK-READ-SW    PIC 9        VALUE 0.
                  88  CONTINUE-NETWORK-READ                VALUE 0.
              05  CONTINUE-DIRECT-BILLING-SW  PIC 9        VALUE 0.
                  88  CONTINUE-DIRECT-BILLING              VALUE 0.
              05  CONTINUE-MAXIMUM-GALLONS-SW PIC 9        VALUE 0.
                  88  CONTINUE-MAXIMUM-GALLONS             VALUE 0.
              05  CONTINUE-CUSTOM-FEE-SW PIC 9             VALUE 0.
                  88  CONTINUE-CUSTOM-FEE                  VALUE 0.
              05  CONTINUE-BRIDGE-CUSTOMER-SW PIC 9        VALUE 0.
                  88  CONTINUE-BRIDGE-CUSTOMER             VALUE 0.
              05  CONTINUE-COMDATA-COMPLETE-SW PIC 9       VALUE 0.
                  88  CONTINUE-COMDATA-COMPLETE            VALUE 0.
              05  CONTINUE-NEG-PRICE-SW       PIC 9        VALUE 0.
                  88  CONTINUE-NEG-PRICE                   VALUE 0.
              05  CONTINUE-BULK-FUEL-SW       PIC 9        VALUE 0.
                  88  CONTINUE-BULK-FUEL                   VALUE 0.
              05  CONTINUE-COST-PLUS-SW       PIC 9        VALUE 0.
                  88  CONTINUE-COST-PLUS                   VALUE 0.
              05  CONTINUE-TERM-FUEL-SW       PIC 9        VALUE 0.
                  88  CONTINUE-TERM-FUEL                   VALUE 0.
              05  CONTINUE-SPECIAL-SETTLEMENT-SW PIC 9     VALUE 0.
                  88  CONTINUE-SPECIAL-SETTLEMENT          VALUE 0.
              05  CONTINUE-KEYED-CARD-SW      PIC 9        VALUE 0.
                  88  CONTINUE-KEYED-CARD                  VALUE 0.
              05  CONTINUE-COMFUEL-SW         PIC 9        VALUE 0.
                  88  CONTINUE-COMFUEL                     VALUE 0.
091411        05  CONTINUE-NET-PRICING-SW     PIC 9        VALUE 0.
091411            88  CONTINUE-NET-PRICING                 VALUE 0.
SB0513        05  CONTINUE-MAX-GALLONS-RFR-SW PIC 9        VALUE 0.
SB0513            88  CONTINUE-MAX-GALLONS-RFR             VALUE 0.
SB0513        05  CONTINUE-MAX-GALLONS-OTH-SW PIC 9        VALUE 0.
SB0513            88  CONTINUE-MAX-GALLONS-OTH             VALUE 0.
DR0317
DR0317* WS-PRICING-FILE-AREA
DR0422     COPY TSFMW260 IN CPYREL.

           COPY DFHAID.
           COPY DFHBMSCA.

      *------------------------------
      * WORK DFHCOMMAREA.
      *------------------------------
BW0211 01  WS-DFHCOMMAREA.
           05 FILLER                    PIC X(01) OCCURS 2500 TIMES
                                              DEPENDING ON EIBCALEN.
      *------------------------------
        LINKAGE SECTION.
      *------------------------------
BW0211 01  DFHCOMMAREA.
           05 FILLER                    PIC X(01) OCCURS 2500 TIMES
                                              DEPENDING ON EIBCALEN.
      *==============================
       PROCEDURE DIVISION.
      *==============================
           PERFORM 00100-STARTUP
           PERFORM 00200-CHECK-FOR-POS.

      **** (RECEIVE THE SCREEN INTO THE UNFORMATTED AREA) ****
           PERFORM 00300-GET-INFO-TO-PROCESS.
           PERFORM 00310-CHECK-FOR-STORE-REQ.

      **** (SETUP THE COMMON AREA) ****
           MOVE DFHCOMMAREA    TO WS-DFHCOMMAREA
           MOVE WS-DFHCOMMAREA TO FP-COMMON-AREA

CP1098     PERFORM 00320-CHECK-ADJ-OVERRIDE.

      **** (CHECK FOR FIRST TIME INTO PROGRAM) ****
           IF EIBCALEN = ZEROES
              PERFORM 01000-FIRST-TIME
           END-IF

      **** (SEE WHICH SCREEN USER IS ON                      ) ****
      **** (COM-STAGE = 1 IS ON 1ST ENTRY SCREEN             ) ****
      **** (COM-STAGE = 2 IS ON THE MAIN ENTRY SCREEN        ) ****
      **** (COM-STAGE = 3 IS ON THE TEMP CODE ENTRY SCREEN   ) ****
      **** (COM-STAGE = 500 ENTER PRESSED AFTER COMPLETED XTN) ****
           EVALUATE COM-STAGE
              WHEN +1
                 PERFORM PROCESS-INITIAL-MAP
                 PERFORM FP-0000
              WHEN +2
                 MOVE 'Y' TO WS-LOOP-FP-0100
                 PERFORM FP-0100
                    UNTIL WS-LOOP-FP-0100 = 'N'
              WHEN +3
                 PERFORM TN999-UNKNOWN-STOP
                 PERFORM FP-0000
              WHEN 500
                 MOVE SPACES TO UNFORMATTED-AREA
                 PERFORM 01000-FIRST-TIME
                 PERFORM FP-0000
           END-EVALUATE.

           PERFORM FP-PROGRAM-LOGIC-ERROR.

      *===============================
       FP-PROGRAM-LOGIC-ERROR.
      *===============================
DR0422     MOVE 'FP-PROGRAM-LOGIC-ERROR'    TO CXUTS0ML-PARAGRAPH.
           MOVE 'PROGRAM LOGIC ERROR - 1A' TO UNFORMATTED-AREA
           EXEC CICS SEND
                FROM   (UNFORMATTED-AREA)
                LENGTH (80)
                ERASE
           END-EXEC
           PERFORM CHECK-FOR-NORMAL-EIBRESP
           PERFORM EXEC-CICS-RETURN.

      *=================================
       00100-STARTUP.
      *=================================
           PERFORM CHECK-FOR-STANDIN.
           PERFORM COPY-CXISP001.
           PERFORM 90010-GET-SYSTEM-DATE.
           PERFORM 90015-GET-CURRENT-DATE.
           PERFORM ORDRFIL-RECD-INIT THRU ORINIT-9999
           IF OPACSFL-SUFFIX NOT = SPACES
              MOVE OPACSFL-SUFFIX TO OPACSFL-SFX
           END-IF
           MOVE FF-PERCENTAGES TO SAVE-PCTUP.

      **** (THE FOLLOWING INIT IS TO PREVENT ASRA ABENDS) ****
JS1199     INITIALIZE FUEL-MANAGEMENT-DAILY-LOG-RECD.
JS0503     INITIALIZE WS-USER-INPUT-WORK-AREA.
JS0206     INITIALIZE WS-PRD-FEE-SC-WORK-AREA.
MP0606     INITIALIZE WS-SUB-PROD-WORK-FIELDS.
SB0814     INITIALIZE CANADIAN-TAX-LINK-AREA.
BG0418     INITIALIZE WS-DNET-CP-COMPONENTS(1).
BG0418     INITIALIZE WS-DNET-CP-COMPONENTS(2).
BG0418     INITIALIZE WS-DNET-CP-COMPONENTS(3).
BG0418     INITIALIZE WS-DNET-CP-COMPONENTS(4).
PJ0122     INITIALIZE WS-PD-PROD-DISC-INFO(1).
PJ0122     INITIALIZE WS-PD-PROD-DISC-INFO(2).
PJ0122     INITIALIZE WS-PD-PROD-DISC-INFO(3).
PJ0122     INITIALIZE WS-PD-PROD-DISC-INFO(4).

      *=================================
       00200-CHECK-FOR-POS.
      *=================================
      **** (CHECK FOR POS OR SETTLEMENT REQUEST) ****
           IF EIBTRNID = 'POS'  OR
                         'FMSS' OR
                         'FMST' OR
                         'PS32' OR
                         'PSNR' OR
MP0398                   'PSNC' OR
                         'XCAT' OR
                         'PS42' OR
MP0903                   'PS51' OR
MP0303                   'PS92' OR
                         'ITP2' OR
JS1199                   'XCMP' OR
JS1002                   'MCMP' OR
MP1001                   'FMED' OR
CC0502                   'FMBP' OR
MP0303                   'PSA1' OR
CC0803                   'FMMP' OR
MP0105                   'PSD1' OR
CP0207                   'ITTF' OR
ED0914        EIBTRNID (1:2) = 'RS' OR
ED0914        EIBTRNID (1:2) = 'WS'
              MOVE 'Y'                    TO WS-POS-FLAG
              MOVE DFHCOMMAREA            TO WS-DFHCOMMAREA
              MOVE WS-DFHCOMMAREA         TO UNFORMATTED-AREA
              PERFORM FORMAT-INPUT-AREA
      ******** 'TEMPORARILY' COMMENTED OUT ON 5/10/2012
041112********PERFORM CHK-RFID-LAST-USE-FLDS
              MOVE INP-SETTLE-PRINTER-FLAG TO WS-SAVE-PRINTER-FLAG
              PERFORM 01000-FIRST-TIME
              MOVE 'Y' TO WS-LOOP-FP-0100
              PERFORM FP-0100
                 UNTIL WS-LOOP-FP-0100 = 'N'
              PERFORM FP-PROGRAM-LOGIC-ERROR
           END-IF.

      *=================================
       00300-GET-INFO-TO-PROCESS.
      *=================================
DR0422     MOVE '00300-GET-INFO-TO-PROCESS' TO CXUTS0ML-PARAGRAPH.
           MOVE SPACES TO UNFORMATTED-AREA
           MOVE 3270-SBA-1 TO 3270-SBA
           MOVE LOW-VALUES TO 3270-SBA-1
           MOVE LOW-VALUES TO FP2MAPO, FPMAP1O, FPMAPBO.

           IF INITIATED-VIA-START
              EXEC CICS RETRIEVE
                   INTO   (UNFORMATTED-AREA)
                   LENGTH (LEN)
                   RESP   (EIBRESP)
              END-EXEC
              PERFORM CHECK-FOR-NORMAL-EIBRESP
           ELSE
              IF WS-POS-FLAG NOT = 'Y'
                 EXEC CICS RECEIVE
                      INTO   (UNFORMATTED-AREA)
                      LENGTH (UNFORMATTED-LENG)
                      RESP   (EIBRESP)
                 END-EXEC
                 PERFORM CHECK-FOR-NORMAL-EIBRESP
              END-IF
           END-IF
           IF EIBCALEN = ZEROES
              IF UNFORMATTED-AREA (1:2) NOT = 'FP'
                 MOVE UNFORMATTED-AREA (4: ) TO WS-WORK-FIELD
                 MOVE WS-WORK-FIELD          TO UNFORMATTED-AREA
              END-IF
JS0503        PERFORM FORMAT-INPUT-AREA
           END-IF.

      *=================================
       00310-CHECK-FOR-STORE-REQ.
      *=================================
           IF NOT THIS-BE-A-RESTORE-REQUEST
              EXEC CICS DELETEQ TS
                   QUEUE (QUEUE-ID-AREA)
                   RESP  (EIBRESP)
              END-EXEC.

           IF EIBCALEN > ZEROES AND
              EIBAID = DFHPF6
              MOVE EIBTRMID TO QID-TRMID
              EXEC CICS DELETEQ TS
                   QUEUE (QUEUE-ID-AREA)
                   RESP  (EIBRESP)
              END-EXEC
              MOVE DFHCOMMAREA      TO WS-DFHCOMMAREA
              MOVE WS-DFHCOMMAREA   TO WS-Q-COMMAREA
              MOVE UNFORMATTED-AREA TO WS-Q-UNFORMATTED
              MOVE LEN              TO WS-Q-MAPLEN
              EXEC CICS WRITEQ TS
                   FROM   (WS-Q-AREA)
                   QUEUE  (QUEUE-ID-AREA)
092009             LENGTH (LENGTH OF WS-Q-AREA)
                   ITEM   (WS-ITEM)
              END-EXEC
              MOVE 'XTN SAVED, KEY "FP =" TO RESTORE' TO OUT-COMENT
              EXEC CICS SEND
                   FROM (OUT-COMENT)
                   LENGTH (32)
                   ERASE
              END-EXEC
              PERFORM EXEC-CICS-RETURN.

CP1098*=================================
 " "   00320-CHECK-ADJ-OVERRIDE.
 " "  *=================================
 " "       IF EIBCALEN > ZEROES AND
 " "          EIBAID = DFHPF4   AND
 " "          COM-ADJ-OVERRIDE-FL = 'N'
 " "             MOVE 'Y' TO COM-ADJ-OVERRIDE-FL
 " "             PERFORM PROCESS-INITIAL-MAP
 " "             PERFORM FP-0000.

      *=================================
       01000-FIRST-TIME.
      *=================================
           INITIALIZE FP-COMMON-AREA.
091614     MOVE WS-DEFAULT-MAX-QTY TO COM-MAXIMUM-GALLONS
091614                                COM-MAX-RFR-GALLONS
091614                                COM-MAX-OTH-GALLONS
091614                                COM-RMR-MAXIMUM-GALLONS
091614                                COM-RMR-MAX-RFR-GALLONS
091614                                COM-RMR-MAX-OTH-GALLONS
091614                                COM-MAX-NR2-GALLONS
091614                                COM-MAX-NR1-GALLONS.

           MOVE SAVE-OPERATOR-INFO TO COM-OPERATOR-INFO.
           EVALUATE TRUE
              WHEN FPM-REBUILD
                   MOVE 'N' TO NON-PROD-FLAG
                   PERFORM FP-7000
              WHEN FPM-OPEN
                   MOVE 'N' TO NON-PROD-FLAG
                   PERFORM FP-7000
              WHEN THIS-IS-A-CANCEL-REQ
                   MOVE 'N' TO NON-PROD-FLAG
                   PERFORM FP-5000
              WHEN THIS-BE-A-CANCEL-REQUEST
                   MOVE 'N'                TO NON-PROD-FLAG
                   MOVE INP-CANCEL-AREA    TO WS-CANCEL-AREA
                   MOVE 'Y'                TO WS-PC-CANCEL-FLAG
                   MOVE SPACES             TO WS-INP-FP-CANCEL
                   MOVE 'CANCEL'           TO FP-CANCEL-REQ
MB1012             IF WS-CANCEL-CARD-NR > SPACES AND
MB1012                WS-CANCEL-CARD-NR NOT NUMERIC
MB1012                MOVE WS-CANCEL-CARD-NR  TO WS-UIWA-CRD-TOKEN
MB1012                PERFORM FIA-GET-CARD-NBR-FROM-TOKEN
MB1012                IF WS-UIWA-CARD-NR NUMERIC
MB1012                   MOVE WS-UIWA-CARD-NR-10 TO FP-CANCEL-COMMON
MB1012                ELSE
MB1012                   MOVE ZEROES             TO FP-CANCEL-COMMON
MB1012                END-IF
MB1012             ELSE
                      MOVE WS-CANCEL-CARD-NR  TO FP-CANCEL-COMMON
MB1012             END-IF
CP1011             IF WS-CNL-TRANS-NR-N NUMERIC
CP1011                MOVE WS-CNL-TRANS-NR-N TO FPCR-CTL-7
CP1011                MOVE FP-CANCEL-COMMON  TO FPCR-CTL7-CARD
CP1011             ELSE
CP1011                MOVE WS-CNL-TRANS-NR-6 TO FPCR-CTL-6X
CP1011                MOVE FP-CANCEL-COMMON  TO FPCR-CTL6-CARD
CP1011             END-IF
                   PERFORM FP-5000
              WHEN THIS-BE-AN-ATM-CANCEL
                   PERFORM FP-ATM-CANCEL
              WHEN THIS-BE-A-SETTLEMENT-REQUEST
                   MOVE 'N'                   TO NON-PROD-FLAG
                   MOVE INP-SETTLE-TS-CODE    TO WS-UIWA-SC-CODE
                   MOVE INP-SETTLE-TS-CODE    TO COM-FP-SC-CODE
                   PERFORM SETTLEMENT-REQUEST
                   MOVE SETTLE-NOT-POSSIBLE   TO OUT-COMENT-1
                   IF ERROR-FLAG = 'S'
                      MOVE 'USE FMST 01'      TO OUT-COMENT-1
                   END-IF
                   MOVE SETTLE-NOT-POSSIBLE-N TO POS-ERROR-NUMBER
ED0810             MOVE 'N'                   TO WS-NOTIFY-IRIS-FL
                   PERFORM EXIT-FUEL-PGM-MAIN-SCREEN
              WHEN THIS-BE-A-RESTORE-REQUEST
                   PERFORM PROCESS-RESTORE-REQUEST
              WHEN OTHER
                   PERFORM FP-0000
           END-EVALUATE.

      *====================================
       PROCESS-RESTORE-REQUEST.
      *====================================
           MOVE EIBTRMID TO QID-TRMID
           EXEC CICS READQ TS
                QUEUE  (QUEUE-ID-AREA)
                INTO   (WS-Q-AREA)
092009          LENGTH (LENGTH OF WS-Q-AREA)
                ITEM   (WS-ITEM)
                RESP   (EIBRESP)
           END-EXEC
           IF EIBRESP NOT = DFHRESP(NORMAL)
              MOVE 'NO SAVED DATA - RESTORE TERMINATED' TO OUT-COMENT
              EXEC CICS SEND
                   FROM   (OUT-COMENT)
                   LENGTH (40)
                   ERASE
                   RESP   (EIBRESP)
              END-EXEC
              PERFORM EXEC-CICS-RETURN.

           MOVE 'Y' TO WS-THIS-BE-A-RESTORE
JS0604     MOVE 1090 TO EIBCALEN
           EXEC CICS DELETEQ TS
                QUEUE (QUEUE-ID-AREA)
                RESP  (EIBRESP)
           END-EXEC
           MOVE WS-Q-COMMAREA    TO FP-COMMON-AREA
           MOVE WS-Q-UNFORMATTED TO UNFORMATTED-AREA
082008     MOVE +1200            TO UNFORMATTED-LENG
           MOVE WS-Q-MAPLEN      TO LEN
           IF COM-STAGE = 1
              PERFORM PROCESS-INITIAL-MAP
              PERFORM FP-0000
           ELSE
              MOVE 'Y' TO WS-LOOP-FP-0100
              PERFORM FP-0100
                 UNTIL WS-LOOP-FP-0100 = 'N'.

      *====================================
       FP-0000.
      *====================================
           PERFORM 10100-CHECK-FOR-EXIT.
           IF THIS-BE-A-PC-REQUEST
              PERFORM SETUP-PC-REQUEST
           ELSE
              PERFORM FP-0000-PROCESS-ENTRY
           END-IF.

      *====================================
       FP-0000-PROCESS-ENTRY.
      *====================================
      **** (IF NOT 1ST TIME AND THE CARD NR HAS NOT CHANGED) ****
      **** (SKIP THE CARD NUMBER FORMAT ROUTINE            ) ****
           IF COM-STAGE      = +1 AND
              ERROR-FLAG NOT = 'F'
              CONTINUE
           ELSE
              PERFORM 10200-FORMAT-CARD-NUMBER
           END-IF

      **** (ASSUME ALL SERVICE AVAILABLE) ****
JS0604     MOVE '1' TO COM-PUR-OPTIONS-FUEL,
JS0604                 COM-PUR-OPTIONS-OIL,
JS0604                 COM-PUR-OPTIONS-CASH,
JS0604                 COM-PUR-OPTIONS-PROD.
           MOVE '0' TO COM-PO-REQUIRED-FOR-FUEL
                       COM-PO-REQUIRED-FOR-OIL
                       COM-PO-REQUIRED-FOR-CASH
                       COM-PO-REQUIRED-FOR-PROD.
           MOVE ALL 'I' TO COM-PROD-OPT-AREA.

      **** (SETUP MISC STUFF) ****
CP0807     MOVE WS-ID-NR    TO COM-FP-ID-NR.
           MOVE INP-CO-CODE TO COM-FP-CO-CODE.
           MOVE SPACES      TO COM-PRM-NETWORKING
           MOVE ALL ZEROS   TO COM-DIRECT-BILL-CONTROL.

      **** (PROCESS THE SERVICE CENTER INFO) ****
           PERFORM 10300-SEE-IF-TEMP-SC-KEYED.
           PERFORM 10310-CHECK-FOR-INVALID-SC.
           PERFORM 10320-CHECK-FOR-CASH-ONLY-SC.
           PERFORM 10330-CHECK-FOR-UNKNOWN-SC.
           PERFORM 10340-READ-SCMSTR.

      **** (PROCESS THE OTHER INFORMATION) ****
           IF COM-STAGE = ZEROES
              CONTINUE
           ELSE
              PERFORM READ-CDNCUST
              PERFORM 10410-VALIDATE-UNIT-DATA
              PERFORM 10420-VALIDATE-MAX-PURC
              PERFORM 10430-VALIDATE-TRIP-ALLOW
              PERFORM 10440-VALIDATE-EXP-BALANCE
              PERFORM 10450-VALIDATE-CARD-PURC
              PERFORM 10500-CHECK-FOR-MNX-XTN
              PERFORM 10600-GET-NETWORK-BY-CARD-INFO
              PERFORM 10610-GET-NETWORK-INFO
              PERFORM 10620-CHECK-NETWORK-ERROR
              PERFORM 10630-CHECK-CARD-OFFNET-USED
062209***** THIS CHK NO LONGER DONE HERE; DO NOT YET KNOW
062209***** WHAT WAS PURCHASED
062209*****   PERFORM TIME-LIMIT-CHECK
              PERFORM 10700-CHECK-FOR-TERM-FUEL
JS0798        PERFORM 10710-CHECK-FOR-CREDIT-LOC
              PERFORM 10750-CHECK-CREDIT-HARD-HALT
              PERFORM 10800-CHECK-CREDIT
              PERFORM 10850-CHECK-FOR-FDIS-CARD
           END-IF.
           PERFORM 10900-SETUP-SEND-INITIAL-SCN.
           PERFORM 11000-VALIDATE-PHONE-NR.
           PERFORM 11100-CHECK-IF-OIL-AVAIL.
           PERFORM 11200-CHECK-IF-CASH-AVAIL1.
           PERFORM 11300-CHECK-IF-CASH-AVAIL2.
           PERFORM 11400-CHECK-IF-CASH-ONLY-SC.
           PERFORM 11500-CHECK-FOR-PO-OVERRIDE.
           PERFORM 11550-CHECK-CARD-OFFNET.
           PERFORM 11600-CHECK-IF-PURCH-AVAIL.

           PERFORM 12000-SETUP-MAIN-SCRN-NAME.
           PERFORM 12000-SETUP-MAIN-SCRN-OTHER.
           PERFORM SETUP-SEND-MAIN-ENTRY-SCREEN.
           PERFORM EXIT-FUEL-PGM-INITIAL-SCREEN.

      *------------------------------
       10100-CHECK-FOR-EXIT.
      *------------------------------
           IF EIBAID = DFHCLEAR OR DFHPA1 OR DFHPA2 OR DFHPA3
              IF NOT INITIATED-VIA-START
                 PERFORM CLEAR-AND-EXIT-TO-CICS
              END-IF
           END-IF.

      *-------------------------------
       10200-FORMAT-CARD-NUMBER.
      *-------------------------------
CP0807** VARIABLES CHANGED AND GOLD CARD LOGIC REMOVED FOR FPMASTR **
CP0807** REPLACEMENT                                               **
CP0807     MOVE WS-UIWA-SC-CODE                TO FP1TSCDI.
CP0807     MOVE WS-UIWA-SC-PHONE               TO FP1PHNI.

CP0807     IF WS-UIWA-CARD-NR-16 NOT NUMERIC
CP0807        MOVE ZEROS                       TO WS-UIWA-CARD-NR-16
CP0807     END-IF.

CP0807     MOVE WS-UIWA-CARD-NR-16             TO WS-PRM-CARD
CP0807*    MOVE WS-UIWA-CARD-NR-16 (7:)        TO FP1CARDI
CP0807*                                           COM-PREVIOUS-CARD
AA0921     MOVE WS-UIWA-CARD-NR-16             TO FP1CARDI
AA0921                                            COM-PREVIOUS-CARD.
CP0807     PERFORM PREMIER-INITIAL-INTERFACE THRU PII-9999.

      *------------------------------
       10300-SEE-IF-TEMP-SC-KEYED.
      *------------------------------
      **** (ENSURE A TEMP CODE WAS NOT KEYED IN) ****
           IF COM-STAGE = ZERO AND
              FP1TSCDI  > 'XT999'
              MOVE TS-IS-INVALID-N  TO POS-ERROR-NUMBER
              MOVE YCODE-IS-INVALID TO OUT-COMENT
              PERFORM EXIT-FUEL-PGM-INITIAL-SCREEN
           END-IF.

      **** (SEE IF COMING FROM THE TEMP CODE SCREEN) ****
           IF COM-STAGE = 999
              MOVE COM-FP-SC-CODE TO WS-UIWA-SC-CODE,  FP1TSCDI
              MOVE COM-PHONE-1    TO WS-UIWA-SC-PHONE, FP1PHNI
              MOVE 0 TO COM-STAGE
           END-IF.

      *------------------------------------
       10310-CHECK-FOR-INVALID-SC.
      *------------------------------------
           IF WS-UIWA-SC-CODE = SPACES  OR
              WS-UIWA-SC-CODE = 'TN000' OR
              WS-UIWA-SC-CODE = 'TN225'
              MOVE TS-IS-INVALID   TO OUT-COMENT
              MOVE TS-IS-INVALID-N TO POS-ERROR-NUMBER
              PERFORM EXIT-FUEL-PGM-INITIAL-SCREEN
           END-IF.

      *------------------------------------
       10320-CHECK-FOR-CASH-ONLY-SC.
      *------------------------------------
           MOVE WS-UIWA-SC-CODE TO SCMSTR-KEY,
                                   COM-FP-SC-CODE.

      **** (IF LOCATION IS ??000 - TURN OFF FUEL/OIL) ****
           IF SCM-KEY-NUM = '000' OR
              SCMSTR-KEY  = 'TN333'
JS0604        MOVE '0' TO COM-PUR-OPTIONS-FUEL,
JS0604                    COM-PUR-OPTIONS-OIL
           END-IF.

      **** (SEE IF CASH IS ALLOWED AT NON COMCHEK LOCATIONS) ****
           IF CDN-RESTRICT-CASH-LOCATIONS = 'Y'
              IF SCM-KEY-NUM = '000'   OR
                 SCM-KEY-NUM = '999'   OR
                 SCMSTR-KEY  = 'TN333' OR
                 SCMSTR-KEY  = 'CN225' OR
                 SCMSTR-KEY  = 'US225' OR
                 SCMSTR-KEY  > 'XT999'
JS0604           MOVE '0' TO COM-PUR-OPTIONS-CASH.

      *------------------------------------
       10330-CHECK-FOR-UNKNOWN-SC.
      *------------------------------------
      **** (SEND PHONE NUMBER SCREEN IF LOCATION IS ??999) ****
           IF SCM-KEY-NUM = '999'   OR
              SCMSTR-KEY  = 'CN225' OR
              SCMSTR-KEY  = 'US225'
              PERFORM TN999-SETUP-INITIAL-MAP
           END-IF.

      *------------------------------------
       10340-READ-SCMSTR.
      *------------------------------------
DR0422     MOVE '10340-READ-SCMSTR'         TO CXUTS0ML-PARAGRAPH.

           EXEC CICS READ
                DATASET ('SCMSTR')
                INTO    (SERVICE-CENTER-MASTER-RECORD)
                RIDFLD  (SCMSTR-KEY)
                RESP    (EIBRESP)
           END-EXEC
DR0422     MOVE SCMSTR-KEY        TO CXUTS0ML-COMMAND
           PERFORM CHECK-FOR-NOTFND-EIBRESP
           IF EIBRESP = DFHRESP(NOTFND)
              MOVE TS-IS-INVALID   TO OUT-COMENT
              MOVE TS-IS-INVALID-N TO POS-ERROR-NUMBER
              PERFORM EXIT-FUEL-PGM-INITIAL-SCREEN
           END-IF
           MOVE SCMSTR-KEY TO WS-LAST-SCMM-READ
           PERFORM 60200-CHECK-SCMSTR-NUMERICS
           MOVE SCM-KEY    TO  SCMSTR-KEY.

      **** (BE SURE LOCATION IS ACTIVE) ****
           IF SCM-STATUS IS NOT = 'A'
              MOVE INACTIVE-LOCATION   TO OUT-COMENT
              MOVE INACTIVE-LOCATION-N TO POS-ERROR-NUMBER
              PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN
           END-IF.
           MOVE SCM-PHONE-NUMBER       TO  COM-PHONE-1.
           MOVE SCM-LOCATION-NAME      TO  COM-TS-NAME, FP1TSNMO.
           IF (SCM-KEY-NUM = '000' OR SCM-KEY = 'TN333') AND
              (COM-TS-STATE NOT = '??')
              NEXT SENTENCE
           ELSE
              MOVE SCM-LOCATION-CITY      TO  COM-TS-CITY
              MOVE SCM-LOCATION-STATE     TO  COM-TS-STATE.
           MOVE COM-TS-CITY               TO FP1TSCTO.
           MOVE SCM-MANUAL-CALL-FEE       TO COM-SCM-MANUAL-CALL-FEE
           MOVE SCM-AUTOMATED-CALL-FEE    TO COM-SCM-AUTO-CALL-FEE.

           MOVE SCM-PREMIER-LEVEL TO COM-PREMIER-LEVEL.
           IF SCM-PREMIER-LEVEL < '1' OR
              SCM-PREMIER-LEVEL > '5'
              MOVE '1' TO COM-PREMIER-LEVEL
           END-IF.

      *---------------------------
JS0206 10345-READ-PRDSCMM.
      *---------------------------
DR0422     MOVE '10345-READ-PRDSCMM'        TO CXUTS0ML-PARAGRAPH.

           INITIALIZE PRDSCMM-RECORD
JS0107     MOVE 'Y'                      TO WS-PRDSCMM-HAS-BEEN-READ
           MOVE 'SC'                     TO PRDSCM-LOCATION-TYPE
           MOVE SCMSTR-KEY               TO PRDSCM-LOCATION-CODE
           EXEC CICS READ
                DATASET ('PRDSCMM')
                INTO    (PRDSCMM-RECORD)
                RIDFLD  (PRDSCM-KEY)
                RESP    (EIBRESP)
           END-EXEC.
DR0422     MOVE PRDSCM-KEY        TO CXUTS0ML-COMMAND
           PERFORM CHECK-FOR-NOTFND-EIBRESP
           IF EIBRESP = DFHRESP(NOTFND)
              MOVE 'CH'                     TO PRDSCM-LOCATION-TYPE
              MOVE SCM-CHAIN-CODE           TO PRDSCM-LOCATION-CODE
              EXEC CICS READ
                   DATASET ('PRDSCMM')
                   INTO    (PRDSCMM-RECORD)
                   RIDFLD  (PRDSCM-KEY)
                   RESP    (EIBRESP)
              END-EXEC
DR0422        MOVE PRDSCM-KEY        TO CXUTS0ML-COMMAND
              PERFORM CHECK-FOR-NOTFND-EIBRESP
           END-IF.
           IF EIBRESP = DFHRESP(NOTFND)
              MOVE 'CO'                     TO PRDSCM-LOCATION-TYPE
              MOVE SCM-CORPORATE-CODE       TO PRDSCM-LOCATION-CODE
              EXEC CICS READ
                   DATASET ('PRDSCMM')
                   INTO    (PRDSCMM-RECORD)
                   RIDFLD  (PRDSCM-KEY)
                   RESP    (EIBRESP)
              END-EXEC
DR0422        MOVE PRDSCM-KEY        TO CXUTS0ML-COMMAND
              PERFORM CHECK-FOR-NOTFND-EIBRESP
           END-IF.

      *----------------------------
       10410-VALIDATE-UNIT-DATA.
      *----------------------------
           IF NO-MORE-ORDERS-ALLOWED
              MOVE DO-NOT-HONOR      TO OUT-COMENT
              MOVE DO-NOT-HONOR-N    TO POS-ERROR-NUMBER
              MOVE CARD-BLOCKED-NBR  TO NEW-DO-NOT-HONOR-NBR
              MOVE NEW-DO-NOT-HONOR1 TO NEW-OUT-MSG1
              MOVE NEW-DO-NOT-HONOR2 TO NEW-OUT-MSG2
              MOVE 'Y'               TO VCWS-ERROR-IND
              PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN
           END-IF.

      *----------------------------
       10420-VALIDATE-MAX-PURC.
      *----------------------------
CP0807** CHANGED VARIABLES FOR FPMASTR REPLACMENT **
      **** (CHECK CARD LIMITS TO SEE IF DRIVER CAN USE CARD) ****
CP0807     MULTIPLY WS-RFL-MAX-PURC-VARIANCE-R BY
CP0807              WS-RFL-MAX-PURC-DLY-FUEL
                GIVING WS-EXTRA-AMT ROUNDED.
CP0807     ADD WS-RFL-MAX-PURC-DLY-FUEL   TO WS-EXTRA-AMT.
CP0807     IF WS-RFL-MAX-PURC-DLY-FUEL   > 0 AND
CP0807        UNITMST-DATE-LAST-XTN = WS-CURRENT-DATE-YYDDD
CP0807        COMPUTE WS-WORK-AMOUNT = UNITMST-CURR-DAY-OIL-COST +
CP0807                                 UNITMST-CURR-DAY-REQ-AMT   +
CP0807                                 UNITMST-CURR-DAY-AMT-REF
              IF WS-WORK-AMOUNT > WS-EXTRA-AMT
CP0807           MOVE WS-RFL-MAX-PURC-DLY-FUEL   TO PURC-MAX-NR
CP0807           MOVE WS-RFL-MAX-PURC-VARIANCE   TO PURC-VAR-NR
                 MOVE WS-EXTRA-AMT               TO PURC-TOTAL-NR
CP0807           COMPUTE WS-EXTRA-AMT = UNITMST-CURR-DAY-OIL-COST +
CP0807                                  UNITMST-CURR-DAY-REQ-AMT   +
CP0807                                  UNITMST-CURR-DAY-AMT-REF
                 MOVE WS-EXTRA-AMT               TO PURC-USED-NR
                 MOVE SPACES                     TO PURC-DIFF-HD
                 MOVE PURC-MAX-MESSAGE           TO OUT-COMENT
                 MOVE PURC-MAX-MESSAGE-N TO POS-ERROR-NUMBER
                 IF LIMITS-ALTERED-FOR-PO = 'Y'
                    MOVE PO-LIMIT-EXCEEDED TO OUT-COMENT
                    MOVE PO-LIMIT-EXCEEDED-N TO POS-ERROR-NUMBER
                 END-IF
                 PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN
              END-IF
           END-IF.

      *----------------------------
       10430-VALIDATE-TRIP-ALLOW.
      *----------------------------
CP0807** CHANGED VARIABLES FOR FPMASTR REPLACEMENT **
CP0807     IF TRIP-ALLOWANCE-SET                AND
CP0807        UNITMST-INIT-TRIP-ALLOW       > 0 AND
CP0807        UNITMST-INIT-TRIP-ALLOW   NOT > UNITMST-TRIP-ALLOW-USED
              MOVE TRIP-ALLOW-EXCEEDED     TO OUT-COMENT
              MOVE TRIP-ALLOW-EXCEEDED-N   TO POS-ERROR-NUMBER
              MOVE TRIP-ALLOW-EXCEEDED-NBR TO CALL-COMPANY-NBR
              MOVE CALL-COMPANY-MSG        TO NEW-OUT-MESSAGE
              MOVE 'Y'                     TO VCWS-ERROR-IND
              IF LIMITS-ALTERED-FOR-PO = 'Y'
                 MOVE PO-LIMIT-EXCEEDED TO OUT-COMENT
                 MOVE PO-LIMIT-EXCEEDED-N TO POS-ERROR-NUMBER
              END-IF
              PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN
           END-IF.

      *----------------------------
       10440-VALIDATE-EXP-BALANCE.
      *----------------------------
JS1199     PERFORM DETERMINE-IF-BALANCE-BASED
JS1199     IF WS-BALANCE-BASED   AND
              PRM-EXPENSE-BALANCE < .01
              MOVE PRM-EXPENSE-BALANCE           TO XCS-BAL-REQ-AMT
              MOVE EXCESSIVE-BALANCE-REQUEST     TO OUT-COMENT
              MOVE EXCESSIVE-BALANCE-REQUEST-N   TO POS-ERROR-NUMBER
              MOVE NEW-EXCESSIVE-BALANCE-REQUEST TO NEW-OUT-MESSAGE
              MOVE 'Y'                           TO VCWS-ERROR-IND
              IF LIMITS-ALTERED-FOR-PO = 'Y'
                 MOVE PO-LIMIT-EXCEEDED TO OUT-COMENT
                 MOVE PO-LIMIT-EXCEEDED-N TO POS-ERROR-NUMBER
              END-IF
              PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN
           END-IF.

      *----------------------------
       10450-VALIDATE-CARD-PURC.
      *----------------------------
CP1098     IF CSR-PURC-LIMIT-ON-CARD
              IF PRM-PURC-INITIAL NOT > PRM-PURC-USED
                 IF CDN-PURCHASE-ORDER-POOL-LIMIT
                    MOVE '1' TO COM-PO-REQUIRED-FOR-FUEL
                    MOVE '1' TO COM-PO-REQUIRED-FOR-OIL
                 ELSE
JS0604              MOVE '0' TO COM-PUR-OPTIONS-FUEL
JS0604              MOVE '0' TO COM-PUR-OPTIONS-OIL.

      *-------------------------------------
       10500-CHECK-FOR-MNX-XTN.
      *-------------------------------------
           MOVE '*' TO MNX-TRANSACTION-FLAG.
           MOVE 'Y' TO WS-LOOP-FLAG

           PERFORM
             VARYING DCT-INDX FROM 1 BY 1
             UNTIL WS-LOOP-FLAG = 'N' OR
                   DCT-FUEL-CODE (DCT-INDX) = HIGH-VALUES
CP0698          IF DCT-FUEL-CODE (DCT-INDX) = COM-FP-CO-CODE
                   MOVE 'S' TO MNX-TRANSACTION-FLAG
                   IF DCT-FUEL-TYPE (DCT-INDX) = SCM-FUEL-BRAND-1ST-5
                      MOVE 'M' TO MNX-TRANSACTION-FLAG
JS0604                MOVE '1' TO COM-DIRECT-BILLING-OIL
JS0604                            COM-DIRECT-BILLING-FUEL
                      MOVE 'N' TO WS-LOOP-FLAG
                   END-IF
                END-IF
             END-PERFORM.

      *------------------------------
       10600-GET-NETWORK-BY-CARD-INFO.
      *------------------------------
           MOVE ' ' TO ERROR-FLAG.
           MOVE ' ' TO ADF-NETWORK-FLAG.
           MOVE 'N' TO COM-NETWORK-BY-CARD

      **** (IF ON LIMITED NETW BY CARD - CHECK NETWORK) ****
      **** (TURN OFF NETWORK OPTION ON CUSTOMER LEVEL) ****
           IF CDN-LIM-NETW-BY-CARD = 'Y' AND
              PRM-LIM-NETW-BY-CARD = 'Y'
              PERFORM CHECK-LIM-NETW-BY-CARD
           END-IF.
      *------------------------------
       10610-GET-NETWORK-INFO.
      *------------------------------
      **** (THE TERMINAL FUEL FLAG MAY BE ALTERED BY THE NETWORK) ****
      **** (THE FOLLOWING MOVE INITILIZES IT BEFORE THE NETWORK ) ****
           MOVE 'N' TO COM-RMR-TERM-FUEL-FLAG.
           IF SCM-IS-A-TERMINAL-FUEL-LOC
              MOVE 'Y' TO COM-RMR-TERM-FUEL-FLAG
           END-IF.

      **** (SEE IF THE CUSTOMER HAS RELATIONSHIPS SETUP) ****
           IF CDN-RELATIONSHIP-FLAG = 'Y'
JS0299       OR SC-ON-LIMITED-NETWORK
091411       OR SCM-NET-PRICING-FL-YES
              PERFORM 70000-CHECK-RMS-LOCATION.

      *------------------------------
       10620-CHECK-NETWORK-ERROR.
      *------------------------------
           MOVE ' ' TO COM-PO-REQUIRED
           IF THERE-WAS-AN-ERROR
              EVALUATE TRUE
                 WHEN CDN-OVERRIDE-LIMITED-NETWORK = 'Y' AND
                      CDN-PURCHASE-ORDER           > SPACES
                    MOVE 'Y' TO COM-PO-REQUIRED
                    MOVE '*' TO ADF-NETWORK-FLAG
                 WHEN PRM-FUEL-OFFNET-FLAG = 'Y'
                    MOVE 'Y' TO COM-CARD-OFFNET-USED
                    MOVE '*' TO ADF-NETWORK-FLAG
                 WHEN OTHER
                    MOVE DRIVER-MAY-NOT-FUEL-HERE   TO OUT-COMENT
                    MOVE DRIVER-MAY-NOT-FUEL-HERE-N TO POS-ERROR-NUMBER
                    MOVE FUEL-NOT-ALLOWED-NBR       TO CALL-COMPANY-NBR
                    MOVE CALL-COMPANY-MSG           TO NEW-OUT-MESSAGE
                    MOVE 'Y'                        TO VCWS-ERROR-IND
                    PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN
              END-EVALUATE.
           MOVE ' ' TO ERROR-FLAG.
           MOVE 'Y' TO WS-NETW-OK.

      *------------------------------
       10630-CHECK-CARD-OFFNET-USED.
      *------------------------------
      **** (IF ONE TIME CARD OFF NETW FLAG ON THEN ALWAYS USE IT) ****
           IF PRM-FUEL-OFFNET-FLAG = 'Y'
              MOVE 'Y' TO COM-CARD-OFFNET-USED.

      *-------------------------------------
       10700-CHECK-FOR-TERM-FUEL.
      *-------------------------------------
      **** (IF TERMINAL FUEL, PAY AT LOAD IS NOT ALLOWED) ****
JS1199     PERFORM DETERMINE-IF-BALANCE-BASED
           IF COM-THIS-IS-A-TERM-FUEL-XTN AND
JS1199        WS-BALANCE-BASED       AND
              CDN-BILL-AT-LOAD
              MOVE TERMINAL-FUEL-NOT-ALLOWED-N TO POS-ERROR-NUMBER
              MOVE TERMINAL-FUEL-NOT-ALLOWED   TO OUT-COMENT
              PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN
           END-IF.

      *-------------------------------
JS0798 10710-CHECK-FOR-CREDIT-LOC.
      *-------------------------------
           IF CDN-CREDIT-PRICED-TEXACO
              IF NOT SCM-CREDIT-PROGRAM-YES
                 MOVE MUST-BE-AT-A-CREDIT-LOC-N TO POS-ERROR-NUMBER
                 MOVE MUST-BE-AT-A-CREDIT-LOC   TO OUT-COMENT
JS0798                                             3270-OUTPUT-DATA
                 PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN.

JS0798     IF CDN-CREDIT-PRICED-GENERIC
SB0315     OR CDN-CREDIT-PRICED-FUELUP
JS0798        IF NOT SCM-CREDIT-PROGRAM-NORMAL
JS0798           MOVE MUST-BE-AT-A-CREDIT-LOC-N TO POS-ERROR-NUMBER
JS0798           MOVE MUST-BE-AT-A-CREDIT-LOC   TO OUT-COMENT
JS0798                                             3270-OUTPUT-DATA
JS0798           PERFORM CHECK-FOR-EXIT-INITIAL-SCREEN.
