000010******************************************************************
000020*                                                                *
000030*    MEMBER:  WKC80650                                           *
000040*      NAME:  CLAIM EXCEPTION INDEX COPYBOOK                     *
000050* SUBSYSTEM:  C CLAIMS                                           *
000060*   CREATED:  03/27/2003  AT 03:35:54                            *
000070*                                                                *
000080*----------------------------------------------------------------*
000090*   THIS COPYBOOK WAS CREATED BY THE COBOL PROGRAM PDMC9930      *
000100******************************************************************
000110
000120 01  EDIT-CODES-INDEX-LIST.
000130     05  WK-806-0001-IDX   PIC S9(08) USAGE COMP    VALUE  0001.
000140     05  WK-806-0002-IDX   PIC S9(08) USAGE COMP    VALUE  0002.
000150     05  WK-806-0003-IDX   PIC S9(08) USAGE COMP    VALUE  0003.
000160     05  WK-806-0004-IDX   PIC S9(08) USAGE COMP    VALUE  0004.
000170     05  WK-806-0005-IDX   PIC S9(08) USAGE COMP    VALUE  0005.
000180     05  WK-806-0006-IDX   PIC S9(08) USAGE COMP    VALUE  0006.
000190     05  WK-806-0007-IDX   PIC S9(08) USAGE COMP    VALUE  0007.
000200     05  WK-806-0008-IDX   PIC S9(08) USAGE COMP    VALUE  0008.
000210     05  WK-806-0009-IDX   PIC S9(08) USAGE COMP    VALUE  0009.
000220     05  WK-806-0010-IDX   PIC S9(08) USAGE COMP    VALUE  0010.
000230     05  WK-806-0011-IDX   PIC S9(08) USAGE COMP    VALUE  0011.
000240     05  WK-806-0012-IDX   PIC S9(08) USAGE COMP    VALUE  0012.
000250     05  WK-806-0013-IDX   PIC S9(08) USAGE COMP    VALUE  0013.
000260     05  WK-806-0014-IDX   PIC S9(08) USAGE COMP    VALUE  0014.
000270     05  WK-806-0015-IDX   PIC S9(08) USAGE COMP    VALUE  0015.
000280     05  WK-806-0016-IDX   PIC S9(08) USAGE COMP    VALUE  0016.
000290     05  WK-806-0017-IDX   PIC S9(08) USAGE COMP    VALUE  0017.
000300     05  WK-806-0018-IDX   PIC S9(08) USAGE COMP    VALUE  0018.
000310     05  WK-806-0019-IDX   PIC S9(08) USAGE COMP    VALUE  0019.
000320     05  WK-806-0020-IDX   PIC S9(08) USAGE COMP    VALUE  0020.
000330     05  WK-806-0021-IDX   PIC S9(08) USAGE COMP    VALUE  0021.
000340     05  WK-806-0022-IDX   PIC S9(08) USAGE COMP    VALUE  0022.
000350     05  WK-806-0023-IDX   PIC S9(08) USAGE COMP    VALUE  0023.
000360     05  WK-806-0024-IDX   PIC S9(08) USAGE COMP    VALUE  0024.
000370     05  WK-806-0025-IDX   PIC S9(08) USAGE COMP    VALUE  0025.
000380     05  WK-806-0026-IDX   PIC S9(08) USAGE COMP    VALUE  0026.
000390     05  WK-806-0027-IDX   PIC S9(08) USAGE COMP    VALUE  0027.
000400     05  WK-806-0028-IDX   PIC S9(08) USAGE COMP    VALUE  0028.
000410     05  WK-806-0029-IDX   PIC S9(08) USAGE COMP    VALUE  0029.
000420     05  WK-806-0030-IDX   PIC S9(08) USAGE COMP    VALUE  0030.
000430     05  WK-806-0031-IDX   PIC S9(08) USAGE COMP    VALUE  0031.
000440     05  WK-806-0032-IDX   PIC S9(08) USAGE COMP    VALUE  0032.
000450     05  WK-806-0033-IDX   PIC S9(08) USAGE COMP    VALUE  0033.
000460     05  WK-806-0034-IDX   PIC S9(08) USAGE COMP    VALUE  0034.
000470     05  WK-806-0035-IDX   PIC S9(08) USAGE COMP    VALUE  0035.
000480     05  WK-806-0036-IDX   PIC S9(08) USAGE COMP    VALUE  0036.
000490     05  WK-806-0037-IDX   PIC S9(08) USAGE COMP    VALUE  0037.
000500     05  WK-806-0038-IDX   PIC S9(08) USAGE COMP    VALUE  0038.
000510     05  WK-806-0039-IDX   PIC S9(08) USAGE COMP    VALUE  0039.
000520     05  WK-806-0040-IDX   PIC S9(08) USAGE COMP    VALUE  0040.
000530     05  WK-806-0041-IDX   PIC S9(08) USAGE COMP    VALUE  0041.
000540     05  WK-806-0042-IDX   PIC S9(08) USAGE COMP    VALUE  0042.
000550     05  WK-806-0043-IDX   PIC S9(08) USAGE COMP    VALUE  0043.
000560     05  WK-806-0044-IDX   PIC S9(08) USAGE COMP    VALUE  0044.
000570     05  WK-806-0045-IDX   PIC S9(08) USAGE COMP    VALUE  0045.
000580     05  WK-806-0046-IDX   PIC S9(08) USAGE COMP    VALUE  0046.
000590     05  WK-806-0047-IDX   PIC S9(08) USAGE COMP    VALUE  0047.
000600     05  WK-806-0048-IDX   PIC S9(08) USAGE COMP    VALUE  0048.
000610     05  WK-806-0049-IDX   PIC S9(08) USAGE COMP    VALUE  0049.
000620     05  WK-806-0050-IDX   PIC S9(08) USAGE COMP    VALUE  0050.
000630     05  WK-806-0051-IDX   PIC S9(08) USAGE COMP    VALUE  0051.
000640     05  WK-806-0052-IDX   PIC S9(08) USAGE COMP    VALUE  0052.
000650     05  WK-806-0053-IDX   PIC S9(08) USAGE COMP    VALUE  0053.
000660     05  WK-806-0054-IDX   PIC S9(08) USAGE COMP    VALUE  0054.
000670     05  WK-806-0055-IDX   PIC S9(08) USAGE COMP    VALUE  0055.
000680     05  WK-806-0056-IDX   PIC S9(08) USAGE COMP    VALUE  0056.
000690     05  WK-806-0057-IDX   PIC S9(08) USAGE COMP    VALUE  0057.
000700     05  WK-806-0058-IDX   PIC S9(08) USAGE COMP    VALUE  0058.
000710     05  WK-806-0059-IDX   PIC S9(08) USAGE COMP    VALUE  0059.
000720     05  WK-806-0060-IDX   PIC S9(08) USAGE COMP    VALUE  0060.
000730     05  WK-806-0061-IDX   PIC S9(08) USAGE COMP    VALUE  0061.
000740     05  WK-806-0062-IDX   PIC S9(08) USAGE COMP    VALUE  0062.
000750     05  WK-806-0063-IDX   PIC S9(08) USAGE COMP    VALUE  0063.
000760     05  WK-806-0064-IDX   PIC S9(08) USAGE COMP    VALUE  0064.
000770     05  WK-806-0065-IDX   PIC S9(08) USAGE COMP    VALUE  0065.
000780     05  WK-806-0066-IDX   PIC S9(08) USAGE COMP    VALUE  0066.
000790     05  WK-806-0067-IDX   PIC S9(08) USAGE COMP    VALUE  0067.
000800     05  WK-806-0068-IDX   PIC S9(08) USAGE COMP    VALUE  0068.
000810     05  WK-806-0069-IDX   PIC S9(08) USAGE COMP    VALUE  0069.
000820     05  WK-806-0070-IDX   PIC S9(08) USAGE COMP    VALUE  0070.
000830     05  WK-806-0071-IDX   PIC S9(08) USAGE COMP    VALUE  0071.
000840     05  WK-806-0072-IDX   PIC S9(08) USAGE COMP    VALUE  0072.
000850     05  WK-806-0073-IDX   PIC S9(08) USAGE COMP    VALUE  0073.
000860     05  WK-806-0074-IDX   PIC S9(08) USAGE COMP    VALUE  0074.
000870     05  WK-806-0075-IDX   PIC S9(08) USAGE COMP    VALUE  0075.
000880     05  WK-806-0076-IDX   PIC S9(08) USAGE COMP    VALUE  0076.
000890     05  WK-806-0077-IDX   PIC S9(08) USAGE COMP    VALUE  0077.
000900     05  WK-806-0078-IDX   PIC S9(08) USAGE COMP    VALUE  0078.
000910     05  WK-806-0079-IDX   PIC S9(08) USAGE COMP    VALUE  0079.
000920     05  WK-806-0080-IDX   PIC S9(08) USAGE COMP    VALUE  0080.
000930     05  WK-806-0081-IDX   PIC S9(08) USAGE COMP    VALUE  0081.
000940     05  WK-806-0082-IDX   PIC S9(08) USAGE COMP    VALUE  0082.
000950     05  WK-806-0083-IDX   PIC S9(08) USAGE COMP    VALUE  0083.
000960     05  WK-806-0084-IDX   PIC S9(08) USAGE COMP    VALUE  0084.
000970     05  WK-806-0085-IDX   PIC S9(08) USAGE COMP    VALUE  0085.
000980     05  WK-806-0086-IDX   PIC S9(08) USAGE COMP    VALUE  0086.
000990     05  WK-806-0087-IDX   PIC S9(08) USAGE COMP    VALUE  0087.
001000     05  WK-806-0088-IDX   PIC S9(08) USAGE COMP    VALUE  0088.
001010     05  WK-806-0089-IDX   PIC S9(08) USAGE COMP    VALUE  0089.
001020     05  WK-806-0090-IDX   PIC S9(08) USAGE COMP    VALUE  0090.
001030     05  WK-806-0091-IDX   PIC S9(08) USAGE COMP    VALUE  0091.
001040     05  WK-806-0092-IDX   PIC S9(08) USAGE COMP    VALUE  0092.
001050     05  WK-806-0093-IDX   PIC S9(08) USAGE COMP    VALUE  0093.
001060     05  WK-806-0094-IDX   PIC S9(08) USAGE COMP    VALUE  0094.
001070     05  WK-806-0095-IDX   PIC S9(08) USAGE COMP    VALUE  0095.
001080     05  WK-806-0096-IDX   PIC S9(08) USAGE COMP    VALUE  0096.
001090     05  WK-806-0097-IDX   PIC S9(08) USAGE COMP    VALUE  0097.
001100     05  WK-806-0098-IDX   PIC S9(08) USAGE COMP    VALUE  0098.
001110     05  WK-806-0099-IDX   PIC S9(08) USAGE COMP    VALUE  0099.
001120     05  WK-806-0100-IDX   PIC S9(08) USAGE COMP    VALUE  0100.
001130     05  WK-806-0101-IDX   PIC S9(08) USAGE COMP    VALUE  0101.
001140     05  WK-806-0102-IDX   PIC S9(08) USAGE COMP    VALUE  0102.
001150     05  WK-806-0103-IDX   PIC S9(08) USAGE COMP    VALUE  0103.
001160     05  WK-806-0104-IDX   PIC S9(08) USAGE COMP    VALUE  0104.
001170     05  WK-806-0105-IDX   PIC S9(08) USAGE COMP    VALUE  0105.
001180     05  WK-806-0106-IDX   PIC S9(08) USAGE COMP    VALUE  0106.
001190     05  WK-806-0107-IDX   PIC S9(08) USAGE COMP    VALUE  0107.
001200     05  WK-806-0108-IDX   PIC S9(08) USAGE COMP    VALUE  0108.
001210     05  WK-806-0109-IDX   PIC S9(08) USAGE COMP    VALUE  0109.
001220     05  WK-806-0110-IDX   PIC S9(08) USAGE COMP    VALUE  0110.
001230     05  WK-806-0111-IDX   PIC S9(08) USAGE COMP    VALUE  0111.
001240     05  WK-806-0112-IDX   PIC S9(08) USAGE COMP    VALUE  0112.
001250     05  WK-806-0113-IDX   PIC S9(08) USAGE COMP    VALUE  0113.
001260     05  WK-806-0114-IDX   PIC S9(08) USAGE COMP    VALUE  0114.
001270     05  WK-806-0115-IDX   PIC S9(08) USAGE COMP    VALUE  0115.
001280     05  WK-806-0116-IDX   PIC S9(08) USAGE COMP    VALUE  0116.
001290     05  WK-806-0117-IDX   PIC S9(08) USAGE COMP    VALUE  0117.
001300     05  WK-806-0118-IDX   PIC S9(08) USAGE COMP    VALUE  0118.
001310     05  WK-806-0119-IDX   PIC S9(08) USAGE COMP    VALUE  0119.
001320     05  WK-806-0120-IDX   PIC S9(08) USAGE COMP    VALUE  0120.
001330     05  WK-806-0121-IDX   PIC S9(08) USAGE COMP    VALUE  0121.
001340     05  WK-806-0122-IDX   PIC S9(08) USAGE COMP    VALUE  0122.
001350     05  WK-806-0123-IDX   PIC S9(08) USAGE COMP    VALUE  0123.
001360     05  WK-806-0124-IDX   PIC S9(08) USAGE COMP    VALUE  0124.
001370     05  WK-806-0125-IDX   PIC S9(08) USAGE COMP    VALUE  0125.
001380     05  WK-806-0126-IDX   PIC S9(08) USAGE COMP    VALUE  0126.
001390     05  WK-806-0127-IDX   PIC S9(08) USAGE COMP    VALUE  0127.
001400     05  WK-806-0128-IDX   PIC S9(08) USAGE COMP    VALUE  0128.
001410     05  WK-806-0129-IDX   PIC S9(08) USAGE COMP    VALUE  0129.
001420     05  WK-806-0130-IDX   PIC S9(08) USAGE COMP    VALUE  0130.
001430     05  WK-806-0131-IDX   PIC S9(08) USAGE COMP    VALUE  0131.
001440     05  WK-806-0132-IDX   PIC S9(08) USAGE COMP    VALUE  0132.
001450     05  WK-806-0133-IDX   PIC S9(08) USAGE COMP    VALUE  0133.
001460     05  WK-806-0134-IDX   PIC S9(08) USAGE COMP    VALUE  0134.
001470     05  WK-806-0135-IDX   PIC S9(08) USAGE COMP    VALUE  0135.
001480     05  WK-806-0136-IDX   PIC S9(08) USAGE COMP    VALUE  0136.
001490     05  WK-806-0137-IDX   PIC S9(08) USAGE COMP    VALUE  0137.
001500     05  WK-806-0138-IDX   PIC S9(08) USAGE COMP    VALUE  0138.
001510     05  WK-806-0139-IDX   PIC S9(08) USAGE COMP    VALUE  0139.
001520     05  WK-806-0140-IDX   PIC S9(08) USAGE COMP    VALUE  0140.
001530     05  WK-806-0141-IDX   PIC S9(08) USAGE COMP    VALUE  0141.
001540     05  WK-806-0142-IDX   PIC S9(08) USAGE COMP    VALUE  0142.
001550     05  WK-806-0143-IDX   PIC S9(08) USAGE COMP    VALUE  0143.
001560     05  WK-806-0144-IDX   PIC S9(08) USAGE COMP    VALUE  0144.
001570     05  WK-806-0145-IDX   PIC S9(08) USAGE COMP    VALUE  0145.
001580     05  WK-806-0146-IDX   PIC S9(08) USAGE COMP    VALUE  0146.
001590     05  WK-806-0147-IDX   PIC S9(08) USAGE COMP    VALUE  0147.
001600     05  WK-806-0148-IDX   PIC S9(08) USAGE COMP    VALUE  0148.
001610     05  WK-806-0149-IDX   PIC S9(08) USAGE COMP    VALUE  0149.
001620     05  WK-806-0150-IDX   PIC S9(08) USAGE COMP    VALUE  0150.
001630     05  WK-806-0151-IDX   PIC S9(08) USAGE COMP    VALUE  0151.
001640     05  WK-806-0152-IDX   PIC S9(08) USAGE COMP    VALUE  0152.
001650     05  WK-806-0153-IDX   PIC S9(08) USAGE COMP    VALUE  0153.
001660     05  WK-806-0154-IDX   PIC S9(08) USAGE COMP    VALUE  0154.
001670     05  WK-806-0155-IDX   PIC S9(08) USAGE COMP    VALUE  0155.
001680     05  WK-806-0156-IDX   PIC S9(08) USAGE COMP    VALUE  0156.
001690     05  WK-806-0157-IDX   PIC S9(08) USAGE COMP    VALUE  0157.
001700     05  WK-806-0158-IDX   PIC S9(08) USAGE COMP    VALUE  0158.
001710     05  WK-806-0159-IDX   PIC S9(08) USAGE COMP    VALUE  0159.
001720     05  WK-806-0160-IDX   PIC S9(08) USAGE COMP    VALUE  0160.
001730     05  WK-806-0161-IDX   PIC S9(08) USAGE COMP    VALUE  0161.
001740     05  WK-806-0162-IDX   PIC S9(08) USAGE COMP    VALUE  0162.
001750     05  WK-806-0163-IDX   PIC S9(08) USAGE COMP    VALUE  0163.
001760     05  WK-806-0164-IDX   PIC S9(08) USAGE COMP    VALUE  0164.
001770     05  WK-806-0165-IDX   PIC S9(08) USAGE COMP    VALUE  0165.
001780     05  WK-806-0166-IDX   PIC S9(08) USAGE COMP    VALUE  0166.
001790     05  WK-806-0167-IDX   PIC S9(08) USAGE COMP    VALUE  0167.
001800     05  WK-806-0168-IDX   PIC S9(08) USAGE COMP    VALUE  0168.
001810     05  WK-806-0169-IDX   PIC S9(08) USAGE COMP    VALUE  0169.
001820     05  WK-806-0170-IDX   PIC S9(08) USAGE COMP    VALUE  0170.
001830     05  WK-806-0171-IDX   PIC S9(08) USAGE COMP    VALUE  0171.
001840     05  WK-806-0172-IDX   PIC S9(08) USAGE COMP    VALUE  0172.
001850     05  WK-806-0173-IDX   PIC S9(08) USAGE COMP    VALUE  0173.
001860     05  WK-806-0174-IDX   PIC S9(08) USAGE COMP    VALUE  0174.
001870     05  WK-806-0175-IDX   PIC S9(08) USAGE COMP    VALUE  0175.
001880     05  WK-806-0176-IDX   PIC S9(08) USAGE COMP    VALUE  0176.
001890     05  WK-806-0177-IDX   PIC S9(08) USAGE COMP    VALUE  0177.
001900     05  WK-806-0178-IDX   PIC S9(08) USAGE COMP    VALUE  0178.
001910     05  WK-806-0179-IDX   PIC S9(08) USAGE COMP    VALUE  0179.
001920     05  WK-806-0180-IDX   PIC S9(08) USAGE COMP    VALUE  0180.
001930     05  WK-806-0181-IDX   PIC S9(08) USAGE COMP    VALUE  0181.
001940     05  WK-806-0182-IDX   PIC S9(08) USAGE COMP    VALUE  0182.
001950     05  WK-806-0183-IDX   PIC S9(08) USAGE COMP    VALUE  0183.
001960     05  WK-806-0184-IDX   PIC S9(08) USAGE COMP    VALUE  0184.
001970     05  WK-806-0185-IDX   PIC S9(08) USAGE COMP    VALUE  0185.
001980     05  WK-806-0186-IDX   PIC S9(08) USAGE COMP    VALUE  0186.
001990     05  WK-806-0187-IDX   PIC S9(08) USAGE COMP    VALUE  0187.
002000     05  WK-806-0188-IDX   PIC S9(08) USAGE COMP    VALUE  0188.
002010     05  WK-806-0189-IDX   PIC S9(08) USAGE COMP    VALUE  0189.
002020     05  WK-806-0190-IDX   PIC S9(08) USAGE COMP    VALUE  0190.
002030     05  WK-806-0191-IDX   PIC S9(08) USAGE COMP    VALUE  0191.
002040     05  WK-806-0192-IDX   PIC S9(08) USAGE COMP    VALUE  0192.
002050     05  WK-806-0193-IDX   PIC S9(08) USAGE COMP    VALUE  0193.
002060     05  WK-806-0194-IDX   PIC S9(08) USAGE COMP    VALUE  0194.
002070     05  WK-806-0195-IDX   PIC S9(08) USAGE COMP    VALUE  0195.
002080     05  WK-806-0196-IDX   PIC S9(08) USAGE COMP    VALUE  0196.
002090     05  WK-806-0197-IDX   PIC S9(08) USAGE COMP    VALUE  0197.
002100     05  WK-806-0198-IDX   PIC S9(08) USAGE COMP    VALUE  0198.
002110     05  WK-806-0199-IDX   PIC S9(08) USAGE COMP    VALUE  0199.
002120     05  WK-806-0200-IDX   PIC S9(08) USAGE COMP    VALUE  0200.
002130     05  WK-806-0201-IDX   PIC S9(08) USAGE COMP    VALUE  0201.
002140     05  WK-806-0202-IDX   PIC S9(08) USAGE COMP    VALUE  0202.
002150     05  WK-806-0203-IDX   PIC S9(08) USAGE COMP    VALUE  0203.
002160     05  WK-806-0204-IDX   PIC S9(08) USAGE COMP    VALUE  0204.
002170     05  WK-806-0205-IDX   PIC S9(08) USAGE COMP    VALUE  0205.
002180     05  WK-806-0206-IDX   PIC S9(08) USAGE COMP    VALUE  0206.
002190     05  WK-806-0207-IDX   PIC S9(08) USAGE COMP    VALUE  0207.
002200     05  WK-806-0208-IDX   PIC S9(08) USAGE COMP    VALUE  0208.
002210     05  WK-806-0209-IDX   PIC S9(08) USAGE COMP    VALUE  0209.
002220     05  WK-806-0210-IDX   PIC S9(08) USAGE COMP    VALUE  0210.
002230     05  WK-806-0211-IDX   PIC S9(08) USAGE COMP    VALUE  0211.
002240     05  WK-806-0212-IDX   PIC S9(08) USAGE COMP    VALUE  0212.
002250     05  WK-806-0213-IDX   PIC S9(08) USAGE COMP    VALUE  0213.
002260     05  WK-806-0214-IDX   PIC S9(08) USAGE COMP    VALUE  0214.
002270     05  WK-806-0215-IDX   PIC S9(08) USAGE COMP    VALUE  0215.
002280     05  WK-806-0216-IDX   PIC S9(08) USAGE COMP    VALUE  0216.
002290     05  WK-806-0217-IDX   PIC S9(08) USAGE COMP    VALUE  0217.
002300     05  WK-806-0218-IDX   PIC S9(08) USAGE COMP    VALUE  0218.
002310     05  WK-806-0219-IDX   PIC S9(08) USAGE COMP    VALUE  0219.
002320     05  WK-806-0220-IDX   PIC S9(08) USAGE COMP    VALUE  0220.
002330     05  WK-806-0221-IDX   PIC S9(08) USAGE COMP    VALUE  0221.
002340     05  WK-806-0222-IDX   PIC S9(08) USAGE COMP    VALUE  0222.
002350     05  WK-806-0223-IDX   PIC S9(08) USAGE COMP    VALUE  0223.
002360     05  WK-806-0224-IDX   PIC S9(08) USAGE COMP    VALUE  0224.
002370     05  WK-806-0225-IDX   PIC S9(08) USAGE COMP    VALUE  0225.
002380     05  WK-806-0226-IDX   PIC S9(08) USAGE COMP    VALUE  0226.
002390     05  WK-806-0227-IDX   PIC S9(08) USAGE COMP    VALUE  0227.
002400     05  WK-806-0228-IDX   PIC S9(08) USAGE COMP    VALUE  0228.
002410     05  WK-806-0229-IDX   PIC S9(08) USAGE COMP    VALUE  0229.
002420     05  WK-806-0230-IDX   PIC S9(08) USAGE COMP    VALUE  0230.
002430     05  WK-806-0231-IDX   PIC S9(08) USAGE COMP    VALUE  0231.
002440     05  WK-806-0232-IDX   PIC S9(08) USAGE COMP    VALUE  0232.
002450     05  WK-806-0233-IDX   PIC S9(08) USAGE COMP    VALUE  0233.
002460     05  WK-806-0234-IDX   PIC S9(08) USAGE COMP    VALUE  0234.
002470     05  WK-806-0235-IDX   PIC S9(08) USAGE COMP    VALUE  0235.
002480     05  WK-806-0236-IDX   PIC S9(08) USAGE COMP    VALUE  0236.
002490     05  WK-806-0237-IDX   PIC S9(08) USAGE COMP    VALUE  0237.
002500     05  WK-806-0238-IDX   PIC S9(08) USAGE COMP    VALUE  0238.
002510     05  WK-806-0239-IDX   PIC S9(08) USAGE COMP    VALUE  0239.
002520     05  WK-806-0240-IDX   PIC S9(08) USAGE COMP    VALUE  0240.
002530     05  WK-806-0241-IDX   PIC S9(08) USAGE COMP    VALUE  0241.
002540     05  WK-806-0242-IDX   PIC S9(08) USAGE COMP    VALUE  0242.
002550     05  WK-806-0243-IDX   PIC S9(08) USAGE COMP    VALUE  0243.
002560     05  WK-806-0244-IDX   PIC S9(08) USAGE COMP    VALUE  0244.
002570     05  WK-806-0245-IDX   PIC S9(08) USAGE COMP    VALUE  0245.
002580     05  WK-806-0246-IDX   PIC S9(08) USAGE COMP    VALUE  0246.
002590     05  WK-806-0247-IDX   PIC S9(08) USAGE COMP    VALUE  0247.
002600     05  WK-806-0248-IDX   PIC S9(08) USAGE COMP    VALUE  0248.
002610     05  WK-806-0249-IDX   PIC S9(08) USAGE COMP    VALUE  0249.
002620     05  WK-806-0250-IDX   PIC S9(08) USAGE COMP    VALUE  0250.
002630     05  WK-806-0251-IDX   PIC S9(08) USAGE COMP    VALUE  0251.
002640     05  WK-806-0252-IDX   PIC S9(08) USAGE COMP    VALUE  0252.
002650     05  WK-806-0253-IDX   PIC S9(08) USAGE COMP    VALUE  0253.
002660     05  WK-806-0254-IDX   PIC S9(08) USAGE COMP    VALUE  0254.
002670     05  WK-806-0255-IDX   PIC S9(08) USAGE COMP    VALUE  0255.
002680     05  WK-806-0256-IDX   PIC S9(08) USAGE COMP    VALUE  0256.
002690     05  WK-806-0257-IDX   PIC S9(08) USAGE COMP    VALUE  0257.
002700     05  WK-806-0258-IDX   PIC S9(08) USAGE COMP    VALUE  0258.
002710     05  WK-806-0259-IDX   PIC S9(08) USAGE COMP    VALUE  0259.
002720     05  WK-806-0260-IDX   PIC S9(08) USAGE COMP    VALUE  0260.
002730     05  WK-806-0261-IDX   PIC S9(08) USAGE COMP    VALUE  0261.
002740     05  WK-806-0262-IDX   PIC S9(08) USAGE COMP    VALUE  0262.
002750     05  WK-806-0263-IDX   PIC S9(08) USAGE COMP    VALUE  0263.
002760     05  WK-806-0264-IDX   PIC S9(08) USAGE COMP    VALUE  0264.
002770     05  WK-806-0265-IDX   PIC S9(08) USAGE COMP    VALUE  0265.
002780     05  WK-806-0266-IDX   PIC S9(08) USAGE COMP    VALUE  0266.
002790     05  WK-806-0267-IDX   PIC S9(08) USAGE COMP    VALUE  0267.
002800     05  WK-806-0268-IDX   PIC S9(08) USAGE COMP    VALUE  0268.
002810     05  WK-806-0269-IDX   PIC S9(08) USAGE COMP    VALUE  0269.
002820     05  WK-806-0270-IDX   PIC S9(08) USAGE COMP    VALUE  0270.
002830     05  WK-806-0271-IDX   PIC S9(08) USAGE COMP    VALUE  0271.
002840     05  WK-806-0272-IDX   PIC S9(08) USAGE COMP    VALUE  0272.
002850     05  WK-806-0273-IDX   PIC S9(08) USAGE COMP    VALUE  0273.
002860     05  WK-806-0274-IDX   PIC S9(08) USAGE COMP    VALUE  0274.
002870     05  WK-806-0275-IDX   PIC S9(08) USAGE COMP    VALUE  0275.
002880     05  WK-806-0276-IDX   PIC S9(08) USAGE COMP    VALUE  0276.
002890     05  WK-806-0277-IDX   PIC S9(08) USAGE COMP    VALUE  0277.
002900     05  WK-806-0278-IDX   PIC S9(08) USAGE COMP    VALUE  0278.
002910     05  WK-806-0279-IDX   PIC S9(08) USAGE COMP    VALUE  0279.
002920     05  WK-806-0280-IDX   PIC S9(08) USAGE COMP    VALUE  0280.
002930     05  WK-806-0281-IDX   PIC S9(08) USAGE COMP    VALUE  0281.
002940     05  WK-806-0282-IDX   PIC S9(08) USAGE COMP    VALUE  0282.
002950     05  WK-806-0283-IDX   PIC S9(08) USAGE COMP    VALUE  0283.
002960     05  WK-806-0284-IDX   PIC S9(08) USAGE COMP    VALUE  0284.
002970     05  WK-806-0285-IDX   PIC S9(08) USAGE COMP    VALUE  0285.
002980     05  WK-806-0286-IDX   PIC S9(08) USAGE COMP    VALUE  0286.
002990     05  WK-806-0287-IDX   PIC S9(08) USAGE COMP    VALUE  0287.
003000     05  WK-806-0288-IDX   PIC S9(08) USAGE COMP    VALUE  0288.
003010     05  WK-806-0289-IDX   PIC S9(08) USAGE COMP    VALUE  0289.
003020     05  WK-806-0290-IDX   PIC S9(08) USAGE COMP    VALUE  0290.
003030     05  WK-806-0291-IDX   PIC S9(08) USAGE COMP    VALUE  0291.
003040     05  WK-806-0292-IDX   PIC S9(08) USAGE COMP    VALUE  0292.
003050     05  WK-806-0293-IDX   PIC S9(08) USAGE COMP    VALUE  0293.
003060     05  WK-806-0294-IDX   PIC S9(08) USAGE COMP    VALUE  0294.
003070     05  WK-806-0295-IDX   PIC S9(08) USAGE COMP    VALUE  0295.
003080     05  WK-806-0296-IDX   PIC S9(08) USAGE COMP    VALUE  0296.
003090     05  WK-806-0297-IDX   PIC S9(08) USAGE COMP    VALUE  0297.
003100     05  WK-806-0298-IDX   PIC S9(08) USAGE COMP    VALUE  0298.
003110     05  WK-806-0299-IDX   PIC S9(08) USAGE COMP    VALUE  0299.
003120     05  WK-806-0300-IDX   PIC S9(08) USAGE COMP    VALUE  0300.
003130     05  WK-806-0301-IDX   PIC S9(08) USAGE COMP    VALUE  0301.
003140     05  WK-806-0302-IDX   PIC S9(08) USAGE COMP    VALUE  0302.
003150     05  WK-806-0303-IDX   PIC S9(08) USAGE COMP    VALUE  0303.
003160     05  WK-806-0304-IDX   PIC S9(08) USAGE COMP    VALUE  0304.
003170     05  WK-806-0305-IDX   PIC S9(08) USAGE COMP    VALUE  0305.
003180     05  WK-806-0306-IDX   PIC S9(08) USAGE COMP    VALUE  0306.
003190     05  WK-806-0307-IDX   PIC S9(08) USAGE COMP    VALUE  0307.
003200     05  WK-806-0308-IDX   PIC S9(08) USAGE COMP    VALUE  0308.
003210     05  WK-806-0309-IDX   PIC S9(08) USAGE COMP    VALUE  0309.
003220     05  WK-806-0310-IDX   PIC S9(08) USAGE COMP    VALUE  0310.
003230     05  WK-806-0311-IDX   PIC S9(08) USAGE COMP    VALUE  0311.
003240     05  WK-806-0312-IDX   PIC S9(08) USAGE COMP    VALUE  0312.
003250     05  WK-806-0313-IDX   PIC S9(08) USAGE COMP    VALUE  0313.
003260     05  WK-806-0314-IDX   PIC S9(08) USAGE COMP    VALUE  0314.
003270     05  WK-806-0315-IDX   PIC S9(08) USAGE COMP    VALUE  0315.
003280     05  WK-806-0316-IDX   PIC S9(08) USAGE COMP    VALUE  0316.
003290     05  WK-806-0317-IDX   PIC S9(08) USAGE COMP    VALUE  0317.
003300     05  WK-806-0318-IDX   PIC S9(08) USAGE COMP    VALUE  0318.
003310     05  WK-806-0319-IDX   PIC S9(08) USAGE COMP    VALUE  0319.
003320     05  WK-806-0320-IDX   PIC S9(08) USAGE COMP    VALUE  0320.
003330     05  WK-806-0321-IDX   PIC S9(08) USAGE COMP    VALUE  0321.
003340     05  WK-806-0322-IDX   PIC S9(08) USAGE COMP    VALUE  0322.
003350     05  WK-806-0323-IDX   PIC S9(08) USAGE COMP    VALUE  0323.
003360     05  WK-806-0324-IDX   PIC S9(08) USAGE COMP    VALUE  0324.
003370     05  WK-806-0325-IDX   PIC S9(08) USAGE COMP    VALUE  0325.
003380     05  WK-806-0326-IDX   PIC S9(08) USAGE COMP    VALUE  0326.
003390     05  WK-806-0327-IDX   PIC S9(08) USAGE COMP    VALUE  0327.
003400     05  WK-806-0328-IDX   PIC S9(08) USAGE COMP    VALUE  0328.
003410     05  WK-806-0329-IDX   PIC S9(08) USAGE COMP    VALUE  0329.
003420     05  WK-806-0330-IDX   PIC S9(08) USAGE COMP    VALUE  0330.
003430     05  WK-806-0331-IDX   PIC S9(08) USAGE COMP    VALUE  0331.
003440     05  WK-806-0332-IDX   PIC S9(08) USAGE COMP    VALUE  0332.
003450     05  WK-806-0333-IDX   PIC S9(08) USAGE COMP    VALUE  0333.
003460     05  WK-806-0334-IDX   PIC S9(08) USAGE COMP    VALUE  0334.
003470     05  WK-806-0335-IDX   PIC S9(08) USAGE COMP    VALUE  0335.
003480     05  WK-806-0336-IDX   PIC S9(08) USAGE COMP    VALUE  0336.
003490     05  WK-806-0337-IDX   PIC S9(08) USAGE COMP    VALUE  0337.
003500     05  WK-806-0338-IDX   PIC S9(08) USAGE COMP    VALUE  0338.
003510     05  WK-806-0339-IDX   PIC S9(08) USAGE COMP    VALUE  0339.
003520     05  WK-806-0340-IDX   PIC S9(08) USAGE COMP    VALUE  0340.
003530     05  WK-806-0341-IDX   PIC S9(08) USAGE COMP    VALUE  0341.
003540     05  WK-806-0342-IDX   PIC S9(08) USAGE COMP    VALUE  0342.
003550     05  WK-806-0343-IDX   PIC S9(08) USAGE COMP    VALUE  0343.
003560     05  WK-806-0344-IDX   PIC S9(08) USAGE COMP    VALUE  0344.
003570     05  WK-806-0345-IDX   PIC S9(08) USAGE COMP    VALUE  0345.
003580     05  WK-806-0346-IDX   PIC S9(08) USAGE COMP    VALUE  0346.
003590     05  WK-806-0347-IDX   PIC S9(08) USAGE COMP    VALUE  0347.
003600     05  WK-806-0348-IDX   PIC S9(08) USAGE COMP    VALUE  0348.
003610     05  WK-806-0349-IDX   PIC S9(08) USAGE COMP    VALUE  0349.
003620     05  WK-806-0350-IDX   PIC S9(08) USAGE COMP    VALUE  0350.
003630     05  WK-806-0351-IDX   PIC S9(08) USAGE COMP    VALUE  0351.
003640     05  WK-806-0352-IDX   PIC S9(08) USAGE COMP    VALUE  0352.
003650     05  WK-806-0353-IDX   PIC S9(08) USAGE COMP    VALUE  0353.
003660     05  WK-806-0354-IDX   PIC S9(08) USAGE COMP    VALUE  0354.
003670     05  WK-806-0355-IDX   PIC S9(08) USAGE COMP    VALUE  0355.
003680     05  WK-806-0356-IDX   PIC S9(08) USAGE COMP    VALUE  0356.
003690     05  WK-806-0357-IDX   PIC S9(08) USAGE COMP    VALUE  0357.
003700     05  WK-806-0358-IDX   PIC S9(08) USAGE COMP    VALUE  0358.
003710     05  WK-806-0359-IDX   PIC S9(08) USAGE COMP    VALUE  0359.
003720     05  WK-806-0360-IDX   PIC S9(08) USAGE COMP    VALUE  0360.
003730     05  WK-806-0361-IDX   PIC S9(08) USAGE COMP    VALUE  0361.
003740     05  WK-806-0362-IDX   PIC S9(08) USAGE COMP    VALUE  0362.
003750     05  WK-806-0363-IDX   PIC S9(08) USAGE COMP    VALUE  0363.
003760     05  WK-806-0364-IDX   PIC S9(08) USAGE COMP    VALUE  0364.
003770     05  WK-806-0365-IDX   PIC S9(08) USAGE COMP    VALUE  0365.
003780     05  WK-806-0366-IDX   PIC S9(08) USAGE COMP    VALUE  0366.
003790     05  WK-806-0367-IDX   PIC S9(08) USAGE COMP    VALUE  0367.
003800     05  WK-806-0368-IDX   PIC S9(08) USAGE COMP    VALUE  0368.
003810     05  WK-806-0369-IDX   PIC S9(08) USAGE COMP    VALUE  0369.
003820     05  WK-806-0370-IDX   PIC S9(08) USAGE COMP    VALUE  0370.
003830     05  WK-806-0371-IDX   PIC S9(08) USAGE COMP    VALUE  0371.
003840     05  WK-806-0372-IDX   PIC S9(08) USAGE COMP    VALUE  0372.
003850     05  WK-806-0373-IDX   PIC S9(08) USAGE COMP    VALUE  0373.
003860     05  WK-806-0374-IDX   PIC S9(08) USAGE COMP    VALUE  0374.
003870     05  WK-806-0375-IDX   PIC S9(08) USAGE COMP    VALUE  0375.
003880     05  WK-806-0376-IDX   PIC S9(08) USAGE COMP    VALUE  0376.
003890     05  WK-806-0377-IDX   PIC S9(08) USAGE COMP    VALUE  0377.
003900     05  WK-806-0378-IDX   PIC S9(08) USAGE COMP    VALUE  0378.
003910     05  WK-806-0379-IDX   PIC S9(08) USAGE COMP    VALUE  0379.
003920     05  WK-806-0380-IDX   PIC S9(08) USAGE COMP    VALUE  0380.
003930     05  WK-806-0381-IDX   PIC S9(08) USAGE COMP    VALUE  0381.
003940     05  WK-806-0382-IDX   PIC S9(08) USAGE COMP    VALUE  0382.
003950     05  WK-806-0383-IDX   PIC S9(08) USAGE COMP    VALUE  0383.
003960     05  WK-806-0384-IDX   PIC S9(08) USAGE COMP    VALUE  0384.
003970     05  WK-806-0385-IDX   PIC S9(08) USAGE COMP    VALUE  0385.
003980     05  WK-806-0386-IDX   PIC S9(08) USAGE COMP    VALUE  0386.
003990     05  WK-806-0387-IDX   PIC S9(08) USAGE COMP    VALUE  0387.
004000     05  WK-806-0388-IDX   PIC S9(08) USAGE COMP    VALUE  0388.
004010     05  WK-806-0389-IDX   PIC S9(08) USAGE COMP    VALUE  0389.
004020     05  WK-806-0390-IDX   PIC S9(08) USAGE COMP    VALUE  0390.
004030     05  WK-806-0391-IDX   PIC S9(08) USAGE COMP    VALUE  0391.
004040     05  WK-806-0392-IDX   PIC S9(08) USAGE COMP    VALUE  0392.
004050     05  WK-806-0393-IDX   PIC S9(08) USAGE COMP    VALUE  0393.
004060     05  WK-806-0394-IDX   PIC S9(08) USAGE COMP    VALUE  0394.
004070     05  WK-806-0395-IDX   PIC S9(08) USAGE COMP    VALUE  0395.
004080     05  WK-806-0396-IDX   PIC S9(08) USAGE COMP    VALUE  0396.
004090     05  WK-806-0397-IDX   PIC S9(08) USAGE COMP    VALUE  0397.
004100     05  WK-806-0398-IDX   PIC S9(08) USAGE COMP    VALUE  0398.
004110     05  WK-806-0399-IDX   PIC S9(08) USAGE COMP    VALUE  0399.
004120     05  WK-806-0400-IDX   PIC S9(08) USAGE COMP    VALUE  0400.
004130     05  WK-806-0401-IDX   PIC S9(08) USAGE COMP    VALUE  0401.
004140     05  WK-806-0402-IDX   PIC S9(08) USAGE COMP    VALUE  0402.
004150     05  WK-806-0403-IDX   PIC S9(08) USAGE COMP    VALUE  0403.
004160     05  WK-806-0404-IDX   PIC S9(08) USAGE COMP    VALUE  0404.
004170     05  WK-806-0405-IDX   PIC S9(08) USAGE COMP    VALUE  0405.
004180     05  WK-806-0406-IDX   PIC S9(08) USAGE COMP    VALUE  0406.
004190     05  WK-806-0407-IDX   PIC S9(08) USAGE COMP    VALUE  0407.
004200     05  WK-806-0408-IDX   PIC S9(08) USAGE COMP    VALUE  0408.
004210     05  WK-806-0409-IDX   PIC S9(08) USAGE COMP    VALUE  0409.
004220     05  WK-806-0410-IDX   PIC S9(08) USAGE COMP    VALUE  0410.
004230     05  WK-806-0411-IDX   PIC S9(08) USAGE COMP    VALUE  0411.
004240     05  WK-806-0412-IDX   PIC S9(08) USAGE COMP    VALUE  0412.
004250     05  WK-806-0413-IDX   PIC S9(08) USAGE COMP    VALUE  0413.
004260     05  WK-806-0414-IDX   PIC S9(08) USAGE COMP    VALUE  0414.
004270     05  WK-806-0415-IDX   PIC S9(08) USAGE COMP    VALUE  0415.
004280     05  WK-806-0416-IDX   PIC S9(08) USAGE COMP    VALUE  0416.
004290     05  WK-806-0417-IDX   PIC S9(08) USAGE COMP    VALUE  0417.
004300     05  WK-806-0418-IDX   PIC S9(08) USAGE COMP    VALUE  0418.
004310     05  WK-806-0419-IDX   PIC S9(08) USAGE COMP    VALUE  0419.
004320     05  WK-806-0420-IDX   PIC S9(08) USAGE COMP    VALUE  0420.
004330     05  WK-806-0421-IDX   PIC S9(08) USAGE COMP    VALUE  0421.
004340     05  WK-806-0422-IDX   PIC S9(08) USAGE COMP    VALUE  0422.
004350     05  WK-806-0423-IDX   PIC S9(08) USAGE COMP    VALUE  0423.
004360     05  WK-806-0424-IDX   PIC S9(08) USAGE COMP    VALUE  0424.
004370     05  WK-806-0425-IDX   PIC S9(08) USAGE COMP    VALUE  0425.
004380     05  WK-806-0426-IDX   PIC S9(08) USAGE COMP    VALUE  0426.
004390     05  WK-806-0427-IDX   PIC S9(08) USAGE COMP    VALUE  0427.
004400     05  WK-806-0428-IDX   PIC S9(08) USAGE COMP    VALUE  0428.
004410     05  WK-806-0429-IDX   PIC S9(08) USAGE COMP    VALUE  0429.
004420     05  WK-806-0430-IDX   PIC S9(08) USAGE COMP    VALUE  0430.
004430     05  WK-806-0431-IDX   PIC S9(08) USAGE COMP    VALUE  0431.
004440     05  WK-806-0432-IDX   PIC S9(08) USAGE COMP    VALUE  0432.
004450     05  WK-806-0433-IDX   PIC S9(08) USAGE COMP    VALUE  0433.
004460     05  WK-806-0434-IDX   PIC S9(08) USAGE COMP    VALUE  0434.
004470     05  WK-806-0435-IDX   PIC S9(08) USAGE COMP    VALUE  0435.
004480     05  WK-806-0436-IDX   PIC S9(08) USAGE COMP    VALUE  0436.
004490     05  WK-806-0437-IDX   PIC S9(08) USAGE COMP    VALUE  0437.
004500     05  WK-806-0438-IDX   PIC S9(08) USAGE COMP    VALUE  0438.
004510     05  WK-806-0439-IDX   PIC S9(08) USAGE COMP    VALUE  0439.
004520     05  WK-806-0440-IDX   PIC S9(08) USAGE COMP    VALUE  0440.
004530     05  WK-806-0441-IDX   PIC S9(08) USAGE COMP    VALUE  0441.
004540     05  WK-806-0442-IDX   PIC S9(08) USAGE COMP    VALUE  0442.
004550     05  WK-806-0443-IDX   PIC S9(08) USAGE COMP    VALUE  0443.
004560     05  WK-806-0444-IDX   PIC S9(08) USAGE COMP    VALUE  0444.
004570     05  WK-806-0445-IDX   PIC S9(08) USAGE COMP    VALUE  0445.
004580     05  WK-806-0446-IDX   PIC S9(08) USAGE COMP    VALUE  0446.
004590     05  WK-806-0447-IDX   PIC S9(08) USAGE COMP    VALUE  0447.
004600     05  WK-806-0448-IDX   PIC S9(08) USAGE COMP    VALUE  0448.
004610     05  WK-806-0449-IDX   PIC S9(08) USAGE COMP    VALUE  0449.
004620     05  WK-806-0450-IDX   PIC S9(08) USAGE COMP    VALUE  0450.
004630     05  WK-806-0451-IDX   PIC S9(08) USAGE COMP    VALUE  0451.
004640     05  WK-806-0452-IDX   PIC S9(08) USAGE COMP    VALUE  0452.
004650     05  WK-806-0453-IDX   PIC S9(08) USAGE COMP    VALUE  0453.
004660     05  WK-806-0454-IDX   PIC S9(08) USAGE COMP    VALUE  0454.
004670     05  WK-806-0455-IDX   PIC S9(08) USAGE COMP    VALUE  0455.
004680     05  WK-806-0456-IDX   PIC S9(08) USAGE COMP    VALUE  0456.
004690     05  WK-806-0457-IDX   PIC S9(08) USAGE COMP    VALUE  0457.
004700     05  WK-806-0458-IDX   PIC S9(08) USAGE COMP    VALUE  0458.
004710     05  WK-806-0459-IDX   PIC S9(08) USAGE COMP    VALUE  0459.
004720     05  WK-806-0460-IDX   PIC S9(08) USAGE COMP    VALUE  0460.
004730     05  WK-806-0461-IDX   PIC S9(08) USAGE COMP    VALUE  0461.
004740     05  WK-806-0462-IDX   PIC S9(08) USAGE COMP    VALUE  0462.
004750     05  WK-806-0463-IDX   PIC S9(08) USAGE COMP    VALUE  0463.
004760     05  WK-806-0464-IDX   PIC S9(08) USAGE COMP    VALUE  0464.
004770     05  WK-806-0465-IDX   PIC S9(08) USAGE COMP    VALUE  0465.
004780     05  WK-806-0466-IDX   PIC S9(08) USAGE COMP    VALUE  0466.
004790     05  WK-806-0467-IDX   PIC S9(08) USAGE COMP    VALUE  0467.
004800     05  WK-806-0468-IDX   PIC S9(08) USAGE COMP    VALUE  0468.
004810     05  WK-806-0469-IDX   PIC S9(08) USAGE COMP    VALUE  0469.
004820     05  WK-806-0470-IDX   PIC S9(08) USAGE COMP    VALUE  0470.
004830     05  WK-806-0471-IDX   PIC S9(08) USAGE COMP    VALUE  0471.
004840     05  WK-806-0472-IDX   PIC S9(08) USAGE COMP    VALUE  0472.
004850     05  WK-806-0473-IDX   PIC S9(08) USAGE COMP    VALUE  0473.
004860     05  WK-806-0474-IDX   PIC S9(08) USAGE COMP    VALUE  0474.
004870     05  WK-806-0475-IDX   PIC S9(08) USAGE COMP    VALUE  0475.
004880     05  WK-806-0476-IDX   PIC S9(08) USAGE COMP    VALUE  0476.
004890     05  WK-806-0477-IDX   PIC S9(08) USAGE COMP    VALUE  0477.
004900     05  WK-806-0478-IDX   PIC S9(08) USAGE COMP    VALUE  0478.
004910     05  WK-806-0479-IDX   PIC S9(08) USAGE COMP    VALUE  0479.
004920     05  WK-806-0480-IDX   PIC S9(08) USAGE COMP    VALUE  0480.
004930     05  WK-806-0481-IDX   PIC S9(08) USAGE COMP    VALUE  0481.
004940     05  WK-806-0482-IDX   PIC S9(08) USAGE COMP    VALUE  0482.
004950     05  WK-806-0483-IDX   PIC S9(08) USAGE COMP    VALUE  0483.
004960     05  WK-806-0484-IDX   PIC S9(08) USAGE COMP    VALUE  0484.
004970     05  WK-806-0485-IDX   PIC S9(08) USAGE COMP    VALUE  0485.
004980     05  WK-806-0486-IDX   PIC S9(08) USAGE COMP    VALUE  0486.
004990     05  WK-806-0487-IDX   PIC S9(08) USAGE COMP    VALUE  0487.
005000     05  WK-806-0488-IDX   PIC S9(08) USAGE COMP    VALUE  0488.
005010     05  WK-806-0489-IDX   PIC S9(08) USAGE COMP    VALUE  0489.
005020     05  WK-806-0490-IDX   PIC S9(08) USAGE COMP    VALUE  0490.
005030     05  WK-806-0491-IDX   PIC S9(08) USAGE COMP    VALUE  0491.
005040     05  WK-806-0492-IDX   PIC S9(08) USAGE COMP    VALUE  0492.
005050     05  WK-806-0493-IDX   PIC S9(08) USAGE COMP    VALUE  0493.
005060     05  WK-806-0494-IDX   PIC S9(08) USAGE COMP    VALUE  0494.
005070     05  WK-806-0495-IDX   PIC S9(08) USAGE COMP    VALUE  0495.
005080     05  WK-806-0496-IDX   PIC S9(08) USAGE COMP    VALUE  0496.
005090     05  WK-806-0497-IDX   PIC S9(08) USAGE COMP    VALUE  0497.
005100     05  WK-806-0498-IDX   PIC S9(08) USAGE COMP    VALUE  0498.
005110     05  WK-806-0499-IDX   PIC S9(08) USAGE COMP    VALUE  0499.
005120     05  WK-806-0500-IDX   PIC S9(08) USAGE COMP    VALUE  0500.
005130     05  WK-806-0501-IDX   PIC S9(08) USAGE COMP    VALUE  0501.
005140     05  WK-806-0502-IDX   PIC S9(08) USAGE COMP    VALUE  0502.
005150     05  WK-806-0503-IDX   PIC S9(08) USAGE COMP    VALUE  0503.
005160     05  WK-806-0504-IDX   PIC S9(08) USAGE COMP    VALUE  0504.
005170     05  WK-806-0505-IDX   PIC S9(08) USAGE COMP    VALUE  0505.
005180     05  WK-806-0506-IDX   PIC S9(08) USAGE COMP    VALUE  0506.
005190     05  WK-806-0507-IDX   PIC S9(08) USAGE COMP    VALUE  0507.
005200     05  WK-806-0508-IDX   PIC S9(08) USAGE COMP    VALUE  0508.
005210     05  WK-806-0509-IDX   PIC S9(08) USAGE COMP    VALUE  0509.
005220     05  WK-806-0510-IDX   PIC S9(08) USAGE COMP    VALUE  0510.
005230     05  WK-806-0511-IDX   PIC S9(08) USAGE COMP    VALUE  0511.
005240     05  WK-806-0512-IDX   PIC S9(08) USAGE COMP    VALUE  0512.
005250     05  WK-806-0513-IDX   PIC S9(08) USAGE COMP    VALUE  0513.
005260     05  WK-806-0514-IDX   PIC S9(08) USAGE COMP    VALUE  0514.
005270     05  WK-806-0515-IDX   PIC S9(08) USAGE COMP    VALUE  0515.
005280     05  WK-806-0516-IDX   PIC S9(08) USAGE COMP    VALUE  0516.
005290     05  WK-806-0517-IDX   PIC S9(08) USAGE COMP    VALUE  0517.
005300     05  WK-806-0518-IDX   PIC S9(08) USAGE COMP    VALUE  0518.
005310     05  WK-806-0519-IDX   PIC S9(08) USAGE COMP    VALUE  0519.
005320     05  WK-806-0520-IDX   PIC S9(08) USAGE COMP    VALUE  0520.
005330     05  WK-806-0521-IDX   PIC S9(08) USAGE COMP    VALUE  0521.
005340     05  WK-806-0522-IDX   PIC S9(08) USAGE COMP    VALUE  0522.
005350     05  WK-806-0523-IDX   PIC S9(08) USAGE COMP    VALUE  0523.
005360     05  WK-806-0524-IDX   PIC S9(08) USAGE COMP    VALUE  0524.
005370     05  WK-806-0525-IDX   PIC S9(08) USAGE COMP    VALUE  0525.
005380     05  WK-806-0526-IDX   PIC S9(08) USAGE COMP    VALUE  0526.
005390     05  WK-806-0527-IDX   PIC S9(08) USAGE COMP    VALUE  0527.
005400     05  WK-806-0528-IDX   PIC S9(08) USAGE COMP    VALUE  0528.
005410     05  WK-806-0529-IDX   PIC S9(08) USAGE COMP    VALUE  0529.
005420     05  WK-806-0530-IDX   PIC S9(08) USAGE COMP    VALUE  0530.
005430     05  WK-806-0531-IDX   PIC S9(08) USAGE COMP    VALUE  0531.
005440     05  WK-806-0532-IDX   PIC S9(08) USAGE COMP    VALUE  0532.
005450     05  WK-806-0533-IDX   PIC S9(08) USAGE COMP    VALUE  0533.
005460     05  WK-806-0534-IDX   PIC S9(08) USAGE COMP    VALUE  0534.
005470     05  WK-806-0535-IDX   PIC S9(08) USAGE COMP    VALUE  0535.
005480     05  WK-806-0536-IDX   PIC S9(08) USAGE COMP    VALUE  0536.
005490     05  WK-806-0537-IDX   PIC S9(08) USAGE COMP    VALUE  0537.
005500     05  WK-806-0538-IDX   PIC S9(08) USAGE COMP    VALUE  0538.
005510     05  WK-806-0539-IDX   PIC S9(08) USAGE COMP    VALUE  0539.
005520     05  WK-806-0540-IDX   PIC S9(08) USAGE COMP    VALUE  0540.
005530     05  WK-806-0541-IDX   PIC S9(08) USAGE COMP    VALUE  0541.
005540     05  WK-806-0542-IDX   PIC S9(08) USAGE COMP    VALUE  0542.
005550     05  WK-806-0543-IDX   PIC S9(08) USAGE COMP    VALUE  0543.
005560     05  WK-806-0544-IDX   PIC S9(08) USAGE COMP    VALUE  0544.
005570     05  WK-806-0545-IDX   PIC S9(08) USAGE COMP    VALUE  0545.
005580     05  WK-806-0546-IDX   PIC S9(08) USAGE COMP    VALUE  0546.
005590     05  WK-806-0547-IDX   PIC S9(08) USAGE COMP    VALUE  0547.
005600     05  WK-806-0548-IDX   PIC S9(08) USAGE COMP    VALUE  0548.
005610     05  WK-806-0549-IDX   PIC S9(08) USAGE COMP    VALUE  0549.
005620     05  WK-806-0550-IDX   PIC S9(08) USAGE COMP    VALUE  0550.
005630     05  WK-806-0551-IDX   PIC S9(08) USAGE COMP    VALUE  0551.
005640     05  WK-806-0552-IDX   PIC S9(08) USAGE COMP    VALUE  0552.
005650     05  WK-806-0553-IDX   PIC S9(08) USAGE COMP    VALUE  0553.
005660     05  WK-806-0554-IDX   PIC S9(08) USAGE COMP    VALUE  0554.
005670     05  WK-806-0555-IDX   PIC S9(08) USAGE COMP    VALUE  0555.
005680     05  WK-806-0556-IDX   PIC S9(08) USAGE COMP    VALUE  0556.
005690     05  WK-806-0557-IDX   PIC S9(08) USAGE COMP    VALUE  0557.
005700     05  WK-806-0558-IDX   PIC S9(08) USAGE COMP    VALUE  0558.
005710     05  WK-806-0559-IDX   PIC S9(08) USAGE COMP    VALUE  0559.
005720     05  WK-806-0560-IDX   PIC S9(08) USAGE COMP    VALUE  0560.
005730     05  WK-806-0561-IDX   PIC S9(08) USAGE COMP    VALUE  0561.
005740     05  WK-806-0562-IDX   PIC S9(08) USAGE COMP    VALUE  0562.
005750     05  WK-806-0563-IDX   PIC S9(08) USAGE COMP    VALUE  0563.
005760     05  WK-806-0564-IDX   PIC S9(08) USAGE COMP    VALUE  0564.
005770     05  WK-806-0565-IDX   PIC S9(08) USAGE COMP    VALUE  0565.
005780     05  WK-806-0566-IDX   PIC S9(08) USAGE COMP    VALUE  0566.
005790     05  WK-806-0567-IDX   PIC S9(08) USAGE COMP    VALUE  0567.
005800     05  WK-806-0568-IDX   PIC S9(08) USAGE COMP    VALUE  0568.
005810     05  WK-806-0569-IDX   PIC S9(08) USAGE COMP    VALUE  0569.
005820     05  WK-806-0570-IDX   PIC S9(08) USAGE COMP    VALUE  0570.
005830     05  WK-806-0571-IDX   PIC S9(08) USAGE COMP    VALUE  0571.
005840     05  WK-806-0572-IDX   PIC S9(08) USAGE COMP    VALUE  0572.
005850     05  WK-806-0573-IDX   PIC S9(08) USAGE COMP    VALUE  0573.
005860     05  WK-806-0574-IDX   PIC S9(08) USAGE COMP    VALUE  0574.
005870     05  WK-806-0575-IDX   PIC S9(08) USAGE COMP    VALUE  0575.
005880     05  WK-806-0576-IDX   PIC S9(08) USAGE COMP    VALUE  0576.
005890     05  WK-806-0577-IDX   PIC S9(08) USAGE COMP    VALUE  0577.
005900     05  WK-806-0578-IDX   PIC S9(08) USAGE COMP    VALUE  0578.
005910     05  WK-806-0579-IDX   PIC S9(08) USAGE COMP    VALUE  0579.
005920     05  WK-806-0580-IDX   PIC S9(08) USAGE COMP    VALUE  0580.
005930     05  WK-806-0581-IDX   PIC S9(08) USAGE COMP    VALUE  0581.
005940     05  WK-806-0582-IDX   PIC S9(08) USAGE COMP    VALUE  0582.
005950     05  WK-806-0583-IDX   PIC S9(08) USAGE COMP    VALUE  0583.
005960     05  WK-806-0584-IDX   PIC S9(08) USAGE COMP    VALUE  0584.
005970     05  WK-806-0585-IDX   PIC S9(08) USAGE COMP    VALUE  0585.
005980     05  WK-806-0586-IDX   PIC S9(08) USAGE COMP    VALUE  0586.
005990     05  WK-806-0587-IDX   PIC S9(08) USAGE COMP    VALUE  0587.
006000     05  WK-806-0588-IDX   PIC S9(08) USAGE COMP    VALUE  0588.
006010     05  WK-806-0589-IDX   PIC S9(08) USAGE COMP    VALUE  0589.
006020     05  WK-806-0590-IDX   PIC S9(08) USAGE COMP    VALUE  0590.
006030     05  WK-806-0591-IDX   PIC S9(08) USAGE COMP    VALUE  0591.
006040     05  WK-806-0592-IDX   PIC S9(08) USAGE COMP    VALUE  0592.
006050     05  WK-806-0593-IDX   PIC S9(08) USAGE COMP    VALUE  0593.
006060     05  WK-806-0594-IDX   PIC S9(08) USAGE COMP    VALUE  0594.
006070     05  WK-806-0595-IDX   PIC S9(08) USAGE COMP    VALUE  0595.
006080     05  WK-806-0596-IDX   PIC S9(08) USAGE COMP    VALUE  0596.
006090     05  WK-806-0597-IDX   PIC S9(08) USAGE COMP    VALUE  0597.
006100     05  WK-806-0598-IDX   PIC S9(08) USAGE COMP    VALUE  0598.
006110     05  WK-806-0599-IDX   PIC S9(08) USAGE COMP    VALUE  0599.
006120     05  WK-806-0600-IDX   PIC S9(08) USAGE COMP    VALUE  0600.
006130     05  WK-806-0601-IDX   PIC S9(08) USAGE COMP    VALUE  0601.
006140     05  WK-806-0602-IDX   PIC S9(08) USAGE COMP    VALUE  0602.
006150     05  WK-806-0603-IDX   PIC S9(08) USAGE COMP    VALUE  0603.
006160     05  WK-806-0604-IDX   PIC S9(08) USAGE COMP    VALUE  0604.
006170     05  WK-806-0605-IDX   PIC S9(08) USAGE COMP    VALUE  0605.
006180     05  WK-806-0606-IDX   PIC S9(08) USAGE COMP    VALUE  0606.
006190     05  WK-806-0607-IDX   PIC S9(08) USAGE COMP    VALUE  0607.
006200     05  WK-806-0608-IDX   PIC S9(08) USAGE COMP    VALUE  0608.
006210     05  WK-806-0609-IDX   PIC S9(08) USAGE COMP    VALUE  0609.
006220     05  WK-806-0610-IDX   PIC S9(08) USAGE COMP    VALUE  0610.
006230     05  WK-806-0611-IDX   PIC S9(08) USAGE COMP    VALUE  0611.
006240     05  WK-806-0612-IDX   PIC S9(08) USAGE COMP    VALUE  0612.
006250     05  WK-806-0613-IDX   PIC S9(08) USAGE COMP    VALUE  0613.
006260     05  WK-806-0614-IDX   PIC S9(08) USAGE COMP    VALUE  0614.
006270     05  WK-806-0615-IDX   PIC S9(08) USAGE COMP    VALUE  0615.
006280     05  WK-806-0616-IDX   PIC S9(08) USAGE COMP    VALUE  0616.
006290     05  WK-806-0617-IDX   PIC S9(08) USAGE COMP    VALUE  0617.
006300     05  WK-806-0618-IDX   PIC S9(08) USAGE COMP    VALUE  0618.
006310     05  WK-806-0619-IDX   PIC S9(08) USAGE COMP    VALUE  0619.
006320     05  WK-806-0620-IDX   PIC S9(08) USAGE COMP    VALUE  0620.
006330     05  WK-806-0621-IDX   PIC S9(08) USAGE COMP    VALUE  0621.
006340     05  WK-806-0622-IDX   PIC S9(08) USAGE COMP    VALUE  0622.
006350     05  WK-806-0623-IDX   PIC S9(08) USAGE COMP    VALUE  0623.
006360     05  WK-806-0624-IDX   PIC S9(08) USAGE COMP    VALUE  0624.
006370     05  WK-806-0625-IDX   PIC S9(08) USAGE COMP    VALUE  0625.
006380     05  WK-806-0626-IDX   PIC S9(08) USAGE COMP    VALUE  0626.
006390     05  WK-806-0627-IDX   PIC S9(08) USAGE COMP    VALUE  0627.
006400     05  WK-806-0628-IDX   PIC S9(08) USAGE COMP    VALUE  0628.
006410     05  WK-806-0629-IDX   PIC S9(08) USAGE COMP    VALUE  0629.
006420     05  WK-806-0630-IDX   PIC S9(08) USAGE COMP    VALUE  0630.
006430     05  WK-806-0631-IDX   PIC S9(08) USAGE COMP    VALUE  0631.
006440     05  WK-806-0632-IDX   PIC S9(08) USAGE COMP    VALUE  0632.
006450     05  WK-806-0633-IDX   PIC S9(08) USAGE COMP    VALUE  0633.
006460     05  WK-806-0634-IDX   PIC S9(08) USAGE COMP    VALUE  0634.
006470     05  WK-806-0635-IDX   PIC S9(08) USAGE COMP    VALUE  0635.
006480     05  WK-806-0636-IDX   PIC S9(08) USAGE COMP    VALUE  0636.
006490     05  WK-806-0637-IDX   PIC S9(08) USAGE COMP    VALUE  0637.
006500     05  WK-806-0638-IDX   PIC S9(08) USAGE COMP    VALUE  0638.
006510     05  WK-806-0639-IDX   PIC S9(08) USAGE COMP    VALUE  0639.
006520     05  WK-806-0640-IDX   PIC S9(08) USAGE COMP    VALUE  0640.
006530     05  WK-806-0641-IDX   PIC S9(08) USAGE COMP    VALUE  0641.
006540     05  WK-806-0642-IDX   PIC S9(08) USAGE COMP    VALUE  0642.
006550     05  WK-806-0643-IDX   PIC S9(08) USAGE COMP    VALUE  0643.
006560     05  WK-806-0644-IDX   PIC S9(08) USAGE COMP    VALUE  0644.
006570     05  WK-806-0645-IDX   PIC S9(08) USAGE COMP    VALUE  0645.
006580     05  WK-806-0646-IDX   PIC S9(08) USAGE COMP    VALUE  0646.
006590     05  WK-806-0647-IDX   PIC S9(08) USAGE COMP    VALUE  0647.
006600     05  WK-806-0648-IDX   PIC S9(08) USAGE COMP    VALUE  0648.
006610     05  WK-806-0649-IDX   PIC S9(08) USAGE COMP    VALUE  0649.
006620     05  WK-806-0650-IDX   PIC S9(08) USAGE COMP    VALUE  0650.
006630     05  WK-806-0651-IDX   PIC S9(08) USAGE COMP    VALUE  0651.
006640     05  WK-806-0652-IDX   PIC S9(08) USAGE COMP    VALUE  0652.
006650     05  WK-806-0653-IDX   PIC S9(08) USAGE COMP    VALUE  0653.
006660     05  WK-806-0654-IDX   PIC S9(08) USAGE COMP    VALUE  0654.
006670     05  WK-806-0655-IDX   PIC S9(08) USAGE COMP    VALUE  0655.
006680     05  WK-806-0656-IDX   PIC S9(08) USAGE COMP    VALUE  0656.
006690     05  WK-806-0657-IDX   PIC S9(08) USAGE COMP    VALUE  0657.
006700     05  WK-806-0658-IDX   PIC S9(08) USAGE COMP    VALUE  0658.
006710     05  WK-806-0659-IDX   PIC S9(08) USAGE COMP    VALUE  0659.
006720     05  WK-806-0660-IDX   PIC S9(08) USAGE COMP    VALUE  0660.
006730     05  WK-806-0661-IDX   PIC S9(08) USAGE COMP    VALUE  0661.
006740     05  WK-806-0662-IDX   PIC S9(08) USAGE COMP    VALUE  0662.
006750     05  WK-806-0663-IDX   PIC S9(08) USAGE COMP    VALUE  0663.
006760     05  WK-806-0664-IDX   PIC S9(08) USAGE COMP    VALUE  0664.
006770     05  WK-806-0665-IDX   PIC S9(08) USAGE COMP    VALUE  0665.
006780     05  WK-806-0666-IDX   PIC S9(08) USAGE COMP    VALUE  0666.
006790     05  WK-806-0667-IDX   PIC S9(08) USAGE COMP    VALUE  0667.
006800     05  WK-806-0668-IDX   PIC S9(08) USAGE COMP    VALUE  0668.
006810     05  WK-806-0669-IDX   PIC S9(08) USAGE COMP    VALUE  0669.
006820     05  WK-806-0670-IDX   PIC S9(08) USAGE COMP    VALUE  0670.
006830     05  WK-806-0671-IDX   PIC S9(08) USAGE COMP    VALUE  0671.
006840     05  WK-806-0672-IDX   PIC S9(08) USAGE COMP    VALUE  0672.
006850     05  WK-806-0673-IDX   PIC S9(08) USAGE COMP    VALUE  0673.
006860     05  WK-806-0674-IDX   PIC S9(08) USAGE COMP    VALUE  0674.
006870     05  WK-806-0675-IDX   PIC S9(08) USAGE COMP    VALUE  0675.
006880     05  WK-806-0676-IDX   PIC S9(08) USAGE COMP    VALUE  0676.
006890     05  WK-806-0677-IDX   PIC S9(08) USAGE COMP    VALUE  0677.
006900     05  WK-806-0678-IDX   PIC S9(08) USAGE COMP    VALUE  0678.
006910     05  WK-806-0679-IDX   PIC S9(08) USAGE COMP    VALUE  0679.
006920     05  WK-806-0680-IDX   PIC S9(08) USAGE COMP    VALUE  0680.
006930     05  WK-806-0681-IDX   PIC S9(08) USAGE COMP    VALUE  0681.
006940     05  WK-806-0682-IDX   PIC S9(08) USAGE COMP    VALUE  0682.
006950     05  WK-806-0683-IDX   PIC S9(08) USAGE COMP    VALUE  0683.
006960     05  WK-806-0684-IDX   PIC S9(08) USAGE COMP    VALUE  0684.
006970     05  WK-806-0685-IDX   PIC S9(08) USAGE COMP    VALUE  0685.
006980     05  WK-806-0686-IDX   PIC S9(08) USAGE COMP    VALUE  0686.
006990     05  WK-806-0687-IDX   PIC S9(08) USAGE COMP    VALUE  0687.
007000     05  WK-806-0688-IDX   PIC S9(08) USAGE COMP    VALUE  0688.
007010     05  WK-806-0689-IDX   PIC S9(08) USAGE COMP    VALUE  0689.
007020     05  WK-806-0690-IDX   PIC S9(08) USAGE COMP    VALUE  0690.
007030     05  WK-806-0691-IDX   PIC S9(08) USAGE COMP    VALUE  0691.
007040     05  WK-806-0692-IDX   PIC S9(08) USAGE COMP    VALUE  0692.
007050     05  WK-806-0693-IDX   PIC S9(08) USAGE COMP    VALUE  0693.
007060     05  WK-806-0694-IDX   PIC S9(08) USAGE COMP    VALUE  0694.
007070     05  WK-806-0695-IDX   PIC S9(08) USAGE COMP    VALUE  0695.
007080     05  WK-806-0696-IDX   PIC S9(08) USAGE COMP    VALUE  0696.
007090     05  WK-806-0697-IDX   PIC S9(08) USAGE COMP    VALUE  0697.
007100     05  WK-806-0698-IDX   PIC S9(08) USAGE COMP    VALUE  0698.
007110     05  WK-806-0699-IDX   PIC S9(08) USAGE COMP    VALUE  0699.
007120     05  WK-806-0700-IDX   PIC S9(08) USAGE COMP    VALUE  0700.
007130     05  WK-806-0701-IDX   PIC S9(08) USAGE COMP    VALUE  0701.
007140     05  WK-806-0702-IDX   PIC S9(08) USAGE COMP    VALUE  0702.
007150     05  WK-806-0703-IDX   PIC S9(08) USAGE COMP    VALUE  0703.
007160     05  WK-806-0704-IDX   PIC S9(08) USAGE COMP    VALUE  0704.
007170     05  WK-806-0705-IDX   PIC S9(08) USAGE COMP    VALUE  0705.
007180     05  WK-806-0706-IDX   PIC S9(08) USAGE COMP    VALUE  0706.
007190     05  WK-806-0707-IDX   PIC S9(08) USAGE COMP    VALUE  0707.
007200     05  WK-806-0708-IDX   PIC S9(08) USAGE COMP    VALUE  0708.
007210     05  WK-806-0709-IDX   PIC S9(08) USAGE COMP    VALUE  0709.
007220     05  WK-806-0710-IDX   PIC S9(08) USAGE COMP    VALUE  0710.
007230     05  WK-806-0711-IDX   PIC S9(08) USAGE COMP    VALUE  0711.
007240     05  WK-806-0712-IDX   PIC S9(08) USAGE COMP    VALUE  0712.
007250     05  WK-806-0713-IDX   PIC S9(08) USAGE COMP    VALUE  0713.
007260     05  WK-806-0714-IDX   PIC S9(08) USAGE COMP    VALUE  0714.
007270     05  WK-806-0715-IDX   PIC S9(08) USAGE COMP    VALUE  0715.
007280     05  WK-806-0716-IDX   PIC S9(08) USAGE COMP    VALUE  0716.
007290     05  WK-806-0717-IDX   PIC S9(08) USAGE COMP    VALUE  0717.
007300     05  WK-806-0718-IDX   PIC S9(08) USAGE COMP    VALUE  0718.
007310     05  WK-806-0719-IDX   PIC S9(08) USAGE COMP    VALUE  0719.
007320     05  WK-806-0720-IDX   PIC S9(08) USAGE COMP    VALUE  0720.
007330     05  WK-806-0721-IDX   PIC S9(08) USAGE COMP    VALUE  0721.
007340     05  WK-806-0722-IDX   PIC S9(08) USAGE COMP    VALUE  0722.
007350     05  WK-806-0723-IDX   PIC S9(08) USAGE COMP    VALUE  0723.
007360     05  WK-806-0724-IDX   PIC S9(08) USAGE COMP    VALUE  0724.
007370     05  WK-806-0725-IDX   PIC S9(08) USAGE COMP    VALUE  0725.
007380     05  WK-806-0726-IDX   PIC S9(08) USAGE COMP    VALUE  0726.
007390     05  WK-806-0727-IDX   PIC S9(08) USAGE COMP    VALUE  0727.
007400     05  WK-806-0728-IDX   PIC S9(08) USAGE COMP    VALUE  0728.
007410     05  WK-806-0729-IDX   PIC S9(08) USAGE COMP    VALUE  0729.
007420     05  WK-806-0730-IDX   PIC S9(08) USAGE COMP    VALUE  0730.
007430     05  WK-806-0731-IDX   PIC S9(08) USAGE COMP    VALUE  0731.
007440     05  WK-806-0732-IDX   PIC S9(08) USAGE COMP    VALUE  0732.
007450     05  WK-806-0733-IDX   PIC S9(08) USAGE COMP    VALUE  0733.
007460     05  WK-806-0734-IDX   PIC S9(08) USAGE COMP    VALUE  0734.
007470     05  WK-806-0735-IDX   PIC S9(08) USAGE COMP    VALUE  0735.
007480     05  WK-806-0736-IDX   PIC S9(08) USAGE COMP    VALUE  0736.
007490     05  WK-806-0737-IDX   PIC S9(08) USAGE COMP    VALUE  0737.
007500     05  WK-806-0738-IDX   PIC S9(08) USAGE COMP    VALUE  0738.
007510     05  WK-806-0739-IDX   PIC S9(08) USAGE COMP    VALUE  0739.
007520     05  WK-806-0740-IDX   PIC S9(08) USAGE COMP    VALUE  0740.
007530     05  WK-806-0741-IDX   PIC S9(08) USAGE COMP    VALUE  0741.
007540     05  WK-806-0742-IDX   PIC S9(08) USAGE COMP    VALUE  0742.
007550     05  WK-806-0743-IDX   PIC S9(08) USAGE COMP    VALUE  0743.
007560     05  WK-806-0744-IDX   PIC S9(08) USAGE COMP    VALUE  0744.
007570     05  WK-806-0745-IDX   PIC S9(08) USAGE COMP    VALUE  0745.
007580     05  WK-806-0746-IDX   PIC S9(08) USAGE COMP    VALUE  0746.
007590     05  WK-806-0747-IDX   PIC S9(08) USAGE COMP    VALUE  0747.
007600     05  WK-806-0748-IDX   PIC S9(08) USAGE COMP    VALUE  0748.
007610     05  WK-806-0749-IDX   PIC S9(08) USAGE COMP    VALUE  0749.
007620     05  WK-806-0750-IDX   PIC S9(08) USAGE COMP    VALUE  0750.
007630     05  WK-806-0751-IDX   PIC S9(08) USAGE COMP    VALUE  0751.
007640     05  WK-806-0752-IDX   PIC S9(08) USAGE COMP    VALUE  0752.
007650     05  WK-806-0753-IDX   PIC S9(08) USAGE COMP    VALUE  0753.
007660     05  WK-806-0754-IDX   PIC S9(08) USAGE COMP    VALUE  0754.
007670     05  WK-806-0755-IDX   PIC S9(08) USAGE COMP    VALUE  0755.
007680     05  WK-806-0756-IDX   PIC S9(08) USAGE COMP    VALUE  0756.
007690     05  WK-806-0757-IDX   PIC S9(08) USAGE COMP    VALUE  0757.
007700     05  WK-806-0758-IDX   PIC S9(08) USAGE COMP    VALUE  0758.
007710     05  WK-806-0759-IDX   PIC S9(08) USAGE COMP    VALUE  0759.
007720     05  WK-806-0760-IDX   PIC S9(08) USAGE COMP    VALUE  0760.
007730     05  WK-806-0761-IDX   PIC S9(08) USAGE COMP    VALUE  0761.
007740     05  WK-806-0762-IDX   PIC S9(08) USAGE COMP    VALUE  0762.
007750     05  WK-806-0763-IDX   PIC S9(08) USAGE COMP    VALUE  0763.
007760     05  WK-806-0764-IDX   PIC S9(08) USAGE COMP    VALUE  0764.
007770     05  WK-806-0765-IDX   PIC S9(08) USAGE COMP    VALUE  0765.
007780     05  WK-806-0766-IDX   PIC S9(08) USAGE COMP    VALUE  0766.
007790     05  WK-806-0767-IDX   PIC S9(08) USAGE COMP    VALUE  0767.
007800     05  WK-806-0768-IDX   PIC S9(08) USAGE COMP    VALUE  0768.
007810     05  WK-806-0769-IDX   PIC S9(08) USAGE COMP    VALUE  0769.
007820     05  WK-806-0770-IDX   PIC S9(08) USAGE COMP    VALUE  0770.
007830     05  WK-806-0771-IDX   PIC S9(08) USAGE COMP    VALUE  0771.
007840     05  WK-806-0772-IDX   PIC S9(08) USAGE COMP    VALUE  0772.
007850     05  WK-806-0773-IDX   PIC S9(08) USAGE COMP    VALUE  0773.
007860     05  WK-806-0774-IDX   PIC S9(08) USAGE COMP    VALUE  0774.
007870     05  WK-806-0775-IDX   PIC S9(08) USAGE COMP    VALUE  0775.
007880     05  WK-806-0776-IDX   PIC S9(08) USAGE COMP    VALUE  0776.
007890     05  WK-806-0777-IDX   PIC S9(08) USAGE COMP    VALUE  0777.
007900     05  WK-806-0778-IDX   PIC S9(08) USAGE COMP    VALUE  0778.
007910     05  WK-806-0779-IDX   PIC S9(08) USAGE COMP    VALUE  0779.
007920     05  WK-806-0780-IDX   PIC S9(08) USAGE COMP    VALUE  0780.
007930     05  WK-806-0781-IDX   PIC S9(08) USAGE COMP    VALUE  0781.
007940     05  WK-806-0782-IDX   PIC S9(08) USAGE COMP    VALUE  0782.
007950     05  WK-806-0783-IDX   PIC S9(08) USAGE COMP    VALUE  0783.
007960     05  WK-806-0784-IDX   PIC S9(08) USAGE COMP    VALUE  0784.
007970     05  WK-806-0785-IDX   PIC S9(08) USAGE COMP    VALUE  0785.
007980     05  WK-806-0786-IDX   PIC S9(08) USAGE COMP    VALUE  0786.
007990     05  WK-806-0787-IDX   PIC S9(08) USAGE COMP    VALUE  0787.
008000     05  WK-806-0788-IDX   PIC S9(08) USAGE COMP    VALUE  0788.
008010     05  WK-806-0789-IDX   PIC S9(08) USAGE COMP    VALUE  0789.
008020     05  WK-806-0790-IDX   PIC S9(08) USAGE COMP    VALUE  0790.
008030     05  WK-806-0791-IDX   PIC S9(08) USAGE COMP    VALUE  0791.
008040     05  WK-806-0792-IDX   PIC S9(08) USAGE COMP    VALUE  0792.
008050     05  WK-806-0793-IDX   PIC S9(08) USAGE COMP    VALUE  0793.
008060     05  WK-806-0794-IDX   PIC S9(08) USAGE COMP    VALUE  0794.
008070     05  WK-806-0795-IDX   PIC S9(08) USAGE COMP    VALUE  0795.
008080     05  WK-806-0796-IDX   PIC S9(08) USAGE COMP    VALUE  0796.
008090     05  WK-806-0797-IDX   PIC S9(08) USAGE COMP    VALUE  0797.
008100     05  WK-806-0798-IDX   PIC S9(08) USAGE COMP    VALUE  0798.
008110     05  WK-806-0799-IDX   PIC S9(08) USAGE COMP    VALUE  0799.
008120     05  WK-806-0800-IDX   PIC S9(08) USAGE COMP    VALUE  0800.
008130     05  WK-806-0801-IDX   PIC S9(08) USAGE COMP    VALUE  0801.
008140     05  WK-806-0802-IDX   PIC S9(08) USAGE COMP    VALUE  0802.
008150     05  WK-806-0803-IDX   PIC S9(08) USAGE COMP    VALUE  0803.
008160     05  WK-806-0804-IDX   PIC S9(08) USAGE COMP    VALUE  0804.
008170     05  WK-806-0805-IDX   PIC S9(08) USAGE COMP    VALUE  0805.
008180     05  WK-806-0806-IDX   PIC S9(08) USAGE COMP    VALUE  0806.
008190     05  WK-806-0807-IDX   PIC S9(08) USAGE COMP    VALUE  0807.
008200     05  WK-806-0808-IDX   PIC S9(08) USAGE COMP    VALUE  0808.
008210     05  WK-806-0809-IDX   PIC S9(08) USAGE COMP    VALUE  0809.
008220     05  WK-806-0810-IDX   PIC S9(08) USAGE COMP    VALUE  0810.
008230     05  WK-806-0811-IDX   PIC S9(08) USAGE COMP    VALUE  0811.
008240     05  WK-806-0812-IDX   PIC S9(08) USAGE COMP    VALUE  0812.
008250     05  WK-806-0813-IDX   PIC S9(08) USAGE COMP    VALUE  0813.
008260     05  WK-806-0814-IDX   PIC S9(08) USAGE COMP    VALUE  0814.
008270     05  WK-806-0815-IDX   PIC S9(08) USAGE COMP    VALUE  0815.
008280     05  WK-806-0816-IDX   PIC S9(08) USAGE COMP    VALUE  0816.
008290     05  WK-806-0817-IDX   PIC S9(08) USAGE COMP    VALUE  0817.
008300     05  WK-806-0818-IDX   PIC S9(08) USAGE COMP    VALUE  0818.
008310     05  WK-806-0819-IDX   PIC S9(08) USAGE COMP    VALUE  0819.
008320     05  WK-806-0820-IDX   PIC S9(08) USAGE COMP    VALUE  0820.
008330     05  WK-806-0821-IDX   PIC S9(08) USAGE COMP    VALUE  0821.
008340     05  WK-806-0822-IDX   PIC S9(08) USAGE COMP    VALUE  0822.
008350     05  WK-806-0823-IDX   PIC S9(08) USAGE COMP    VALUE  0823.
008360     05  WK-806-0824-IDX   PIC S9(08) USAGE COMP    VALUE  0824.
008370     05  WK-806-0825-IDX   PIC S9(08) USAGE COMP    VALUE  0825.
008380     05  WK-806-0826-IDX   PIC S9(08) USAGE COMP    VALUE  0826.
008390     05  WK-806-0827-IDX   PIC S9(08) USAGE COMP    VALUE  0827.
008400     05  WK-806-0828-IDX   PIC S9(08) USAGE COMP    VALUE  0828.
008410     05  WK-806-0829-IDX   PIC S9(08) USAGE COMP    VALUE  0829.
008420     05  WK-806-0830-IDX   PIC S9(08) USAGE COMP    VALUE  0830.
008430     05  WK-806-0831-IDX   PIC S9(08) USAGE COMP    VALUE  0831.
008440     05  WK-806-0832-IDX   PIC S9(08) USAGE COMP    VALUE  0832.
008450     05  WK-806-0833-IDX   PIC S9(08) USAGE COMP    VALUE  0833.
008460     05  WK-806-0834-IDX   PIC S9(08) USAGE COMP    VALUE  0834.
008470     05  WK-806-0835-IDX   PIC S9(08) USAGE COMP    VALUE  0835.
008480     05  WK-806-0836-IDX   PIC S9(08) USAGE COMP    VALUE  0836.
008490     05  WK-806-0837-IDX   PIC S9(08) USAGE COMP    VALUE  0837.
008500     05  WK-806-0838-IDX   PIC S9(08) USAGE COMP    VALUE  0838.
008510     05  WK-806-0839-IDX   PIC S9(08) USAGE COMP    VALUE  0839.
008520     05  WK-806-0840-IDX   PIC S9(08) USAGE COMP    VALUE  0840.
008530     05  WK-806-0841-IDX   PIC S9(08) USAGE COMP    VALUE  0841.
008540     05  WK-806-0842-IDX   PIC S9(08) USAGE COMP    VALUE  0842.
008550     05  WK-806-0843-IDX   PIC S9(08) USAGE COMP    VALUE  0843.
008560     05  WK-806-0844-IDX   PIC S9(08) USAGE COMP    VALUE  0844.
008570     05  WK-806-0845-IDX   PIC S9(08) USAGE COMP    VALUE  0845.
008580     05  WK-806-0846-IDX   PIC S9(08) USAGE COMP    VALUE  0846.
008590     05  WK-806-0847-IDX   PIC S9(08) USAGE COMP    VALUE  0847.
008600     05  WK-806-0848-IDX   PIC S9(08) USAGE COMP    VALUE  0848.
008610     05  WK-806-0849-IDX   PIC S9(08) USAGE COMP    VALUE  0849.
008620     05  WK-806-0850-IDX   PIC S9(08) USAGE COMP    VALUE  0850.
008630     05  WK-806-0851-IDX   PIC S9(08) USAGE COMP    VALUE  0851.
008640     05  WK-806-0852-IDX   PIC S9(08) USAGE COMP    VALUE  0852.
008650     05  WK-806-0853-IDX   PIC S9(08) USAGE COMP    VALUE  0853.
008660     05  WK-806-0854-IDX   PIC S9(08) USAGE COMP    VALUE  0854.
008670     05  WK-806-0855-IDX   PIC S9(08) USAGE COMP    VALUE  0855.
008680     05  WK-806-0856-IDX   PIC S9(08) USAGE COMP    VALUE  0856.
008690     05  WK-806-0857-IDX   PIC S9(08) USAGE COMP    VALUE  0857.
008700     05  WK-806-0858-IDX   PIC S9(08) USAGE COMP    VALUE  0858.
008710     05  WK-806-0859-IDX   PIC S9(08) USAGE COMP    VALUE  0859.
008720     05  WK-806-0860-IDX   PIC S9(08) USAGE COMP    VALUE  0860.
008730     05  WK-806-0861-IDX   PIC S9(08) USAGE COMP    VALUE  0861.
008740     05  WK-806-0862-IDX   PIC S9(08) USAGE COMP    VALUE  0862.
008750     05  WK-806-0863-IDX   PIC S9(08) USAGE COMP    VALUE  0863.
008760     05  WK-806-0864-IDX   PIC S9(08) USAGE COMP    VALUE  0864.
008770     05  WK-806-0865-IDX   PIC S9(08) USAGE COMP    VALUE  0865.
008780     05  WK-806-0866-IDX   PIC S9(08) USAGE COMP    VALUE  0866.
008790     05  WK-806-0867-IDX   PIC S9(08) USAGE COMP    VALUE  0867.
008800     05  WK-806-0868-IDX   PIC S9(08) USAGE COMP    VALUE  0868.
008810     05  WK-806-0869-IDX   PIC S9(08) USAGE COMP    VALUE  0869.
008820     05  WK-806-0870-IDX   PIC S9(08) USAGE COMP    VALUE  0870.
008830     05  WK-806-0871-IDX   PIC S9(08) USAGE COMP    VALUE  0871.
008840     05  WK-806-0872-IDX   PIC S9(08) USAGE COMP    VALUE  0872.
008850     05  WK-806-0873-IDX   PIC S9(08) USAGE COMP    VALUE  0873.
008860     05  WK-806-0874-IDX   PIC S9(08) USAGE COMP    VALUE  0874.
008870     05  WK-806-0875-IDX   PIC S9(08) USAGE COMP    VALUE  0875.
008880     05  WK-806-0876-IDX   PIC S9(08) USAGE COMP    VALUE  0876.
008890     05  WK-806-0877-IDX   PIC S9(08) USAGE COMP    VALUE  0877.
008900     05  WK-806-0878-IDX   PIC S9(08) USAGE COMP    VALUE  0878.
008910     05  WK-806-0879-IDX   PIC S9(08) USAGE COMP    VALUE  0879.
008920     05  WK-806-0880-IDX   PIC S9(08) USAGE COMP    VALUE  0880.
008930     05  WK-806-0881-IDX   PIC S9(08) USAGE COMP    VALUE  0881.
008940     05  WK-806-0882-IDX   PIC S9(08) USAGE COMP    VALUE  0882.
008950     05  WK-806-0883-IDX   PIC S9(08) USAGE COMP    VALUE  0883.
008960     05  WK-806-0884-IDX   PIC S9(08) USAGE COMP    VALUE  0884.
008970     05  WK-806-0885-IDX   PIC S9(08) USAGE COMP    VALUE  0885.
008980     05  WK-806-0886-IDX   PIC S9(08) USAGE COMP    VALUE  0886.
008990     05  WK-806-0887-IDX   PIC S9(08) USAGE COMP    VALUE  0887.
009000     05  WK-806-0888-IDX   PIC S9(08) USAGE COMP    VALUE  0888.
009010     05  WK-806-0889-IDX   PIC S9(08) USAGE COMP    VALUE  0889.
009020     05  WK-806-0890-IDX   PIC S9(08) USAGE COMP    VALUE  0890.
009030     05  WK-806-0891-IDX   PIC S9(08) USAGE COMP    VALUE  0891.
009040     05  WK-806-0892-IDX   PIC S9(08) USAGE COMP    VALUE  0892.
009050     05  WK-806-0893-IDX   PIC S9(08) USAGE COMP    VALUE  0893.
009060     05  WK-806-0894-IDX   PIC S9(08) USAGE COMP    VALUE  0894.
009070     05  WK-806-0895-IDX   PIC S9(08) USAGE COMP    VALUE  0895.
009080     05  WK-806-0896-IDX   PIC S9(08) USAGE COMP    VALUE  0896.
009090     05  WK-806-0897-IDX   PIC S9(08) USAGE COMP    VALUE  0897.
009100     05  WK-806-0898-IDX   PIC S9(08) USAGE COMP    VALUE  0898.
009110     05  WK-806-0899-IDX   PIC S9(08) USAGE COMP    VALUE  0899.
009120     05  WK-806-0900-IDX   PIC S9(08) USAGE COMP    VALUE  0900.
009130     05  WK-806-0901-IDX   PIC S9(08) USAGE COMP    VALUE  0901.
009140     05  WK-806-0902-IDX   PIC S9(08) USAGE COMP    VALUE  0902.
009150     05  WK-806-0903-IDX   PIC S9(08) USAGE COMP    VALUE  0903.
009160     05  WK-806-0904-IDX   PIC S9(08) USAGE COMP    VALUE  0904.
009170     05  WK-806-0905-IDX   PIC S9(08) USAGE COMP    VALUE  0905.
009180     05  WK-806-0906-IDX   PIC S9(08) USAGE COMP    VALUE  0906.
009190     05  WK-806-0907-IDX   PIC S9(08) USAGE COMP    VALUE  0907.
009200     05  WK-806-0908-IDX   PIC S9(08) USAGE COMP    VALUE  0908.
009210     05  WK-806-0909-IDX   PIC S9(08) USAGE COMP    VALUE  0909.
009220     05  WK-806-0910-IDX   PIC S9(08) USAGE COMP    VALUE  0910.
009230     05  WK-806-0911-IDX   PIC S9(08) USAGE COMP    VALUE  0911.
009240     05  WK-806-0912-IDX   PIC S9(08) USAGE COMP    VALUE  0912.
009250     05  WK-806-0913-IDX   PIC S9(08) USAGE COMP    VALUE  0913.
009260     05  WK-806-0914-IDX   PIC S9(08) USAGE COMP    VALUE  0914.
009270     05  WK-806-0915-IDX   PIC S9(08) USAGE COMP    VALUE  0915.
009280     05  WK-806-0916-IDX   PIC S9(08) USAGE COMP    VALUE  0916.
009290     05  WK-806-0917-IDX   PIC S9(08) USAGE COMP    VALUE  0917.
009300     05  WK-806-0918-IDX   PIC S9(08) USAGE COMP    VALUE  0918.
009310     05  WK-806-0919-IDX   PIC S9(08) USAGE COMP    VALUE  0919.
009320     05  WK-806-0920-IDX   PIC S9(08) USAGE COMP    VALUE  0920.
009330     05  WK-806-0921-IDX   PIC S9(08) USAGE COMP    VALUE  0921.
009340     05  WK-806-0922-IDX   PIC S9(08) USAGE COMP    VALUE  0922.
009350     05  WK-806-0923-IDX   PIC S9(08) USAGE COMP    VALUE  0923.
009360     05  WK-806-0924-IDX   PIC S9(08) USAGE COMP    VALUE  0924.
009370     05  WK-806-0925-IDX   PIC S9(08) USAGE COMP    VALUE  0925.
009380     05  WK-806-0926-IDX   PIC S9(08) USAGE COMP    VALUE  0926.
009390     05  WK-806-0927-IDX   PIC S9(08) USAGE COMP    VALUE  0927.
009400     05  WK-806-0928-IDX   PIC S9(08) USAGE COMP    VALUE  0928.
009410     05  WK-806-0929-IDX   PIC S9(08) USAGE COMP    VALUE  0929.
009420     05  WK-806-0930-IDX   PIC S9(08) USAGE COMP    VALUE  0930.
009430     05  WK-806-0931-IDX   PIC S9(08) USAGE COMP    VALUE  0931.
009440     05  WK-806-0932-IDX   PIC S9(08) USAGE COMP    VALUE  0932.
009450     05  WK-806-0933-IDX   PIC S9(08) USAGE COMP    VALUE  0933.
009460     05  WK-806-0934-IDX   PIC S9(08) USAGE COMP    VALUE  0934.
009470     05  WK-806-0935-IDX   PIC S9(08) USAGE COMP    VALUE  0935.
009480     05  WK-806-0936-IDX   PIC S9(08) USAGE COMP    VALUE  0936.
009490     05  WK-806-0937-IDX   PIC S9(08) USAGE COMP    VALUE  0937.
009500     05  WK-806-0938-IDX   PIC S9(08) USAGE COMP    VALUE  0938.
009510     05  WK-806-0939-IDX   PIC S9(08) USAGE COMP    VALUE  0939.
009520     05  WK-806-0940-IDX   PIC S9(08) USAGE COMP    VALUE  0940.
009530     05  WK-806-0941-IDX   PIC S9(08) USAGE COMP    VALUE  0941.
009540     05  WK-806-0942-IDX   PIC S9(08) USAGE COMP    VALUE  0942.
009550     05  WK-806-0943-IDX   PIC S9(08) USAGE COMP    VALUE  0943.
009560     05  WK-806-0944-IDX   PIC S9(08) USAGE COMP    VALUE  0944.
009570     05  WK-806-0945-IDX   PIC S9(08) USAGE COMP    VALUE  0945.
009580     05  WK-806-0946-IDX   PIC S9(08) USAGE COMP    VALUE  0946.
009590     05  WK-806-0947-IDX   PIC S9(08) USAGE COMP    VALUE  0947.
009600     05  WK-806-0948-IDX   PIC S9(08) USAGE COMP    VALUE  0948.
009610     05  WK-806-0949-IDX   PIC S9(08) USAGE COMP    VALUE  0949.
009620     05  WK-806-0950-IDX   PIC S9(08) USAGE COMP    VALUE  0950.
009630     05  WK-806-0951-IDX   PIC S9(08) USAGE COMP    VALUE  0951.
009640     05  WK-806-0952-IDX   PIC S9(08) USAGE COMP    VALUE  0952.
009650     05  WK-806-0953-IDX   PIC S9(08) USAGE COMP    VALUE  0953.
009660     05  WK-806-0954-IDX   PIC S9(08) USAGE COMP    VALUE  0954.
009670     05  WK-806-0955-IDX   PIC S9(08) USAGE COMP    VALUE  0955.
009680     05  WK-806-0956-IDX   PIC S9(08) USAGE COMP    VALUE  0956.
009690     05  WK-806-0957-IDX   PIC S9(08) USAGE COMP    VALUE  0957.
009700     05  WK-806-0958-IDX   PIC S9(08) USAGE COMP    VALUE  0958.
009710     05  WK-806-0959-IDX   PIC S9(08) USAGE COMP    VALUE  0959.
009720     05  WK-806-0960-IDX   PIC S9(08) USAGE COMP    VALUE  0960.
009730     05  WK-806-0961-IDX   PIC S9(08) USAGE COMP    VALUE  0961.
009740     05  WK-806-0962-IDX   PIC S9(08) USAGE COMP    VALUE  0962.
009750     05  WK-806-0963-IDX   PIC S9(08) USAGE COMP    VALUE  0963.
009760     05  WK-806-0964-IDX   PIC S9(08) USAGE COMP    VALUE  0964.
009770     05  WK-806-0965-IDX   PIC S9(08) USAGE COMP    VALUE  0965.
009780     05  WK-806-0966-IDX   PIC S9(08) USAGE COMP    VALUE  0966.
009790     05  WK-806-0967-IDX   PIC S9(08) USAGE COMP    VALUE  0967.
009800     05  WK-806-0968-IDX   PIC S9(08) USAGE COMP    VALUE  0968.
009810     05  WK-806-0969-IDX   PIC S9(08) USAGE COMP    VALUE  0969.
009820     05  WK-806-0970-IDX   PIC S9(08) USAGE COMP    VALUE  0970.
009830     05  WK-806-0971-IDX   PIC S9(08) USAGE COMP    VALUE  0971.
009840     05  WK-806-0972-IDX   PIC S9(08) USAGE COMP    VALUE  0972.
009850     05  WK-806-0973-IDX   PIC S9(08) USAGE COMP    VALUE  0973.
009860     05  WK-806-0974-IDX   PIC S9(08) USAGE COMP    VALUE  0974.
009870     05  WK-806-0975-IDX   PIC S9(08) USAGE COMP    VALUE  0975.
009880     05  WK-806-0976-IDX   PIC S9(08) USAGE COMP    VALUE  0976.
009890     05  WK-806-0977-IDX   PIC S9(08) USAGE COMP    VALUE  0977.
009900     05  WK-806-0978-IDX   PIC S9(08) USAGE COMP    VALUE  0978.
009910     05  WK-806-0979-IDX   PIC S9(08) USAGE COMP    VALUE  0979.
009920     05  WK-806-0980-IDX   PIC S9(08) USAGE COMP    VALUE  0980.
009930     05  WK-806-0981-IDX   PIC S9(08) USAGE COMP    VALUE  0981.
009940     05  WK-806-0982-IDX   PIC S9(08) USAGE COMP    VALUE  0982.
009950     05  WK-806-0983-IDX   PIC S9(08) USAGE COMP    VALUE  0983.
009960     05  WK-806-0984-IDX   PIC S9(08) USAGE COMP    VALUE  0984.
009970     05  WK-806-0985-IDX   PIC S9(08) USAGE COMP    VALUE  0985.
009980     05  WK-806-0986-IDX   PIC S9(08) USAGE COMP    VALUE  0986.
009990     05  WK-806-0987-IDX   PIC S9(08) USAGE COMP    VALUE  0987.
010000     05  WK-806-0988-IDX   PIC S9(08) USAGE COMP    VALUE  0988.
010010     05  WK-806-0989-IDX   PIC S9(08) USAGE COMP    VALUE  0989.
010020     05  WK-806-0990-IDX   PIC S9(08) USAGE COMP    VALUE  0990.
010030     05  WK-806-0991-IDX   PIC S9(08) USAGE COMP    VALUE  0991.
010040     05  WK-806-0992-IDX   PIC S9(08) USAGE COMP    VALUE  0992.
010050     05  WK-806-0993-IDX   PIC S9(08) USAGE COMP    VALUE  0993.
010060     05  WK-806-0994-IDX   PIC S9(08) USAGE COMP    VALUE  0994.
010070     05  WK-806-0995-IDX   PIC S9(08) USAGE COMP    VALUE  0995.
010080     05  WK-806-0996-IDX   PIC S9(08) USAGE COMP    VALUE  0996.
010090     05  WK-806-0997-IDX   PIC S9(08) USAGE COMP    VALUE  0997.
010100     05  WK-806-0998-IDX   PIC S9(08) USAGE COMP    VALUE  0998.
010110     05  WK-806-0999-IDX   PIC S9(08) USAGE COMP    VALUE  0999.
010110     05  WK-806-1000-IDX   PIC S9(08) USAGE COMP    VALUE  1000.
000130     05  WK-806-1001-IDX   PIC S9(08) USAGE COMP    VALUE  1001.
000140     05  WK-806-1002-IDX   PIC S9(08) USAGE COMP    VALUE  1002.
000150     05  WK-806-1003-IDX   PIC S9(08) USAGE COMP    VALUE  1003.
000160     05  WK-806-1004-IDX   PIC S9(08) USAGE COMP    VALUE  1004.
000170     05  WK-806-1005-IDX   PIC S9(08) USAGE COMP    VALUE  1005.
000180     05  WK-806-1006-IDX   PIC S9(08) USAGE COMP    VALUE  1006.
000190     05  WK-806-1007-IDX   PIC S9(08) USAGE COMP    VALUE  1007.
000200     05  WK-806-1008-IDX   PIC S9(08) USAGE COMP    VALUE  1008.
000210     05  WK-806-1009-IDX   PIC S9(08) USAGE COMP    VALUE  1009.
000220     05  WK-806-1010-IDX   PIC S9(08) USAGE COMP    VALUE  1010.
000230     05  WK-806-1011-IDX   PIC S9(08) USAGE COMP    VALUE  1011.
000240     05  WK-806-1012-IDX   PIC S9(08) USAGE COMP    VALUE  1012.
000250     05  WK-806-1013-IDX   PIC S9(08) USAGE COMP    VALUE  1013.
000260     05  WK-806-1014-IDX   PIC S9(08) USAGE COMP    VALUE  1014.
000270     05  WK-806-1015-IDX   PIC S9(08) USAGE COMP    VALUE  1015.
000280     05  WK-806-1016-IDX   PIC S9(08) USAGE COMP    VALUE  1016.
000290     05  WK-806-1017-IDX   PIC S9(08) USAGE COMP    VALUE  1017.
000300     05  WK-806-1018-IDX   PIC S9(08) USAGE COMP    VALUE  1018.
000310     05  WK-806-1019-IDX   PIC S9(08) USAGE COMP    VALUE  1019.
000320     05  WK-806-1020-IDX   PIC S9(08) USAGE COMP    VALUE  1020.
000330     05  WK-806-1021-IDX   PIC S9(08) USAGE COMP    VALUE  1021.
000340     05  WK-806-1022-IDX   PIC S9(08) USAGE COMP    VALUE  1022.
000350     05  WK-806-1023-IDX   PIC S9(08) USAGE COMP    VALUE  1023.
000360     05  WK-806-1024-IDX   PIC S9(08) USAGE COMP    VALUE  1024.
000370     05  WK-806-1025-IDX   PIC S9(08) USAGE COMP    VALUE  1025.
000380     05  WK-806-1026-IDX   PIC S9(08) USAGE COMP    VALUE  1026.
000390     05  WK-806-1027-IDX   PIC S9(08) USAGE COMP    VALUE  1027.
000400     05  WK-806-1028-IDX   PIC S9(08) USAGE COMP    VALUE  1028.
000410     05  WK-806-1029-IDX   PIC S9(08) USAGE COMP    VALUE  1029.
000420     05  WK-806-1030-IDX   PIC S9(08) USAGE COMP    VALUE  1030.
000430     05  WK-806-1031-IDX   PIC S9(08) USAGE COMP    VALUE  1031.
000440     05  WK-806-1032-IDX   PIC S9(08) USAGE COMP    VALUE  1032.
000450     05  WK-806-1033-IDX   PIC S9(08) USAGE COMP    VALUE  1033.
000460     05  WK-806-1034-IDX   PIC S9(08) USAGE COMP    VALUE  1034.
000470     05  WK-806-1035-IDX   PIC S9(08) USAGE COMP    VALUE  1035.
000480     05  WK-806-1036-IDX   PIC S9(08) USAGE COMP    VALUE  1036.
000490     05  WK-806-1037-IDX   PIC S9(08) USAGE COMP    VALUE  1037.
000500     05  WK-806-1038-IDX   PIC S9(08) USAGE COMP    VALUE  1038.
000510     05  WK-806-1039-IDX   PIC S9(08) USAGE COMP    VALUE  1039.
000520     05  WK-806-1040-IDX   PIC S9(08) USAGE COMP    VALUE  1040.
000530     05  WK-806-1041-IDX   PIC S9(08) USAGE COMP    VALUE  1041.
000540     05  WK-806-1042-IDX   PIC S9(08) USAGE COMP    VALUE  1042.
000550     05  WK-806-1043-IDX   PIC S9(08) USAGE COMP    VALUE  1043.
000560     05  WK-806-1044-IDX   PIC S9(08) USAGE COMP    VALUE  1044.
000570     05  WK-806-1045-IDX   PIC S9(08) USAGE COMP    VALUE  1045.
000580     05  WK-806-1046-IDX   PIC S9(08) USAGE COMP    VALUE  1046.
000590     05  WK-806-1047-IDX   PIC S9(08) USAGE COMP    VALUE  1047.
000600     05  WK-806-1048-IDX   PIC S9(08) USAGE COMP    VALUE  1048.
000610     05  WK-806-1049-IDX   PIC S9(08) USAGE COMP    VALUE  1049.
000620     05  WK-806-1050-IDX   PIC S9(08) USAGE COMP    VALUE  1050.
000630     05  WK-806-1051-IDX   PIC S9(08) USAGE COMP    VALUE  1051.
000640     05  WK-806-1052-IDX   PIC S9(08) USAGE COMP    VALUE  1052.
000650     05  WK-806-1053-IDX   PIC S9(08) USAGE COMP    VALUE  1053.
000660     05  WK-806-1054-IDX   PIC S9(08) USAGE COMP    VALUE  1054.
000670     05  WK-806-1055-IDX   PIC S9(08) USAGE COMP    VALUE  1055.
000680     05  WK-806-1056-IDX   PIC S9(08) USAGE COMP    VALUE  1056.
000690     05  WK-806-1057-IDX   PIC S9(08) USAGE COMP    VALUE  1057.
000700     05  WK-806-1058-IDX   PIC S9(08) USAGE COMP    VALUE  1058.
000710     05  WK-806-1059-IDX   PIC S9(08) USAGE COMP    VALUE  1059.
000720     05  WK-806-1060-IDX   PIC S9(08) USAGE COMP    VALUE  1060.
000730     05  WK-806-1061-IDX   PIC S9(08) USAGE COMP    VALUE  1061.
000740     05  WK-806-1062-IDX   PIC S9(08) USAGE COMP    VALUE  1062.
000750     05  WK-806-1063-IDX   PIC S9(08) USAGE COMP    VALUE  1063.
000760     05  WK-806-1064-IDX   PIC S9(08) USAGE COMP    VALUE  1064.
000770     05  WK-806-1065-IDX   PIC S9(08) USAGE COMP    VALUE  1065.
000780     05  WK-806-1066-IDX   PIC S9(08) USAGE COMP    VALUE  1066.
000790     05  WK-806-1067-IDX   PIC S9(08) USAGE COMP    VALUE  1067.
000800     05  WK-806-1068-IDX   PIC S9(08) USAGE COMP    VALUE  1068.
000810     05  WK-806-1069-IDX   PIC S9(08) USAGE COMP    VALUE  1069.
000820     05  WK-806-1070-IDX   PIC S9(08) USAGE COMP    VALUE  1070.
000830     05  WK-806-1071-IDX   PIC S9(08) USAGE COMP    VALUE  1071.
000840     05  WK-806-1072-IDX   PIC S9(08) USAGE COMP    VALUE  1072.
000850     05  WK-806-1073-IDX   PIC S9(08) USAGE COMP    VALUE  1073.
000860     05  WK-806-1074-IDX   PIC S9(08) USAGE COMP    VALUE  1074.
000870     05  WK-806-1075-IDX   PIC S9(08) USAGE COMP    VALUE  1075.
000880     05  WK-806-1076-IDX   PIC S9(08) USAGE COMP    VALUE  1076.
000890     05  WK-806-1077-IDX   PIC S9(08) USAGE COMP    VALUE  1077.
000900     05  WK-806-1078-IDX   PIC S9(08) USAGE COMP    VALUE  1078.
000910     05  WK-806-1079-IDX   PIC S9(08) USAGE COMP    VALUE  1079.
000920     05  WK-806-1080-IDX   PIC S9(08) USAGE COMP    VALUE  1080.
000930     05  WK-806-1081-IDX   PIC S9(08) USAGE COMP    VALUE  1081.
000940     05  WK-806-1082-IDX   PIC S9(08) USAGE COMP    VALUE  1082.
000950     05  WK-806-1083-IDX   PIC S9(08) USAGE COMP    VALUE  1083.
000960     05  WK-806-1084-IDX   PIC S9(08) USAGE COMP    VALUE  1084.
000970     05  WK-806-1085-IDX   PIC S9(08) USAGE COMP    VALUE  1085.
000980     05  WK-806-1086-IDX   PIC S9(08) USAGE COMP    VALUE  1086.
000990     05  WK-806-1087-IDX   PIC S9(08) USAGE COMP    VALUE  1087.
001000     05  WK-806-1088-IDX   PIC S9(08) USAGE COMP    VALUE  1088.
001010     05  WK-806-1089-IDX   PIC S9(08) USAGE COMP    VALUE  1089.
001020     05  WK-806-1090-IDX   PIC S9(08) USAGE COMP    VALUE  1090.
001030     05  WK-806-1091-IDX   PIC S9(08) USAGE COMP    VALUE  1091.
001040     05  WK-806-1092-IDX   PIC S9(08) USAGE COMP    VALUE  1092.
001050     05  WK-806-1093-IDX   PIC S9(08) USAGE COMP    VALUE  1093.
001060     05  WK-806-1094-IDX   PIC S9(08) USAGE COMP    VALUE  1094.
001070     05  WK-806-1095-IDX   PIC S9(08) USAGE COMP    VALUE  1095.
001080     05  WK-806-1096-IDX   PIC S9(08) USAGE COMP    VALUE  1096.
001090     05  WK-806-1097-IDX   PIC S9(08) USAGE COMP    VALUE  1097.
001100     05  WK-806-1098-IDX   PIC S9(08) USAGE COMP    VALUE  1098.
001110     05  WK-806-1099-IDX   PIC S9(08) USAGE COMP    VALUE  1099.
001120     05  WK-806-1100-IDX   PIC S9(08) USAGE COMP    VALUE  1100.
001130     05  WK-806-1101-IDX   PIC S9(08) USAGE COMP    VALUE  1101.
001140     05  WK-806-1102-IDX   PIC S9(08) USAGE COMP    VALUE  1102.
001150     05  WK-806-1103-IDX   PIC S9(08) USAGE COMP    VALUE  1103.
001160     05  WK-806-1104-IDX   PIC S9(08) USAGE COMP    VALUE  1104.
001170     05  WK-806-1105-IDX   PIC S9(08) USAGE COMP    VALUE  1105.
001180     05  WK-806-1106-IDX   PIC S9(08) USAGE COMP    VALUE  1106.
001190     05  WK-806-1107-IDX   PIC S9(08) USAGE COMP    VALUE  1107.
001200     05  WK-806-1108-IDX   PIC S9(08) USAGE COMP    VALUE  1108.
001210     05  WK-806-1109-IDX   PIC S9(08) USAGE COMP    VALUE  1109.
001220     05  WK-806-1110-IDX   PIC S9(08) USAGE COMP    VALUE  1110.
001230     05  WK-806-1111-IDX   PIC S9(08) USAGE COMP    VALUE  1111.
001240     05  WK-806-1112-IDX   PIC S9(08) USAGE COMP    VALUE  1112.
001250     05  WK-806-1113-IDX   PIC S9(08) USAGE COMP    VALUE  1113.
001260     05  WK-806-1114-IDX   PIC S9(08) USAGE COMP    VALUE  1114.
001270     05  WK-806-1115-IDX   PIC S9(08) USAGE COMP    VALUE  1115.
001280     05  WK-806-1116-IDX   PIC S9(08) USAGE COMP    VALUE  1116.
001290     05  WK-806-1117-IDX   PIC S9(08) USAGE COMP    VALUE  1117.
001300     05  WK-806-1118-IDX   PIC S9(08) USAGE COMP    VALUE  1118.
001310     05  WK-806-1119-IDX   PIC S9(08) USAGE COMP    VALUE  1119.
001320     05  WK-806-1120-IDX   PIC S9(08) USAGE COMP    VALUE  1120.
001330     05  WK-806-1121-IDX   PIC S9(08) USAGE COMP    VALUE  1121.
001340     05  WK-806-1122-IDX   PIC S9(08) USAGE COMP    VALUE  1122.
001350     05  WK-806-1123-IDX   PIC S9(08) USAGE COMP    VALUE  1123.
001360     05  WK-806-1124-IDX   PIC S9(08) USAGE COMP    VALUE  1124.
001370     05  WK-806-1125-IDX   PIC S9(08) USAGE COMP    VALUE  1125.
001380     05  WK-806-1126-IDX   PIC S9(08) USAGE COMP    VALUE  1126.
001390     05  WK-806-1127-IDX   PIC S9(08) USAGE COMP    VALUE  1127.
001400     05  WK-806-1128-IDX   PIC S9(08) USAGE COMP    VALUE  1128.
001410     05  WK-806-1129-IDX   PIC S9(08) USAGE COMP    VALUE  1129.
001420     05  WK-806-1130-IDX   PIC S9(08) USAGE COMP    VALUE  1130.
001430     05  WK-806-1131-IDX   PIC S9(08) USAGE COMP    VALUE  1131.
001440     05  WK-806-1132-IDX   PIC S9(08) USAGE COMP    VALUE  1132.
001450     05  WK-806-1133-IDX   PIC S9(08) USAGE COMP    VALUE  1133.
001460     05  WK-806-1134-IDX   PIC S9(08) USAGE COMP    VALUE  1134.
001470     05  WK-806-1135-IDX   PIC S9(08) USAGE COMP    VALUE  1135.
001480     05  WK-806-1136-IDX   PIC S9(08) USAGE COMP    VALUE  1136.
001490     05  WK-806-1137-IDX   PIC S9(08) USAGE COMP    VALUE  1137.
001500     05  WK-806-1138-IDX   PIC S9(08) USAGE COMP    VALUE  1138.
001510     05  WK-806-1139-IDX   PIC S9(08) USAGE COMP    VALUE  1139.
001520     05  WK-806-1140-IDX   PIC S9(08) USAGE COMP    VALUE  1140.
001530     05  WK-806-1141-IDX   PIC S9(08) USAGE COMP    VALUE  1141.
001540     05  WK-806-1142-IDX   PIC S9(08) USAGE COMP    VALUE  1142.
001550     05  WK-806-1143-IDX   PIC S9(08) USAGE COMP    VALUE  1143.
001560     05  WK-806-1144-IDX   PIC S9(08) USAGE COMP    VALUE  1144.
001570     05  WK-806-1145-IDX   PIC S9(08) USAGE COMP    VALUE  1145.
001580     05  WK-806-1146-IDX   PIC S9(08) USAGE COMP    VALUE  1146.
001590     05  WK-806-1147-IDX   PIC S9(08) USAGE COMP    VALUE  1147.
001600     05  WK-806-1148-IDX   PIC S9(08) USAGE COMP    VALUE  1148.
001610     05  WK-806-1149-IDX   PIC S9(08) USAGE COMP    VALUE  1149.
001620     05  WK-806-1150-IDX   PIC S9(08) USAGE COMP    VALUE  1150.
001630     05  WK-806-1151-IDX   PIC S9(08) USAGE COMP    VALUE  1151.
001640     05  WK-806-1152-IDX   PIC S9(08) USAGE COMP    VALUE  1152.
001650     05  WK-806-1153-IDX   PIC S9(08) USAGE COMP    VALUE  1153.
001660     05  WK-806-1154-IDX   PIC S9(08) USAGE COMP    VALUE  1154.
001670     05  WK-806-1155-IDX   PIC S9(08) USAGE COMP    VALUE  1155.
001680     05  WK-806-1156-IDX   PIC S9(08) USAGE COMP    VALUE  1156.
001690     05  WK-806-1157-IDX   PIC S9(08) USAGE COMP    VALUE  1157.
001700     05  WK-806-1158-IDX   PIC S9(08) USAGE COMP    VALUE  1158.
001710     05  WK-806-1159-IDX   PIC S9(08) USAGE COMP    VALUE  1159.
001720     05  WK-806-1160-IDX   PIC S9(08) USAGE COMP    VALUE  1160.
001730     05  WK-806-1161-IDX   PIC S9(08) USAGE COMP    VALUE  1161.
001740     05  WK-806-1162-IDX   PIC S9(08) USAGE COMP    VALUE  1162.
001750     05  WK-806-1163-IDX   PIC S9(08) USAGE COMP    VALUE  1163.
001760     05  WK-806-1164-IDX   PIC S9(08) USAGE COMP    VALUE  1164.
001770     05  WK-806-1165-IDX   PIC S9(08) USAGE COMP    VALUE  1165.
001780     05  WK-806-1166-IDX   PIC S9(08) USAGE COMP    VALUE  1166.
001790     05  WK-806-1167-IDX   PIC S9(08) USAGE COMP    VALUE  1167.
001800     05  WK-806-1168-IDX   PIC S9(08) USAGE COMP    VALUE  1168.
001810     05  WK-806-1169-IDX   PIC S9(08) USAGE COMP    VALUE  1169.
001820     05  WK-806-1170-IDX   PIC S9(08) USAGE COMP    VALUE  1170.
001830     05  WK-806-1171-IDX   PIC S9(08) USAGE COMP    VALUE  1171.
001840     05  WK-806-1172-IDX   PIC S9(08) USAGE COMP    VALUE  1172.
001850     05  WK-806-1173-IDX   PIC S9(08) USAGE COMP    VALUE  1173.
001860     05  WK-806-1174-IDX   PIC S9(08) USAGE COMP    VALUE  1174.
001870     05  WK-806-1175-IDX   PIC S9(08) USAGE COMP    VALUE  1175.
001880     05  WK-806-1176-IDX   PIC S9(08) USAGE COMP    VALUE  1176.
001890     05  WK-806-1177-IDX   PIC S9(08) USAGE COMP    VALUE  1177.
001900     05  WK-806-1178-IDX   PIC S9(08) USAGE COMP    VALUE  1178.
001910     05  WK-806-1179-IDX   PIC S9(08) USAGE COMP    VALUE  1179.
001920     05  WK-806-1180-IDX   PIC S9(08) USAGE COMP    VALUE  1180.
001930     05  WK-806-1181-IDX   PIC S9(08) USAGE COMP    VALUE  1181.
001940     05  WK-806-1182-IDX   PIC S9(08) USAGE COMP    VALUE  1182.
001950     05  WK-806-1183-IDX   PIC S9(08) USAGE COMP    VALUE  1183.
001960     05  WK-806-1184-IDX   PIC S9(08) USAGE COMP    VALUE  1184.
001970     05  WK-806-1185-IDX   PIC S9(08) USAGE COMP    VALUE  1185.
001980     05  WK-806-1186-IDX   PIC S9(08) USAGE COMP    VALUE  1186.
001990     05  WK-806-1187-IDX   PIC S9(08) USAGE COMP    VALUE  1187.
002000     05  WK-806-1188-IDX   PIC S9(08) USAGE COMP    VALUE  1188.
002010     05  WK-806-1189-IDX   PIC S9(08) USAGE COMP    VALUE  1189.
002020     05  WK-806-1190-IDX   PIC S9(08) USAGE COMP    VALUE  1190.
002030     05  WK-806-1191-IDX   PIC S9(08) USAGE COMP    VALUE  1191.
002040     05  WK-806-1192-IDX   PIC S9(08) USAGE COMP    VALUE  1192.
002050     05  WK-806-1193-IDX   PIC S9(08) USAGE COMP    VALUE  1193.
002060     05  WK-806-1194-IDX   PIC S9(08) USAGE COMP    VALUE  1194.
002070     05  WK-806-1195-IDX   PIC S9(08) USAGE COMP    VALUE  1195.
002080     05  WK-806-1196-IDX   PIC S9(08) USAGE COMP    VALUE  1196.
002090     05  WK-806-1197-IDX   PIC S9(08) USAGE COMP    VALUE  1197.
002100     05  WK-806-1198-IDX   PIC S9(08) USAGE COMP    VALUE  1198.
002110     05  WK-806-1199-IDX   PIC S9(08) USAGE COMP    VALUE  1199.
002120     05  WK-806-1200-IDX   PIC S9(08) USAGE COMP    VALUE  1200.
002130     05  WK-806-1201-IDX   PIC S9(08) USAGE COMP    VALUE  1201.
002140     05  WK-806-1202-IDX   PIC S9(08) USAGE COMP    VALUE  1202.
002150     05  WK-806-1203-IDX   PIC S9(08) USAGE COMP    VALUE  1203.
002160     05  WK-806-1204-IDX   PIC S9(08) USAGE COMP    VALUE  1204.
002170     05  WK-806-1205-IDX   PIC S9(08) USAGE COMP    VALUE  1205.
002180     05  WK-806-1206-IDX   PIC S9(08) USAGE COMP    VALUE  1206.
002190     05  WK-806-1207-IDX   PIC S9(08) USAGE COMP    VALUE  1207.
002200     05  WK-806-1208-IDX   PIC S9(08) USAGE COMP    VALUE  1208.
002210     05  WK-806-1209-IDX   PIC S9(08) USAGE COMP    VALUE  1209.
002220     05  WK-806-1210-IDX   PIC S9(08) USAGE COMP    VALUE  1210.
002230     05  WK-806-1211-IDX   PIC S9(08) USAGE COMP    VALUE  1211.
002240     05  WK-806-1212-IDX   PIC S9(08) USAGE COMP    VALUE  1212.
002250     05  WK-806-1213-IDX   PIC S9(08) USAGE COMP    VALUE  1213.
002260     05  WK-806-1214-IDX   PIC S9(08) USAGE COMP    VALUE  1214.
002270     05  WK-806-1215-IDX   PIC S9(08) USAGE COMP    VALUE  1215.
002280     05  WK-806-1216-IDX   PIC S9(08) USAGE COMP    VALUE  1216.
002290     05  WK-806-1217-IDX   PIC S9(08) USAGE COMP    VALUE  1217.
002300     05  WK-806-1218-IDX   PIC S9(08) USAGE COMP    VALUE  1218.
002310     05  WK-806-1219-IDX   PIC S9(08) USAGE COMP    VALUE  1219.
002320     05  WK-806-1220-IDX   PIC S9(08) USAGE COMP    VALUE  1220.
002330     05  WK-806-1221-IDX   PIC S9(08) USAGE COMP    VALUE  1221.
002340     05  WK-806-1222-IDX   PIC S9(08) USAGE COMP    VALUE  1222.
002350     05  WK-806-1223-IDX   PIC S9(08) USAGE COMP    VALUE  1223.
002360     05  WK-806-1224-IDX   PIC S9(08) USAGE COMP    VALUE  1224.
002370     05  WK-806-1225-IDX   PIC S9(08) USAGE COMP    VALUE  1225.
002380     05  WK-806-1226-IDX   PIC S9(08) USAGE COMP    VALUE  1226.
002390     05  WK-806-1227-IDX   PIC S9(08) USAGE COMP    VALUE  1227.
002400     05  WK-806-1228-IDX   PIC S9(08) USAGE COMP    VALUE  1228.
002410     05  WK-806-1229-IDX   PIC S9(08) USAGE COMP    VALUE  1229.
002420     05  WK-806-1230-IDX   PIC S9(08) USAGE COMP    VALUE  1230.
002430     05  WK-806-1231-IDX   PIC S9(08) USAGE COMP    VALUE  1231.
002440     05  WK-806-1232-IDX   PIC S9(08) USAGE COMP    VALUE  1232.
002450     05  WK-806-1233-IDX   PIC S9(08) USAGE COMP    VALUE  1233.
002460     05  WK-806-1234-IDX   PIC S9(08) USAGE COMP    VALUE  1234.
002470     05  WK-806-1235-IDX   PIC S9(08) USAGE COMP    VALUE  1235.
002480     05  WK-806-1236-IDX   PIC S9(08) USAGE COMP    VALUE  1236.
002490     05  WK-806-1237-IDX   PIC S9(08) USAGE COMP    VALUE  1237.
002500     05  WK-806-1238-IDX   PIC S9(08) USAGE COMP    VALUE  1238.
002510     05  WK-806-1239-IDX   PIC S9(08) USAGE COMP    VALUE  1239.
002520     05  WK-806-1240-IDX   PIC S9(08) USAGE COMP    VALUE  1240.
002530     05  WK-806-1241-IDX   PIC S9(08) USAGE COMP    VALUE  1241.
002540     05  WK-806-1242-IDX   PIC S9(08) USAGE COMP    VALUE  1242.
002550     05  WK-806-1243-IDX   PIC S9(08) USAGE COMP    VALUE  1243.
002560     05  WK-806-1244-IDX   PIC S9(08) USAGE COMP    VALUE  1244.
002570     05  WK-806-1245-IDX   PIC S9(08) USAGE COMP    VALUE  1245.
002580     05  WK-806-1246-IDX   PIC S9(08) USAGE COMP    VALUE  1246.
002590     05  WK-806-1247-IDX   PIC S9(08) USAGE COMP    VALUE  1247.
002600     05  WK-806-1248-IDX   PIC S9(08) USAGE COMP    VALUE  1248.
002610     05  WK-806-1249-IDX   PIC S9(08) USAGE COMP    VALUE  1249.
002620     05  WK-806-1250-IDX   PIC S9(08) USAGE COMP    VALUE  1250.
002630     05  WK-806-1251-IDX   PIC S9(08) USAGE COMP    VALUE  1251.
002640     05  WK-806-1252-IDX   PIC S9(08) USAGE COMP    VALUE  1252.
002650     05  WK-806-1253-IDX   PIC S9(08) USAGE COMP    VALUE  1253.
002660     05  WK-806-1254-IDX   PIC S9(08) USAGE COMP    VALUE  1254.
002670     05  WK-806-1255-IDX   PIC S9(08) USAGE COMP    VALUE  1255.
002680     05  WK-806-1256-IDX   PIC S9(08) USAGE COMP    VALUE  1256.
002690     05  WK-806-1257-IDX   PIC S9(08) USAGE COMP    VALUE  1257.
002700     05  WK-806-1258-IDX   PIC S9(08) USAGE COMP    VALUE  1258.
002710     05  WK-806-1259-IDX   PIC S9(08) USAGE COMP    VALUE  1259.
002720     05  WK-806-1260-IDX   PIC S9(08) USAGE COMP    VALUE  1260.
002730     05  WK-806-1261-IDX   PIC S9(08) USAGE COMP    VALUE  1261.
002740     05  WK-806-1262-IDX   PIC S9(08) USAGE COMP    VALUE  1262.
002750     05  WK-806-1263-IDX   PIC S9(08) USAGE COMP    VALUE  1263.
002760     05  WK-806-1264-IDX   PIC S9(08) USAGE COMP    VALUE  1264.
002770     05  WK-806-1265-IDX   PIC S9(08) USAGE COMP    VALUE  1265.
002780     05  WK-806-1266-IDX   PIC S9(08) USAGE COMP    VALUE  1266.
002790     05  WK-806-1267-IDX   PIC S9(08) USAGE COMP    VALUE  1267.
002800     05  WK-806-1268-IDX   PIC S9(08) USAGE COMP    VALUE  1268.
002810     05  WK-806-1269-IDX   PIC S9(08) USAGE COMP    VALUE  1269.
002820     05  WK-806-1270-IDX   PIC S9(08) USAGE COMP    VALUE  1270.
002830     05  WK-806-1271-IDX   PIC S9(08) USAGE COMP    VALUE  1271.
002840     05  WK-806-1272-IDX   PIC S9(08) USAGE COMP    VALUE  1272.
002850     05  WK-806-1273-IDX   PIC S9(08) USAGE COMP    VALUE  1273.
002860     05  WK-806-1274-IDX   PIC S9(08) USAGE COMP    VALUE  1274.
002870     05  WK-806-1275-IDX   PIC S9(08) USAGE COMP    VALUE  1275.
002880     05  WK-806-1276-IDX   PIC S9(08) USAGE COMP    VALUE  1276.
002890     05  WK-806-1277-IDX   PIC S9(08) USAGE COMP    VALUE  1277.
002900     05  WK-806-1278-IDX   PIC S9(08) USAGE COMP    VALUE  1278.
002910     05  WK-806-1279-IDX   PIC S9(08) USAGE COMP    VALUE  1279.
002920     05  WK-806-1280-IDX   PIC S9(08) USAGE COMP    VALUE  1280.
002930     05  WK-806-1281-IDX   PIC S9(08) USAGE COMP    VALUE  1281.
002940     05  WK-806-1282-IDX   PIC S9(08) USAGE COMP    VALUE  1282.
002950     05  WK-806-1283-IDX   PIC S9(08) USAGE COMP    VALUE  1283.
002960     05  WK-806-1284-IDX   PIC S9(08) USAGE COMP    VALUE  1284.
002970     05  WK-806-1285-IDX   PIC S9(08) USAGE COMP    VALUE  1285.
002980     05  WK-806-1286-IDX   PIC S9(08) USAGE COMP    VALUE  1286.
002990     05  WK-806-1287-IDX   PIC S9(08) USAGE COMP    VALUE  1287.
003000     05  WK-806-1288-IDX   PIC S9(08) USAGE COMP    VALUE  1288.
003010     05  WK-806-1289-IDX   PIC S9(08) USAGE COMP    VALUE  1289.
003020     05  WK-806-1290-IDX   PIC S9(08) USAGE COMP    VALUE  1290.
003030     05  WK-806-1291-IDX   PIC S9(08) USAGE COMP    VALUE  1291.
003040     05  WK-806-1292-IDX   PIC S9(08) USAGE COMP    VALUE  1292.
003050     05  WK-806-1293-IDX   PIC S9(08) USAGE COMP    VALUE  1293.
003060     05  WK-806-1294-IDX   PIC S9(08) USAGE COMP    VALUE  1294.
003070     05  WK-806-1295-IDX   PIC S9(08) USAGE COMP    VALUE  1295.
003080     05  WK-806-1296-IDX   PIC S9(08) USAGE COMP    VALUE  1296.
003090     05  WK-806-1297-IDX   PIC S9(08) USAGE COMP    VALUE  1297.
003100     05  WK-806-1298-IDX   PIC S9(08) USAGE COMP    VALUE  1298.
003110     05  WK-806-1299-IDX   PIC S9(08) USAGE COMP    VALUE  1299.
003120     05  WK-806-1300-IDX   PIC S9(08) USAGE COMP    VALUE  1300.
003130     05  WK-806-1301-IDX   PIC S9(08) USAGE COMP    VALUE  1301.
003140     05  WK-806-1302-IDX   PIC S9(08) USAGE COMP    VALUE  1302.
003150     05  WK-806-1303-IDX   PIC S9(08) USAGE COMP    VALUE  1303.
003160     05  WK-806-1304-IDX   PIC S9(08) USAGE COMP    VALUE  1304.
003170     05  WK-806-1305-IDX   PIC S9(08) USAGE COMP    VALUE  1305.
003180     05  WK-806-1306-IDX   PIC S9(08) USAGE COMP    VALUE  1306.
003190     05  WK-806-1307-IDX   PIC S9(08) USAGE COMP    VALUE  1307.
003200     05  WK-806-1308-IDX   PIC S9(08) USAGE COMP    VALUE  1308.
003210     05  WK-806-1309-IDX   PIC S9(08) USAGE COMP    VALUE  1309.
003220     05  WK-806-1310-IDX   PIC S9(08) USAGE COMP    VALUE  1310.
003230     05  WK-806-1311-IDX   PIC S9(08) USAGE COMP    VALUE  1311.
003240     05  WK-806-1312-IDX   PIC S9(08) USAGE COMP    VALUE  1312.
003250     05  WK-806-1313-IDX   PIC S9(08) USAGE COMP    VALUE  1313.
003260     05  WK-806-1314-IDX   PIC S9(08) USAGE COMP    VALUE  1314.
003270     05  WK-806-1315-IDX   PIC S9(08) USAGE COMP    VALUE  1315.
003280     05  WK-806-1316-IDX   PIC S9(08) USAGE COMP    VALUE  1316.
003290     05  WK-806-1317-IDX   PIC S9(08) USAGE COMP    VALUE  1317.
003300     05  WK-806-1318-IDX   PIC S9(08) USAGE COMP    VALUE  1318.
003310     05  WK-806-1319-IDX   PIC S9(08) USAGE COMP    VALUE  1319.
003320     05  WK-806-1320-IDX   PIC S9(08) USAGE COMP    VALUE  1320.
003330     05  WK-806-1321-IDX   PIC S9(08) USAGE COMP    VALUE  1321.
003340     05  WK-806-1322-IDX   PIC S9(08) USAGE COMP    VALUE  1322.
003350     05  WK-806-1323-IDX   PIC S9(08) USAGE COMP    VALUE  1323.
003360     05  WK-806-1324-IDX   PIC S9(08) USAGE COMP    VALUE  1324.
003370     05  WK-806-1325-IDX   PIC S9(08) USAGE COMP    VALUE  1325.
003380     05  WK-806-1326-IDX   PIC S9(08) USAGE COMP    VALUE  1326.
003390     05  WK-806-1327-IDX   PIC S9(08) USAGE COMP    VALUE  1327.
003400     05  WK-806-1328-IDX   PIC S9(08) USAGE COMP    VALUE  1328.
003410     05  WK-806-1329-IDX   PIC S9(08) USAGE COMP    VALUE  1329.
003420     05  WK-806-1330-IDX   PIC S9(08) USAGE COMP    VALUE  1330.
003430     05  WK-806-1331-IDX   PIC S9(08) USAGE COMP    VALUE  1331.
003440     05  WK-806-1332-IDX   PIC S9(08) USAGE COMP    VALUE  1332.
003450     05  WK-806-1333-IDX   PIC S9(08) USAGE COMP    VALUE  1333.
003460     05  WK-806-1334-IDX   PIC S9(08) USAGE COMP    VALUE  1334.
003470     05  WK-806-1335-IDX   PIC S9(08) USAGE COMP    VALUE  1335.
003480     05  WK-806-1336-IDX   PIC S9(08) USAGE COMP    VALUE  1336.
003490     05  WK-806-1337-IDX   PIC S9(08) USAGE COMP    VALUE  1337.
003500     05  WK-806-1338-IDX   PIC S9(08) USAGE COMP    VALUE  1338.
003510     05  WK-806-1339-IDX   PIC S9(08) USAGE COMP    VALUE  1339.
003520     05  WK-806-1340-IDX   PIC S9(08) USAGE COMP    VALUE  1340.
003530     05  WK-806-1341-IDX   PIC S9(08) USAGE COMP    VALUE  1341.
003540     05  WK-806-1342-IDX   PIC S9(08) USAGE COMP    VALUE  1342.
003550     05  WK-806-1343-IDX   PIC S9(08) USAGE COMP    VALUE  1343.
003560     05  WK-806-1344-IDX   PIC S9(08) USAGE COMP    VALUE  1344.
003570     05  WK-806-1345-IDX   PIC S9(08) USAGE COMP    VALUE  1345.
003580     05  WK-806-1346-IDX   PIC S9(08) USAGE COMP    VALUE  1346.
003590     05  WK-806-1347-IDX   PIC S9(08) USAGE COMP    VALUE  1347.
003600     05  WK-806-1348-IDX   PIC S9(08) USAGE COMP    VALUE  1348.
003610     05  WK-806-1349-IDX   PIC S9(08) USAGE COMP    VALUE  1349.
003620     05  WK-806-1350-IDX   PIC S9(08) USAGE COMP    VALUE  1350.
003630     05  WK-806-1351-IDX   PIC S9(08) USAGE COMP    VALUE  1351.
003640     05  WK-806-1352-IDX   PIC S9(08) USAGE COMP    VALUE  1352.
003650     05  WK-806-1353-IDX   PIC S9(08) USAGE COMP    VALUE  1353.
003660     05  WK-806-1354-IDX   PIC S9(08) USAGE COMP    VALUE  1354.
003670     05  WK-806-1355-IDX   PIC S9(08) USAGE COMP    VALUE  1355.
003680     05  WK-806-1356-IDX   PIC S9(08) USAGE COMP    VALUE  1356.
003690     05  WK-806-1357-IDX   PIC S9(08) USAGE COMP    VALUE  1357.
003700     05  WK-806-1358-IDX   PIC S9(08) USAGE COMP    VALUE  1358.
003710     05  WK-806-1359-IDX   PIC S9(08) USAGE COMP    VALUE  1359.
003720     05  WK-806-1360-IDX   PIC S9(08) USAGE COMP    VALUE  1360.
003730     05  WK-806-1361-IDX   PIC S9(08) USAGE COMP    VALUE  1361.
003740     05  WK-806-1362-IDX   PIC S9(08) USAGE COMP    VALUE  1362.
003750     05  WK-806-1363-IDX   PIC S9(08) USAGE COMP    VALUE  1363.
003760     05  WK-806-1364-IDX   PIC S9(08) USAGE COMP    VALUE  1364.
003770     05  WK-806-1365-IDX   PIC S9(08) USAGE COMP    VALUE  1365.
003780     05  WK-806-1366-IDX   PIC S9(08) USAGE COMP    VALUE  1366.
003790     05  WK-806-1367-IDX   PIC S9(08) USAGE COMP    VALUE  1367.
003800     05  WK-806-1368-IDX   PIC S9(08) USAGE COMP    VALUE  1368.
003810     05  WK-806-1369-IDX   PIC S9(08) USAGE COMP    VALUE  1369.
003820     05  WK-806-1370-IDX   PIC S9(08) USAGE COMP    VALUE  1370.
003830     05  WK-806-1371-IDX   PIC S9(08) USAGE COMP    VALUE  1371.
003840     05  WK-806-1372-IDX   PIC S9(08) USAGE COMP    VALUE  1372.
003850     05  WK-806-1373-IDX   PIC S9(08) USAGE COMP    VALUE  1373.
003860     05  WK-806-1374-IDX   PIC S9(08) USAGE COMP    VALUE  1374.
003870     05  WK-806-1375-IDX   PIC S9(08) USAGE COMP    VALUE  1375.
003880     05  WK-806-1376-IDX   PIC S9(08) USAGE COMP    VALUE  1376.
003890     05  WK-806-1377-IDX   PIC S9(08) USAGE COMP    VALUE  1377.
003900     05  WK-806-1378-IDX   PIC S9(08) USAGE COMP    VALUE  1378.
003910     05  WK-806-1379-IDX   PIC S9(08) USAGE COMP    VALUE  1379.
003920     05  WK-806-1380-IDX   PIC S9(08) USAGE COMP    VALUE  1380.
003930     05  WK-806-1381-IDX   PIC S9(08) USAGE COMP    VALUE  1381.
003940     05  WK-806-1382-IDX   PIC S9(08) USAGE COMP    VALUE  1382.
003950     05  WK-806-1383-IDX   PIC S9(08) USAGE COMP    VALUE  1383.
003960     05  WK-806-1384-IDX   PIC S9(08) USAGE COMP    VALUE  1384.
003970     05  WK-806-1385-IDX   PIC S9(08) USAGE COMP    VALUE  1385.
003980     05  WK-806-1386-IDX   PIC S9(08) USAGE COMP    VALUE  1386.
003990     05  WK-806-1387-IDX   PIC S9(08) USAGE COMP    VALUE  1387.
004000     05  WK-806-1388-IDX   PIC S9(08) USAGE COMP    VALUE  1388.
004010     05  WK-806-1389-IDX   PIC S9(08) USAGE COMP    VALUE  1389.
004020     05  WK-806-1390-IDX   PIC S9(08) USAGE COMP    VALUE  1390.
004030     05  WK-806-1391-IDX   PIC S9(08) USAGE COMP    VALUE  1391.
004040     05  WK-806-1392-IDX   PIC S9(08) USAGE COMP    VALUE  1392.
004050     05  WK-806-1393-IDX   PIC S9(08) USAGE COMP    VALUE  1393.
004060     05  WK-806-1394-IDX   PIC S9(08) USAGE COMP    VALUE  1394.
004070     05  WK-806-1395-IDX   PIC S9(08) USAGE COMP    VALUE  1395.
004080     05  WK-806-1396-IDX   PIC S9(08) USAGE COMP    VALUE  1396.
004090     05  WK-806-1397-IDX   PIC S9(08) USAGE COMP    VALUE  1397.
004100     05  WK-806-1398-IDX   PIC S9(08) USAGE COMP    VALUE  1398.
004110     05  WK-806-1399-IDX   PIC S9(08) USAGE COMP    VALUE  1399.
004120     05  WK-806-1400-IDX   PIC S9(08) USAGE COMP    VALUE  1400.
004130     05  WK-806-1401-IDX   PIC S9(08) USAGE COMP    VALUE  1401.
004140     05  WK-806-1402-IDX   PIC S9(08) USAGE COMP    VALUE  1402.
004150     05  WK-806-1403-IDX   PIC S9(08) USAGE COMP    VALUE  1403.
004160     05  WK-806-1404-IDX   PIC S9(08) USAGE COMP    VALUE  1404.
004170     05  WK-806-1405-IDX   PIC S9(08) USAGE COMP    VALUE  1405.
004180     05  WK-806-1406-IDX   PIC S9(08) USAGE COMP    VALUE  1406.
004190     05  WK-806-1407-IDX   PIC S9(08) USAGE COMP    VALUE  1407.
004200     05  WK-806-1408-IDX   PIC S9(08) USAGE COMP    VALUE  1408.
004210     05  WK-806-1409-IDX   PIC S9(08) USAGE COMP    VALUE  1409.
004220     05  WK-806-1410-IDX   PIC S9(08) USAGE COMP    VALUE  1410.
004230     05  WK-806-1411-IDX   PIC S9(08) USAGE COMP    VALUE  1411.
004240     05  WK-806-1412-IDX   PIC S9(08) USAGE COMP    VALUE  1412.
004250     05  WK-806-1413-IDX   PIC S9(08) USAGE COMP    VALUE  1413.
004260     05  WK-806-1414-IDX   PIC S9(08) USAGE COMP    VALUE  1414.
004270     05  WK-806-1415-IDX   PIC S9(08) USAGE COMP    VALUE  1415.
004280     05  WK-806-1416-IDX   PIC S9(08) USAGE COMP    VALUE  1416.
004290     05  WK-806-1417-IDX   PIC S9(08) USAGE COMP    VALUE  1417.
004300     05  WK-806-1418-IDX   PIC S9(08) USAGE COMP    VALUE  1418.
004310     05  WK-806-1419-IDX   PIC S9(08) USAGE COMP    VALUE  1419.
004320     05  WK-806-1420-IDX   PIC S9(08) USAGE COMP    VALUE  1420.
004330     05  WK-806-1421-IDX   PIC S9(08) USAGE COMP    VALUE  1421.
004340     05  WK-806-1422-IDX   PIC S9(08) USAGE COMP    VALUE  1422.
004350     05  WK-806-1423-IDX   PIC S9(08) USAGE COMP    VALUE  1423.
004360     05  WK-806-1424-IDX   PIC S9(08) USAGE COMP    VALUE  1424.
004370     05  WK-806-1425-IDX   PIC S9(08) USAGE COMP    VALUE  1425.
004380     05  WK-806-1426-IDX   PIC S9(08) USAGE COMP    VALUE  1426.
004390     05  WK-806-1427-IDX   PIC S9(08) USAGE COMP    VALUE  1427.
004400     05  WK-806-1428-IDX   PIC S9(08) USAGE COMP    VALUE  1428.
004410     05  WK-806-1429-IDX   PIC S9(08) USAGE COMP    VALUE  1429.
004420     05  WK-806-1430-IDX   PIC S9(08) USAGE COMP    VALUE  1430.
004430     05  WK-806-1431-IDX   PIC S9(08) USAGE COMP    VALUE  1431.
004440     05  WK-806-1432-IDX   PIC S9(08) USAGE COMP    VALUE  1432.
004450     05  WK-806-1433-IDX   PIC S9(08) USAGE COMP    VALUE  1433.
004460     05  WK-806-1434-IDX   PIC S9(08) USAGE COMP    VALUE  1434.
004470     05  WK-806-1435-IDX   PIC S9(08) USAGE COMP    VALUE  1435.
004480     05  WK-806-1436-IDX   PIC S9(08) USAGE COMP    VALUE  1436.
004490     05  WK-806-1437-IDX   PIC S9(08) USAGE COMP    VALUE  1437.
004500     05  WK-806-1438-IDX   PIC S9(08) USAGE COMP    VALUE  1438.
004510     05  WK-806-1439-IDX   PIC S9(08) USAGE COMP    VALUE  1439.
004520     05  WK-806-1440-IDX   PIC S9(08) USAGE COMP    VALUE  1440.
004530     05  WK-806-1441-IDX   PIC S9(08) USAGE COMP    VALUE  1441.
004540     05  WK-806-1442-IDX   PIC S9(08) USAGE COMP    VALUE  1442.
004550     05  WK-806-1443-IDX   PIC S9(08) USAGE COMP    VALUE  1443.
004560     05  WK-806-1444-IDX   PIC S9(08) USAGE COMP    VALUE  1444.
004570     05  WK-806-1445-IDX   PIC S9(08) USAGE COMP    VALUE  1445.
004580     05  WK-806-1446-IDX   PIC S9(08) USAGE COMP    VALUE  1446.
004590     05  WK-806-1447-IDX   PIC S9(08) USAGE COMP    VALUE  1447.
004600     05  WK-806-1448-IDX   PIC S9(08) USAGE COMP    VALUE  1448.
004610     05  WK-806-1449-IDX   PIC S9(08) USAGE COMP    VALUE  1449.
004620     05  WK-806-1450-IDX   PIC S9(08) USAGE COMP    VALUE  1450.
004630     05  WK-806-1451-IDX   PIC S9(08) USAGE COMP    VALUE  1451.
004640     05  WK-806-1452-IDX   PIC S9(08) USAGE COMP    VALUE  1452.
004650     05  WK-806-1453-IDX   PIC S9(08) USAGE COMP    VALUE  1453.
004660     05  WK-806-1454-IDX   PIC S9(08) USAGE COMP    VALUE  1454.
004670     05  WK-806-1455-IDX   PIC S9(08) USAGE COMP    VALUE  1455.
004680     05  WK-806-1456-IDX   PIC S9(08) USAGE COMP    VALUE  1456.
004690     05  WK-806-1457-IDX   PIC S9(08) USAGE COMP    VALUE  1457.
004700     05  WK-806-1458-IDX   PIC S9(08) USAGE COMP    VALUE  1458.
004710     05  WK-806-1459-IDX   PIC S9(08) USAGE COMP    VALUE  1459.
004720     05  WK-806-1460-IDX   PIC S9(08) USAGE COMP    VALUE  1460.
004730     05  WK-806-1461-IDX   PIC S9(08) USAGE COMP    VALUE  1461.
004740     05  WK-806-1462-IDX   PIC S9(08) USAGE COMP    VALUE  1462.
004750     05  WK-806-1463-IDX   PIC S9(08) USAGE COMP    VALUE  1463.
004760     05  WK-806-1464-IDX   PIC S9(08) USAGE COMP    VALUE  1464.
004770     05  WK-806-1465-IDX   PIC S9(08) USAGE COMP    VALUE  1465.
004780     05  WK-806-1466-IDX   PIC S9(08) USAGE COMP    VALUE  1466.
004790     05  WK-806-1467-IDX   PIC S9(08) USAGE COMP    VALUE  1467.
004800     05  WK-806-1468-IDX   PIC S9(08) USAGE COMP    VALUE  1468.
004810     05  WK-806-1469-IDX   PIC S9(08) USAGE COMP    VALUE  1469.
004820     05  WK-806-1470-IDX   PIC S9(08) USAGE COMP    VALUE  1470.
004830     05  WK-806-1471-IDX   PIC S9(08) USAGE COMP    VALUE  1471.
004840     05  WK-806-1472-IDX   PIC S9(08) USAGE COMP    VALUE  1472.
004850     05  WK-806-1473-IDX   PIC S9(08) USAGE COMP    VALUE  1473.
004860     05  WK-806-1474-IDX   PIC S9(08) USAGE COMP    VALUE  1474.
004870     05  WK-806-1475-IDX   PIC S9(08) USAGE COMP    VALUE  1475.
004880     05  WK-806-1476-IDX   PIC S9(08) USAGE COMP    VALUE  1476.
004890     05  WK-806-1477-IDX   PIC S9(08) USAGE COMP    VALUE  1477.
004900     05  WK-806-1478-IDX   PIC S9(08) USAGE COMP    VALUE  1478.
004910     05  WK-806-1479-IDX   PIC S9(08) USAGE COMP    VALUE  1479.
004920     05  WK-806-1480-IDX   PIC S9(08) USAGE COMP    VALUE  1480.
004930     05  WK-806-1481-IDX   PIC S9(08) USAGE COMP    VALUE  1481.
004940     05  WK-806-1482-IDX   PIC S9(08) USAGE COMP    VALUE  1482.
004950     05  WK-806-1483-IDX   PIC S9(08) USAGE COMP    VALUE  1483.
004960     05  WK-806-1484-IDX   PIC S9(08) USAGE COMP    VALUE  1484.
004970     05  WK-806-1485-IDX   PIC S9(08) USAGE COMP    VALUE  1485.
004980     05  WK-806-1486-IDX   PIC S9(08) USAGE COMP    VALUE  1486.
004990     05  WK-806-1487-IDX   PIC S9(08) USAGE COMP    VALUE  1487.
005000     05  WK-806-1488-IDX   PIC S9(08) USAGE COMP    VALUE  1488.
005010     05  WK-806-1489-IDX   PIC S9(08) USAGE COMP    VALUE  1489.
005020     05  WK-806-1490-IDX   PIC S9(08) USAGE COMP    VALUE  1490.
005030     05  WK-806-1491-IDX   PIC S9(08) USAGE COMP    VALUE  1491.
005040     05  WK-806-1492-IDX   PIC S9(08) USAGE COMP    VALUE  1492.
005050     05  WK-806-1493-IDX   PIC S9(08) USAGE COMP    VALUE  1493.
005060     05  WK-806-1494-IDX   PIC S9(08) USAGE COMP    VALUE  1494.
005070     05  WK-806-1495-IDX   PIC S9(08) USAGE COMP    VALUE  1495.
005080     05  WK-806-1496-IDX   PIC S9(08) USAGE COMP    VALUE  1496.
005090     05  WK-806-1497-IDX   PIC S9(08) USAGE COMP    VALUE  1497.
005100     05  WK-806-1498-IDX   PIC S9(08) USAGE COMP    VALUE  1498.
005110     05  WK-806-1499-IDX   PIC S9(08) USAGE COMP    VALUE  1499.
005120     05  WK-806-1500-IDX   PIC S9(08) USAGE COMP    VALUE  1500.
005130     05  WK-806-1501-IDX   PIC S9(08) USAGE COMP    VALUE  1501.
005140     05  WK-806-1502-IDX   PIC S9(08) USAGE COMP    VALUE  1502.
005150     05  WK-806-1503-IDX   PIC S9(08) USAGE COMP    VALUE  1503.
005160     05  WK-806-1504-IDX   PIC S9(08) USAGE COMP    VALUE  1504.
005170     05  WK-806-1505-IDX   PIC S9(08) USAGE COMP    VALUE  1505.
005180     05  WK-806-1506-IDX   PIC S9(08) USAGE COMP    VALUE  1506.
005190     05  WK-806-1507-IDX   PIC S9(08) USAGE COMP    VALUE  1507.
005200     05  WK-806-1508-IDX   PIC S9(08) USAGE COMP    VALUE  1508.
005210     05  WK-806-1509-IDX   PIC S9(08) USAGE COMP    VALUE  1509.
005220     05  WK-806-1510-IDX   PIC S9(08) USAGE COMP    VALUE  1510.
005230     05  WK-806-1511-IDX   PIC S9(08) USAGE COMP    VALUE  1511.
005240     05  WK-806-1512-IDX   PIC S9(08) USAGE COMP    VALUE  1512.
005250     05  WK-806-1513-IDX   PIC S9(08) USAGE COMP    VALUE  1513.
005260     05  WK-806-1514-IDX   PIC S9(08) USAGE COMP    VALUE  1514.
005270     05  WK-806-1515-IDX   PIC S9(08) USAGE COMP    VALUE  1515.
005280     05  WK-806-1516-IDX   PIC S9(08) USAGE COMP    VALUE  1516.
005290     05  WK-806-1517-IDX   PIC S9(08) USAGE COMP    VALUE  1517.
005300     05  WK-806-1518-IDX   PIC S9(08) USAGE COMP    VALUE  1518.
005310     05  WK-806-1519-IDX   PIC S9(08) USAGE COMP    VALUE  1519.
005320     05  WK-806-1520-IDX   PIC S9(08) USAGE COMP    VALUE  1520.
005330     05  WK-806-1521-IDX   PIC S9(08) USAGE COMP    VALUE  1521.
005340     05  WK-806-1522-IDX   PIC S9(08) USAGE COMP    VALUE  1522.
005350     05  WK-806-1523-IDX   PIC S9(08) USAGE COMP    VALUE  1523.
005360     05  WK-806-1524-IDX   PIC S9(08) USAGE COMP    VALUE  1524.
005370     05  WK-806-1525-IDX   PIC S9(08) USAGE COMP    VALUE  1525.
005380     05  WK-806-1526-IDX   PIC S9(08) USAGE COMP    VALUE  1526.
005390     05  WK-806-1527-IDX   PIC S9(08) USAGE COMP    VALUE  1527.
005400     05  WK-806-1528-IDX   PIC S9(08) USAGE COMP    VALUE  1528.
005410     05  WK-806-1529-IDX   PIC S9(08) USAGE COMP    VALUE  1529.
005420     05  WK-806-1530-IDX   PIC S9(08) USAGE COMP    VALUE  1530.
005430     05  WK-806-1531-IDX   PIC S9(08) USAGE COMP    VALUE  1531.
005440     05  WK-806-1532-IDX   PIC S9(08) USAGE COMP    VALUE  1532.
005450     05  WK-806-1533-IDX   PIC S9(08) USAGE COMP    VALUE  1533.
005460     05  WK-806-1534-IDX   PIC S9(08) USAGE COMP    VALUE  1534.
005470     05  WK-806-1535-IDX   PIC S9(08) USAGE COMP    VALUE  1535.
005480     05  WK-806-1536-IDX   PIC S9(08) USAGE COMP    VALUE  1536.
005490     05  WK-806-1537-IDX   PIC S9(08) USAGE COMP    VALUE  1537.
005500     05  WK-806-1538-IDX   PIC S9(08) USAGE COMP    VALUE  1538.
005510     05  WK-806-1539-IDX   PIC S9(08) USAGE COMP    VALUE  1539.
005520     05  WK-806-1540-IDX   PIC S9(08) USAGE COMP    VALUE  1540.
005530     05  WK-806-1541-IDX   PIC S9(08) USAGE COMP    VALUE  1541.
005540     05  WK-806-1542-IDX   PIC S9(08) USAGE COMP    VALUE  1542.
005550     05  WK-806-1543-IDX   PIC S9(08) USAGE COMP    VALUE  1543.
005560     05  WK-806-1544-IDX   PIC S9(08) USAGE COMP    VALUE  1544.
005570     05  WK-806-1545-IDX   PIC S9(08) USAGE COMP    VALUE  1545.
005580     05  WK-806-1546-IDX   PIC S9(08) USAGE COMP    VALUE  1546.
005590     05  WK-806-1547-IDX   PIC S9(08) USAGE COMP    VALUE  1547.
005600     05  WK-806-1548-IDX   PIC S9(08) USAGE COMP    VALUE  1548.
005610     05  WK-806-1549-IDX   PIC S9(08) USAGE COMP    VALUE  1549.
005620     05  WK-806-1550-IDX   PIC S9(08) USAGE COMP    VALUE  1550.
005630     05  WK-806-1551-IDX   PIC S9(08) USAGE COMP    VALUE  1551.
005640     05  WK-806-1552-IDX   PIC S9(08) USAGE COMP    VALUE  1552.
005650     05  WK-806-1553-IDX   PIC S9(08) USAGE COMP    VALUE  1553.
005660     05  WK-806-1554-IDX   PIC S9(08) USAGE COMP    VALUE  1554.
005670     05  WK-806-1555-IDX   PIC S9(08) USAGE COMP    VALUE  1555.
005680     05  WK-806-1556-IDX   PIC S9(08) USAGE COMP    VALUE  1556.
005690     05  WK-806-1557-IDX   PIC S9(08) USAGE COMP    VALUE  1557.
005700     05  WK-806-1558-IDX   PIC S9(08) USAGE COMP    VALUE  1558.
005710     05  WK-806-1559-IDX   PIC S9(08) USAGE COMP    VALUE  1559.
005720     05  WK-806-1560-IDX   PIC S9(08) USAGE COMP    VALUE  1560.
005730     05  WK-806-1561-IDX   PIC S9(08) USAGE COMP    VALUE  1561.
005740     05  WK-806-1562-IDX   PIC S9(08) USAGE COMP    VALUE  1562.
005750     05  WK-806-1563-IDX   PIC S9(08) USAGE COMP    VALUE  1563.
005760     05  WK-806-1564-IDX   PIC S9(08) USAGE COMP    VALUE  1564.
005770     05  WK-806-1565-IDX   PIC S9(08) USAGE COMP    VALUE  1565.
005780     05  WK-806-1566-IDX   PIC S9(08) USAGE COMP    VALUE  1566.
005790     05  WK-806-1567-IDX   PIC S9(08) USAGE COMP    VALUE  1567.
005800     05  WK-806-1568-IDX   PIC S9(08) USAGE COMP    VALUE  1568.
005810     05  WK-806-1569-IDX   PIC S9(08) USAGE COMP    VALUE  1569.
005820     05  WK-806-1570-IDX   PIC S9(08) USAGE COMP    VALUE  1570.
005830     05  WK-806-1571-IDX   PIC S9(08) USAGE COMP    VALUE  1571.
005840     05  WK-806-1572-IDX   PIC S9(08) USAGE COMP    VALUE  1572.
005850     05  WK-806-1573-IDX   PIC S9(08) USAGE COMP    VALUE  1573.
005860     05  WK-806-1574-IDX   PIC S9(08) USAGE COMP    VALUE  1574.
005870     05  WK-806-1575-IDX   PIC S9(08) USAGE COMP    VALUE  1575.
005880     05  WK-806-1576-IDX   PIC S9(08) USAGE COMP    VALUE  1576.
005890     05  WK-806-1577-IDX   PIC S9(08) USAGE COMP    VALUE  1577.
005900     05  WK-806-1578-IDX   PIC S9(08) USAGE COMP    VALUE  1578.
005910     05  WK-806-1579-IDX   PIC S9(08) USAGE COMP    VALUE  1579.
005920     05  WK-806-1580-IDX   PIC S9(08) USAGE COMP    VALUE  1580.
005930     05  WK-806-1581-IDX   PIC S9(08) USAGE COMP    VALUE  1581.
005940     05  WK-806-1582-IDX   PIC S9(08) USAGE COMP    VALUE  1582.
005950     05  WK-806-1583-IDX   PIC S9(08) USAGE COMP    VALUE  1583.
005960     05  WK-806-1584-IDX   PIC S9(08) USAGE COMP    VALUE  1584.
005970     05  WK-806-1585-IDX   PIC S9(08) USAGE COMP    VALUE  1585.
005980     05  WK-806-1586-IDX   PIC S9(08) USAGE COMP    VALUE  1586.
005990     05  WK-806-1587-IDX   PIC S9(08) USAGE COMP    VALUE  1587.
006000     05  WK-806-1588-IDX   PIC S9(08) USAGE COMP    VALUE  1588.
006010     05  WK-806-1589-IDX   PIC S9(08) USAGE COMP    VALUE  1589.
006020     05  WK-806-1590-IDX   PIC S9(08) USAGE COMP    VALUE  1590.
006030     05  WK-806-1591-IDX   PIC S9(08) USAGE COMP    VALUE  1591.
006040     05  WK-806-1592-IDX   PIC S9(08) USAGE COMP    VALUE  1592.
006050     05  WK-806-1593-IDX   PIC S9(08) USAGE COMP    VALUE  1593.
006060     05  WK-806-1594-IDX   PIC S9(08) USAGE COMP    VALUE  1594.
006070     05  WK-806-1595-IDX   PIC S9(08) USAGE COMP    VALUE  1595.
006080     05  WK-806-1596-IDX   PIC S9(08) USAGE COMP    VALUE  1596.
006090     05  WK-806-1597-IDX   PIC S9(08) USAGE COMP    VALUE  1597.
006100     05  WK-806-1598-IDX   PIC S9(08) USAGE COMP    VALUE  1598.
006110     05  WK-806-1599-IDX   PIC S9(08) USAGE COMP    VALUE  1599.
006120     05  WK-806-1600-IDX   PIC S9(08) USAGE COMP    VALUE  1600.
006130     05  WK-806-1601-IDX   PIC S9(08) USAGE COMP    VALUE  1601.
006140     05  WK-806-1602-IDX   PIC S9(08) USAGE COMP    VALUE  1602.
006150     05  WK-806-1603-IDX   PIC S9(08) USAGE COMP    VALUE  1603.
006160     05  WK-806-1604-IDX   PIC S9(08) USAGE COMP    VALUE  1604.
006170     05  WK-806-1605-IDX   PIC S9(08) USAGE COMP    VALUE  1605.
006180     05  WK-806-1606-IDX   PIC S9(08) USAGE COMP    VALUE  1606.
006190     05  WK-806-1607-IDX   PIC S9(08) USAGE COMP    VALUE  1607.
006200     05  WK-806-1608-IDX   PIC S9(08) USAGE COMP    VALUE  1608.
006210     05  WK-806-1609-IDX   PIC S9(08) USAGE COMP    VALUE  1609.
006220     05  WK-806-1610-IDX   PIC S9(08) USAGE COMP    VALUE  1610.
006230     05  WK-806-1611-IDX   PIC S9(08) USAGE COMP    VALUE  1611.
006240     05  WK-806-1612-IDX   PIC S9(08) USAGE COMP    VALUE  1612.
006250     05  WK-806-1613-IDX   PIC S9(08) USAGE COMP    VALUE  1613.
006260     05  WK-806-1614-IDX   PIC S9(08) USAGE COMP    VALUE  1614.
006270     05  WK-806-1615-IDX   PIC S9(08) USAGE COMP    VALUE  1615.
006280     05  WK-806-1616-IDX   PIC S9(08) USAGE COMP    VALUE  1616.
006290     05  WK-806-1617-IDX   PIC S9(08) USAGE COMP    VALUE  1617.
006300     05  WK-806-1618-IDX   PIC S9(08) USAGE COMP    VALUE  1618.
006310     05  WK-806-1619-IDX   PIC S9(08) USAGE COMP    VALUE  1619.
006320     05  WK-806-1620-IDX   PIC S9(08) USAGE COMP    VALUE  1620.
006330     05  WK-806-1621-IDX   PIC S9(08) USAGE COMP    VALUE  1621.
006340     05  WK-806-1622-IDX   PIC S9(08) USAGE COMP    VALUE  1622.
006350     05  WK-806-1623-IDX   PIC S9(08) USAGE COMP    VALUE  1623.
006360     05  WK-806-1624-IDX   PIC S9(08) USAGE COMP    VALUE  1624.
006370     05  WK-806-1625-IDX   PIC S9(08) USAGE COMP    VALUE  1625.
006380     05  WK-806-1626-IDX   PIC S9(08) USAGE COMP    VALUE  1626.
006390     05  WK-806-1627-IDX   PIC S9(08) USAGE COMP    VALUE  1627.
006400     05  WK-806-1628-IDX   PIC S9(08) USAGE COMP    VALUE  1628.
006410     05  WK-806-1629-IDX   PIC S9(08) USAGE COMP    VALUE  1629.
006420     05  WK-806-1630-IDX   PIC S9(08) USAGE COMP    VALUE  1630.
006430     05  WK-806-1631-IDX   PIC S9(08) USAGE COMP    VALUE  1631.
006440     05  WK-806-1632-IDX   PIC S9(08) USAGE COMP    VALUE  1632.
006450     05  WK-806-1633-IDX   PIC S9(08) USAGE COMP    VALUE  1633.
006460     05  WK-806-1634-IDX   PIC S9(08) USAGE COMP    VALUE  1634.
006470     05  WK-806-1635-IDX   PIC S9(08) USAGE COMP    VALUE  1635.
006480     05  WK-806-1636-IDX   PIC S9(08) USAGE COMP    VALUE  1636.
006490     05  WK-806-1637-IDX   PIC S9(08) USAGE COMP    VALUE  1637.
006500     05  WK-806-1638-IDX   PIC S9(08) USAGE COMP    VALUE  1638.
006510     05  WK-806-1639-IDX   PIC S9(08) USAGE COMP    VALUE  1639.
006520     05  WK-806-1640-IDX   PIC S9(08) USAGE COMP    VALUE  1640.
006530     05  WK-806-1641-IDX   PIC S9(08) USAGE COMP    VALUE  1641.
006540     05  WK-806-1642-IDX   PIC S9(08) USAGE COMP    VALUE  1642.
006550     05  WK-806-1643-IDX   PIC S9(08) USAGE COMP    VALUE  1643.
006560     05  WK-806-1644-IDX   PIC S9(08) USAGE COMP    VALUE  1644.
006570     05  WK-806-1645-IDX   PIC S9(08) USAGE COMP    VALUE  1645.
006580     05  WK-806-1646-IDX   PIC S9(08) USAGE COMP    VALUE  1646.
006590     05  WK-806-1647-IDX   PIC S9(08) USAGE COMP    VALUE  1647.
006600     05  WK-806-1648-IDX   PIC S9(08) USAGE COMP    VALUE  1648.
006610     05  WK-806-1649-IDX   PIC S9(08) USAGE COMP    VALUE  1649.
006620     05  WK-806-1650-IDX   PIC S9(08) USAGE COMP    VALUE  1650.
006630     05  WK-806-1651-IDX   PIC S9(08) USAGE COMP    VALUE  1651.
006640     05  WK-806-1652-IDX   PIC S9(08) USAGE COMP    VALUE  1652.
006650     05  WK-806-1653-IDX   PIC S9(08) USAGE COMP    VALUE  1653.
006660     05  WK-806-1654-IDX   PIC S9(08) USAGE COMP    VALUE  1654.
006670     05  WK-806-1655-IDX   PIC S9(08) USAGE COMP    VALUE  1655.
006680     05  WK-806-1656-IDX   PIC S9(08) USAGE COMP    VALUE  1656.
006690     05  WK-806-1657-IDX   PIC S9(08) USAGE COMP    VALUE  1657.
006700     05  WK-806-1658-IDX   PIC S9(08) USAGE COMP    VALUE  1658.
006710     05  WK-806-1659-IDX   PIC S9(08) USAGE COMP    VALUE  1659.
006720     05  WK-806-1660-IDX   PIC S9(08) USAGE COMP    VALUE  1660.
006730     05  WK-806-1661-IDX   PIC S9(08) USAGE COMP    VALUE  1661.
006740     05  WK-806-1662-IDX   PIC S9(08) USAGE COMP    VALUE  1662.
006750     05  WK-806-1663-IDX   PIC S9(08) USAGE COMP    VALUE  1663.
006760     05  WK-806-1664-IDX   PIC S9(08) USAGE COMP    VALUE  1664.
006770     05  WK-806-1665-IDX   PIC S9(08) USAGE COMP    VALUE  1665.
006780     05  WK-806-1666-IDX   PIC S9(08) USAGE COMP    VALUE  1666.
006790     05  WK-806-1667-IDX   PIC S9(08) USAGE COMP    VALUE  1667.
006800     05  WK-806-1668-IDX   PIC S9(08) USAGE COMP    VALUE  1668.
006810     05  WK-806-1669-IDX   PIC S9(08) USAGE COMP    VALUE  1669.
006820     05  WK-806-1670-IDX   PIC S9(08) USAGE COMP    VALUE  1670.
006830     05  WK-806-1671-IDX   PIC S9(08) USAGE COMP    VALUE  1671.
006840     05  WK-806-1672-IDX   PIC S9(08) USAGE COMP    VALUE  1672.
006850     05  WK-806-1673-IDX   PIC S9(08) USAGE COMP    VALUE  1673.
006860     05  WK-806-1674-IDX   PIC S9(08) USAGE COMP    VALUE  1674.
006870     05  WK-806-1675-IDX   PIC S9(08) USAGE COMP    VALUE  1675.
006880     05  WK-806-1676-IDX   PIC S9(08) USAGE COMP    VALUE  1676.
006890     05  WK-806-1677-IDX   PIC S9(08) USAGE COMP    VALUE  1677.
006900     05  WK-806-1678-IDX   PIC S9(08) USAGE COMP    VALUE  1678.
006910     05  WK-806-1679-IDX   PIC S9(08) USAGE COMP    VALUE  1679.
006920     05  WK-806-1680-IDX   PIC S9(08) USAGE COMP    VALUE  1680.
006930     05  WK-806-1681-IDX   PIC S9(08) USAGE COMP    VALUE  1681.
006940     05  WK-806-1682-IDX   PIC S9(08) USAGE COMP    VALUE  1682.
006950     05  WK-806-1683-IDX   PIC S9(08) USAGE COMP    VALUE  1683.
006960     05  WK-806-1684-IDX   PIC S9(08) USAGE COMP    VALUE  1684.
006970     05  WK-806-1685-IDX   PIC S9(08) USAGE COMP    VALUE  1685.
006980     05  WK-806-1686-IDX   PIC S9(08) USAGE COMP    VALUE  1686.
006990     05  WK-806-1687-IDX   PIC S9(08) USAGE COMP    VALUE  1687.
007000     05  WK-806-1688-IDX   PIC S9(08) USAGE COMP    VALUE  1688.
007010     05  WK-806-1689-IDX   PIC S9(08) USAGE COMP    VALUE  1689.
007020     05  WK-806-1690-IDX   PIC S9(08) USAGE COMP    VALUE  1690.
007030     05  WK-806-1691-IDX   PIC S9(08) USAGE COMP    VALUE  1691.
007040     05  WK-806-1692-IDX   PIC S9(08) USAGE COMP    VALUE  1692.
007050     05  WK-806-1693-IDX   PIC S9(08) USAGE COMP    VALUE  1693.
007060     05  WK-806-1694-IDX   PIC S9(08) USAGE COMP    VALUE  1694.
007070     05  WK-806-1695-IDX   PIC S9(08) USAGE COMP    VALUE  1695.
007080     05  WK-806-1696-IDX   PIC S9(08) USAGE COMP    VALUE  1696.
007090     05  WK-806-1697-IDX   PIC S9(08) USAGE COMP    VALUE  1697.
007100     05  WK-806-1698-IDX   PIC S9(08) USAGE COMP    VALUE  1698.
007110     05  WK-806-1699-IDX   PIC S9(08) USAGE COMP    VALUE  1699.
007120     05  WK-806-1700-IDX   PIC S9(08) USAGE COMP    VALUE  1700.
007130     05  WK-806-1701-IDX   PIC S9(08) USAGE COMP    VALUE  1701.
007140     05  WK-806-1702-IDX   PIC S9(08) USAGE COMP    VALUE  1702.
007150     05  WK-806-1703-IDX   PIC S9(08) USAGE COMP    VALUE  1703.
007160     05  WK-806-1704-IDX   PIC S9(08) USAGE COMP    VALUE  1704.
007170     05  WK-806-1705-IDX   PIC S9(08) USAGE COMP    VALUE  1705.
007180     05  WK-806-1706-IDX   PIC S9(08) USAGE COMP    VALUE  1706.
007190     05  WK-806-1707-IDX   PIC S9(08) USAGE COMP    VALUE  1707.
007200     05  WK-806-1708-IDX   PIC S9(08) USAGE COMP    VALUE  1708.
007210     05  WK-806-1709-IDX   PIC S9(08) USAGE COMP    VALUE  1709.
007220     05  WK-806-1710-IDX   PIC S9(08) USAGE COMP    VALUE  1710.
007230     05  WK-806-1711-IDX   PIC S9(08) USAGE COMP    VALUE  1711.
007240     05  WK-806-1712-IDX   PIC S9(08) USAGE COMP    VALUE  1712.
007250     05  WK-806-1713-IDX   PIC S9(08) USAGE COMP    VALUE  1713.
007260     05  WK-806-1714-IDX   PIC S9(08) USAGE COMP    VALUE  1714.
007270     05  WK-806-1715-IDX   PIC S9(08) USAGE COMP    VALUE  1715.
007280     05  WK-806-1716-IDX   PIC S9(08) USAGE COMP    VALUE  1716.
007290     05  WK-806-1717-IDX   PIC S9(08) USAGE COMP    VALUE  1717.
007300     05  WK-806-1718-IDX   PIC S9(08) USAGE COMP    VALUE  1718.
007310     05  WK-806-1719-IDX   PIC S9(08) USAGE COMP    VALUE  1719.
007320     05  WK-806-1720-IDX   PIC S9(08) USAGE COMP    VALUE  1720.
007330     05  WK-806-1721-IDX   PIC S9(08) USAGE COMP    VALUE  1721.
007340     05  WK-806-1722-IDX   PIC S9(08) USAGE COMP    VALUE  1722.
007350     05  WK-806-1723-IDX   PIC S9(08) USAGE COMP    VALUE  1723.
007360     05  WK-806-1724-IDX   PIC S9(08) USAGE COMP    VALUE  1724.
007370     05  WK-806-1725-IDX   PIC S9(08) USAGE COMP    VALUE  1725.
007380     05  WK-806-1726-IDX   PIC S9(08) USAGE COMP    VALUE  1726.
007390     05  WK-806-1727-IDX   PIC S9(08) USAGE COMP    VALUE  1727.
007400     05  WK-806-1728-IDX   PIC S9(08) USAGE COMP    VALUE  1728.
007410     05  WK-806-1729-IDX   PIC S9(08) USAGE COMP    VALUE  1729.
007420     05  WK-806-1730-IDX   PIC S9(08) USAGE COMP    VALUE  1730.
007430     05  WK-806-1731-IDX   PIC S9(08) USAGE COMP    VALUE  1731.
007440     05  WK-806-1732-IDX   PIC S9(08) USAGE COMP    VALUE  1732.
007450     05  WK-806-1733-IDX   PIC S9(08) USAGE COMP    VALUE  1733.
007460     05  WK-806-1734-IDX   PIC S9(08) USAGE COMP    VALUE  1734.
007470     05  WK-806-1735-IDX   PIC S9(08) USAGE COMP    VALUE  1735.
007480     05  WK-806-1736-IDX   PIC S9(08) USAGE COMP    VALUE  1736.
007490     05  WK-806-1737-IDX   PIC S9(08) USAGE COMP    VALUE  1737.
007500     05  WK-806-1738-IDX   PIC S9(08) USAGE COMP    VALUE  1738.
007510     05  WK-806-1739-IDX   PIC S9(08) USAGE COMP    VALUE  1739.
007520     05  WK-806-1740-IDX   PIC S9(08) USAGE COMP    VALUE  1740.
007530     05  WK-806-1741-IDX   PIC S9(08) USAGE COMP    VALUE  1741.
007540     05  WK-806-1742-IDX   PIC S9(08) USAGE COMP    VALUE  1742.
007550     05  WK-806-1743-IDX   PIC S9(08) USAGE COMP    VALUE  1743.
007560     05  WK-806-1744-IDX   PIC S9(08) USAGE COMP    VALUE  1744.
007570     05  WK-806-1745-IDX   PIC S9(08) USAGE COMP    VALUE  1745.
007580     05  WK-806-1746-IDX   PIC S9(08) USAGE COMP    VALUE  1746.
007590     05  WK-806-1747-IDX   PIC S9(08) USAGE COMP    VALUE  1747.
007600     05  WK-806-1748-IDX   PIC S9(08) USAGE COMP    VALUE  1748.
007610     05  WK-806-1749-IDX   PIC S9(08) USAGE COMP    VALUE  1749.
007620     05  WK-806-1750-IDX   PIC S9(08) USAGE COMP    VALUE  1750.
007630     05  WK-806-1751-IDX   PIC S9(08) USAGE COMP    VALUE  1751.
007640     05  WK-806-1752-IDX   PIC S9(08) USAGE COMP    VALUE  1752.
007650     05  WK-806-1753-IDX   PIC S9(08) USAGE COMP    VALUE  1753.
007660     05  WK-806-1754-IDX   PIC S9(08) USAGE COMP    VALUE  1754.
007670     05  WK-806-1755-IDX   PIC S9(08) USAGE COMP    VALUE  1755.
007680     05  WK-806-1756-IDX   PIC S9(08) USAGE COMP    VALUE  1756.
007690     05  WK-806-1757-IDX   PIC S9(08) USAGE COMP    VALUE  1757.
007700     05  WK-806-1758-IDX   PIC S9(08) USAGE COMP    VALUE  1758.
007710     05  WK-806-1759-IDX   PIC S9(08) USAGE COMP    VALUE  1759.
007720     05  WK-806-1760-IDX   PIC S9(08) USAGE COMP    VALUE  1760.
007730     05  WK-806-1761-IDX   PIC S9(08) USAGE COMP    VALUE  1761.
007740     05  WK-806-1762-IDX   PIC S9(08) USAGE COMP    VALUE  1762.
007750     05  WK-806-1763-IDX   PIC S9(08) USAGE COMP    VALUE  1763.
007760     05  WK-806-1764-IDX   PIC S9(08) USAGE COMP    VALUE  1764.
007770     05  WK-806-1765-IDX   PIC S9(08) USAGE COMP    VALUE  1765.
007780     05  WK-806-1766-IDX   PIC S9(08) USAGE COMP    VALUE  1766.
007790     05  WK-806-1767-IDX   PIC S9(08) USAGE COMP    VALUE  1767.
007800     05  WK-806-1768-IDX   PIC S9(08) USAGE COMP    VALUE  1768.
007810     05  WK-806-1769-IDX   PIC S9(08) USAGE COMP    VALUE  1769.
007820     05  WK-806-1770-IDX   PIC S9(08) USAGE COMP    VALUE  1770.
007830     05  WK-806-1771-IDX   PIC S9(08) USAGE COMP    VALUE  1771.
007840     05  WK-806-1772-IDX   PIC S9(08) USAGE COMP    VALUE  1772.
007850     05  WK-806-1773-IDX   PIC S9(08) USAGE COMP    VALUE  1773.
007860     05  WK-806-1774-IDX   PIC S9(08) USAGE COMP    VALUE  1774.
007870     05  WK-806-1775-IDX   PIC S9(08) USAGE COMP    VALUE  1775.
007880     05  WK-806-1776-IDX   PIC S9(08) USAGE COMP    VALUE  1776.
007890     05  WK-806-1777-IDX   PIC S9(08) USAGE COMP    VALUE  1777.
007900     05  WK-806-1778-IDX   PIC S9(08) USAGE COMP    VALUE  1778.
007910     05  WK-806-1779-IDX   PIC S9(08) USAGE COMP    VALUE  1779.
007920     05  WK-806-1780-IDX   PIC S9(08) USAGE COMP    VALUE  1780.
007930     05  WK-806-1781-IDX   PIC S9(08) USAGE COMP    VALUE  1781.
007940     05  WK-806-1782-IDX   PIC S9(08) USAGE COMP    VALUE  1782.
007950     05  WK-806-1783-IDX   PIC S9(08) USAGE COMP    VALUE  1783.
007960     05  WK-806-1784-IDX   PIC S9(08) USAGE COMP    VALUE  1784.
007970     05  WK-806-1785-IDX   PIC S9(08) USAGE COMP    VALUE  1785.
007980     05  WK-806-1786-IDX   PIC S9(08) USAGE COMP    VALUE  1786.
007990     05  WK-806-1787-IDX   PIC S9(08) USAGE COMP    VALUE  1787.
008000     05  WK-806-1788-IDX   PIC S9(08) USAGE COMP    VALUE  1788.
008010     05  WK-806-1789-IDX   PIC S9(08) USAGE COMP    VALUE  1789.
008020     05  WK-806-1790-IDX   PIC S9(08) USAGE COMP    VALUE  1790.
008030     05  WK-806-1791-IDX   PIC S9(08) USAGE COMP    VALUE  1791.
008040     05  WK-806-1792-IDX   PIC S9(08) USAGE COMP    VALUE  1792.
008050     05  WK-806-1793-IDX   PIC S9(08) USAGE COMP    VALUE  1793.
008060     05  WK-806-1794-IDX   PIC S9(08) USAGE COMP    VALUE  1794.
008070     05  WK-806-1795-IDX   PIC S9(08) USAGE COMP    VALUE  1795.
008080     05  WK-806-1796-IDX   PIC S9(08) USAGE COMP    VALUE  1796.
008090     05  WK-806-1797-IDX   PIC S9(08) USAGE COMP    VALUE  1797.
008100     05  WK-806-1798-IDX   PIC S9(08) USAGE COMP    VALUE  1798.
008110     05  WK-806-1799-IDX   PIC S9(08) USAGE COMP    VALUE  1799.
008120     05  WK-806-1800-IDX   PIC S9(08) USAGE COMP    VALUE  1800.
008130     05  WK-806-1801-IDX   PIC S9(08) USAGE COMP    VALUE  1801.
008140     05  WK-806-1802-IDX   PIC S9(08) USAGE COMP    VALUE  1802.
008150     05  WK-806-1803-IDX   PIC S9(08) USAGE COMP    VALUE  1803.
008160     05  WK-806-1804-IDX   PIC S9(08) USAGE COMP    VALUE  1804.
008170     05  WK-806-1805-IDX   PIC S9(08) USAGE COMP    VALUE  1805.
008180     05  WK-806-1806-IDX   PIC S9(08) USAGE COMP    VALUE  1806.
008190     05  WK-806-1807-IDX   PIC S9(08) USAGE COMP    VALUE  1807.
008200     05  WK-806-1808-IDX   PIC S9(08) USAGE COMP    VALUE  1808.
008210     05  WK-806-1809-IDX   PIC S9(08) USAGE COMP    VALUE  1809.
008220     05  WK-806-1810-IDX   PIC S9(08) USAGE COMP    VALUE  1810.
008230     05  WK-806-1811-IDX   PIC S9(08) USAGE COMP    VALUE  1811.
008240     05  WK-806-1812-IDX   PIC S9(08) USAGE COMP    VALUE  1812.
008250     05  WK-806-1813-IDX   PIC S9(08) USAGE COMP    VALUE  1813.
008260     05  WK-806-1814-IDX   PIC S9(08) USAGE COMP    VALUE  1814.
008270     05  WK-806-1815-IDX   PIC S9(08) USAGE COMP    VALUE  1815.
008280     05  WK-806-1816-IDX   PIC S9(08) USAGE COMP    VALUE  1816.
008290     05  WK-806-1817-IDX   PIC S9(08) USAGE COMP    VALUE  1817.
008300     05  WK-806-1818-IDX   PIC S9(08) USAGE COMP    VALUE  1818.
008310     05  WK-806-1819-IDX   PIC S9(08) USAGE COMP    VALUE  1819.
008320     05  WK-806-1820-IDX   PIC S9(08) USAGE COMP    VALUE  1820.
008330     05  WK-806-1821-IDX   PIC S9(08) USAGE COMP    VALUE  1821.
008340     05  WK-806-1822-IDX   PIC S9(08) USAGE COMP    VALUE  1822.
008350     05  WK-806-1823-IDX   PIC S9(08) USAGE COMP    VALUE  1823.
008360     05  WK-806-1824-IDX   PIC S9(08) USAGE COMP    VALUE  1824.
008370     05  WK-806-1825-IDX   PIC S9(08) USAGE COMP    VALUE  1825.
008380     05  WK-806-1826-IDX   PIC S9(08) USAGE COMP    VALUE  1826.
008390     05  WK-806-1827-IDX   PIC S9(08) USAGE COMP    VALUE  1827.
008400     05  WK-806-1828-IDX   PIC S9(08) USAGE COMP    VALUE  1828.
008410     05  WK-806-1829-IDX   PIC S9(08) USAGE COMP    VALUE  1829.
008420     05  WK-806-1830-IDX   PIC S9(08) USAGE COMP    VALUE  1830.
008430     05  WK-806-1831-IDX   PIC S9(08) USAGE COMP    VALUE  1831.
008440     05  WK-806-1832-IDX   PIC S9(08) USAGE COMP    VALUE  1832.
008450     05  WK-806-1833-IDX   PIC S9(08) USAGE COMP    VALUE  1833.
008460     05  WK-806-1834-IDX   PIC S9(08) USAGE COMP    VALUE  1834.
008470     05  WK-806-1835-IDX   PIC S9(08) USAGE COMP    VALUE  1835.
008480     05  WK-806-1836-IDX   PIC S9(08) USAGE COMP    VALUE  1836.
008490     05  WK-806-1837-IDX   PIC S9(08) USAGE COMP    VALUE  1837.
008500     05  WK-806-1838-IDX   PIC S9(08) USAGE COMP    VALUE  1838.
008510     05  WK-806-1839-IDX   PIC S9(08) USAGE COMP    VALUE  1839.
008520     05  WK-806-1840-IDX   PIC S9(08) USAGE COMP    VALUE  1840.
008530     05  WK-806-1841-IDX   PIC S9(08) USAGE COMP    VALUE  1841.
008540     05  WK-806-1842-IDX   PIC S9(08) USAGE COMP    VALUE  1842.
008550     05  WK-806-1843-IDX   PIC S9(08) USAGE COMP    VALUE  1843.
008560     05  WK-806-1844-IDX   PIC S9(08) USAGE COMP    VALUE  1844.
008570     05  WK-806-1845-IDX   PIC S9(08) USAGE COMP    VALUE  1845.
008580     05  WK-806-1846-IDX   PIC S9(08) USAGE COMP    VALUE  1846.
008590     05  WK-806-1847-IDX   PIC S9(08) USAGE COMP    VALUE  1847.
008600     05  WK-806-1848-IDX   PIC S9(08) USAGE COMP    VALUE  1848.
008610     05  WK-806-1849-IDX   PIC S9(08) USAGE COMP    VALUE  1849.
008620     05  WK-806-1850-IDX   PIC S9(08) USAGE COMP    VALUE  1850.
008630     05  WK-806-1851-IDX   PIC S9(08) USAGE COMP    VALUE  1851.
008640     05  WK-806-1852-IDX   PIC S9(08) USAGE COMP    VALUE  1852.
008650     05  WK-806-1853-IDX   PIC S9(08) USAGE COMP    VALUE  1853.
008660     05  WK-806-1854-IDX   PIC S9(08) USAGE COMP    VALUE  1854.
008670     05  WK-806-1855-IDX   PIC S9(08) USAGE COMP    VALUE  1855.
008680     05  WK-806-1856-IDX   PIC S9(08) USAGE COMP    VALUE  1856.
008690     05  WK-806-1857-IDX   PIC S9(08) USAGE COMP    VALUE  1857.
008700     05  WK-806-1858-IDX   PIC S9(08) USAGE COMP    VALUE  1858.
008710     05  WK-806-1859-IDX   PIC S9(08) USAGE COMP    VALUE  1859.
008720     05  WK-806-1860-IDX   PIC S9(08) USAGE COMP    VALUE  1860.
008730     05  WK-806-1861-IDX   PIC S9(08) USAGE COMP    VALUE  1861.
008740     05  WK-806-1862-IDX   PIC S9(08) USAGE COMP    VALUE  1862.
008750     05  WK-806-1863-IDX   PIC S9(08) USAGE COMP    VALUE  1863.
008760     05  WK-806-1864-IDX   PIC S9(08) USAGE COMP    VALUE  1864.
008770     05  WK-806-1865-IDX   PIC S9(08) USAGE COMP    VALUE  1865.
008780     05  WK-806-1866-IDX   PIC S9(08) USAGE COMP    VALUE  1866.
008790     05  WK-806-1867-IDX   PIC S9(08) USAGE COMP    VALUE  1867.
008800     05  WK-806-1868-IDX   PIC S9(08) USAGE COMP    VALUE  1868.
008810     05  WK-806-1869-IDX   PIC S9(08) USAGE COMP    VALUE  1869.
008820     05  WK-806-1870-IDX   PIC S9(08) USAGE COMP    VALUE  1870.
008830     05  WK-806-1871-IDX   PIC S9(08) USAGE COMP    VALUE  1871.
008840     05  WK-806-1872-IDX   PIC S9(08) USAGE COMP    VALUE  1872.
008850     05  WK-806-1873-IDX   PIC S9(08) USAGE COMP    VALUE  1873.
008860     05  WK-806-1874-IDX   PIC S9(08) USAGE COMP    VALUE  1874.
008870     05  WK-806-1875-IDX   PIC S9(08) USAGE COMP    VALUE  1875.
008880     05  WK-806-1876-IDX   PIC S9(08) USAGE COMP    VALUE  1876.
008890     05  WK-806-1877-IDX   PIC S9(08) USAGE COMP    VALUE  1877.
008900     05  WK-806-1878-IDX   PIC S9(08) USAGE COMP    VALUE  1878.
008910     05  WK-806-1879-IDX   PIC S9(08) USAGE COMP    VALUE  1879.
008920     05  WK-806-1880-IDX   PIC S9(08) USAGE COMP    VALUE  1880.
008930     05  WK-806-1881-IDX   PIC S9(08) USAGE COMP    VALUE  1881.
008940     05  WK-806-1882-IDX   PIC S9(08) USAGE COMP    VALUE  1882.
008950     05  WK-806-1883-IDX   PIC S9(08) USAGE COMP    VALUE  1883.
008960     05  WK-806-1884-IDX   PIC S9(08) USAGE COMP    VALUE  1884.
008970     05  WK-806-1885-IDX   PIC S9(08) USAGE COMP    VALUE  1885.
008980     05  WK-806-1886-IDX   PIC S9(08) USAGE COMP    VALUE  1886.
008990     05  WK-806-1887-IDX   PIC S9(08) USAGE COMP    VALUE  1887.
009000     05  WK-806-1888-IDX   PIC S9(08) USAGE COMP    VALUE  1888.
009010     05  WK-806-1889-IDX   PIC S9(08) USAGE COMP    VALUE  1889.
009020     05  WK-806-1890-IDX   PIC S9(08) USAGE COMP    VALUE  1890.
009030     05  WK-806-1891-IDX   PIC S9(08) USAGE COMP    VALUE  1891.
009040     05  WK-806-1892-IDX   PIC S9(08) USAGE COMP    VALUE  1892.
009050     05  WK-806-1893-IDX   PIC S9(08) USAGE COMP    VALUE  1893.
009060     05  WK-806-1894-IDX   PIC S9(08) USAGE COMP    VALUE  1894.
009070     05  WK-806-1895-IDX   PIC S9(08) USAGE COMP    VALUE  1895.
009080     05  WK-806-1896-IDX   PIC S9(08) USAGE COMP    VALUE  1896.
009090     05  WK-806-1897-IDX   PIC S9(08) USAGE COMP    VALUE  1897.
009100     05  WK-806-1898-IDX   PIC S9(08) USAGE COMP    VALUE  1898.
009110     05  WK-806-1899-IDX   PIC S9(08) USAGE COMP    VALUE  1899.
009120     05  WK-806-1900-IDX   PIC S9(08) USAGE COMP    VALUE  1900.
009130     05  WK-806-1901-IDX   PIC S9(08) USAGE COMP    VALUE  1901.
009140     05  WK-806-1902-IDX   PIC S9(08) USAGE COMP    VALUE  1902.
009150     05  WK-806-1903-IDX   PIC S9(08) USAGE COMP    VALUE  1903.
009160     05  WK-806-1904-IDX   PIC S9(08) USAGE COMP    VALUE  1904.
009170     05  WK-806-1905-IDX   PIC S9(08) USAGE COMP    VALUE  1905.
009180     05  WK-806-1906-IDX   PIC S9(08) USAGE COMP    VALUE  1906.
009190     05  WK-806-1907-IDX   PIC S9(08) USAGE COMP    VALUE  1907.
009200     05  WK-806-1908-IDX   PIC S9(08) USAGE COMP    VALUE  1908.
009210     05  WK-806-1909-IDX   PIC S9(08) USAGE COMP    VALUE  1909.
009220     05  WK-806-1910-IDX   PIC S9(08) USAGE COMP    VALUE  1910.
009230     05  WK-806-1911-IDX   PIC S9(08) USAGE COMP    VALUE  1911.
009240     05  WK-806-1912-IDX   PIC S9(08) USAGE COMP    VALUE  1912.
009250     05  WK-806-1913-IDX   PIC S9(08) USAGE COMP    VALUE  1913.
009260     05  WK-806-1914-IDX   PIC S9(08) USAGE COMP    VALUE  1914.
009270     05  WK-806-1915-IDX   PIC S9(08) USAGE COMP    VALUE  1915.
009280     05  WK-806-1916-IDX   PIC S9(08) USAGE COMP    VALUE  1916.
009290     05  WK-806-1917-IDX   PIC S9(08) USAGE COMP    VALUE  1917.
009300     05  WK-806-1918-IDX   PIC S9(08) USAGE COMP    VALUE  1918.
009310     05  WK-806-1919-IDX   PIC S9(08) USAGE COMP    VALUE  1919.
009320     05  WK-806-1920-IDX   PIC S9(08) USAGE COMP    VALUE  1920.
009330     05  WK-806-1921-IDX   PIC S9(08) USAGE COMP    VALUE  1921.
009340     05  WK-806-1922-IDX   PIC S9(08) USAGE COMP    VALUE  1922.
009350     05  WK-806-1923-IDX   PIC S9(08) USAGE COMP    VALUE  1923.
009360     05  WK-806-1924-IDX   PIC S9(08) USAGE COMP    VALUE  1924.
009370     05  WK-806-1925-IDX   PIC S9(08) USAGE COMP    VALUE  1925.
009380     05  WK-806-1926-IDX   PIC S9(08) USAGE COMP    VALUE  1926.
009390     05  WK-806-1927-IDX   PIC S9(08) USAGE COMP    VALUE  1927.
009400     05  WK-806-1928-IDX   PIC S9(08) USAGE COMP    VALUE  1928.
009410     05  WK-806-1929-IDX   PIC S9(08) USAGE COMP    VALUE  1929.
009420     05  WK-806-1930-IDX   PIC S9(08) USAGE COMP    VALUE  1930.
009430     05  WK-806-1931-IDX   PIC S9(08) USAGE COMP    VALUE  1931.
009440     05  WK-806-1932-IDX   PIC S9(08) USAGE COMP    VALUE  1932.
009450     05  WK-806-1933-IDX   PIC S9(08) USAGE COMP    VALUE  1933.
009460     05  WK-806-1934-IDX   PIC S9(08) USAGE COMP    VALUE  1934.
009470     05  WK-806-1935-IDX   PIC S9(08) USAGE COMP    VALUE  1935.
009480     05  WK-806-1936-IDX   PIC S9(08) USAGE COMP    VALUE  1936.
009490     05  WK-806-1937-IDX   PIC S9(08) USAGE COMP    VALUE  1937.
009500     05  WK-806-1938-IDX   PIC S9(08) USAGE COMP    VALUE  1938.
009510     05  WK-806-1939-IDX   PIC S9(08) USAGE COMP    VALUE  1939.
009520     05  WK-806-1940-IDX   PIC S9(08) USAGE COMP    VALUE  1940.
009530     05  WK-806-1941-IDX   PIC S9(08) USAGE COMP    VALUE  1941.
009540     05  WK-806-1942-IDX   PIC S9(08) USAGE COMP    VALUE  1942.
009550     05  WK-806-1943-IDX   PIC S9(08) USAGE COMP    VALUE  1943.
009560     05  WK-806-1944-IDX   PIC S9(08) USAGE COMP    VALUE  1944.
009570     05  WK-806-1945-IDX   PIC S9(08) USAGE COMP    VALUE  1945.
009580     05  WK-806-1946-IDX   PIC S9(08) USAGE COMP    VALUE  1946.
009590     05  WK-806-1947-IDX   PIC S9(08) USAGE COMP    VALUE  1947.
009600     05  WK-806-1948-IDX   PIC S9(08) USAGE COMP    VALUE  1948.
009610     05  WK-806-1949-IDX   PIC S9(08) USAGE COMP    VALUE  1949.
009620     05  WK-806-1950-IDX   PIC S9(08) USAGE COMP    VALUE  1950.
009630     05  WK-806-1951-IDX   PIC S9(08) USAGE COMP    VALUE  1951.
009640     05  WK-806-1952-IDX   PIC S9(08) USAGE COMP    VALUE  1952.
009650     05  WK-806-1953-IDX   PIC S9(08) USAGE COMP    VALUE  1953.
009660     05  WK-806-1954-IDX   PIC S9(08) USAGE COMP    VALUE  1954.
009670     05  WK-806-1955-IDX   PIC S9(08) USAGE COMP    VALUE  1955.
009680     05  WK-806-1956-IDX   PIC S9(08) USAGE COMP    VALUE  1956.
009690     05  WK-806-1957-IDX   PIC S9(08) USAGE COMP    VALUE  1957.
009700     05  WK-806-1958-IDX   PIC S9(08) USAGE COMP    VALUE  1958.
009710     05  WK-806-1959-IDX   PIC S9(08) USAGE COMP    VALUE  1959.
009720     05  WK-806-1960-IDX   PIC S9(08) USAGE COMP    VALUE  1960.
009730     05  WK-806-1961-IDX   PIC S9(08) USAGE COMP    VALUE  1961.
009740     05  WK-806-1962-IDX   PIC S9(08) USAGE COMP    VALUE  1962.
009750     05  WK-806-1963-IDX   PIC S9(08) USAGE COMP    VALUE  1963.
009760     05  WK-806-1964-IDX   PIC S9(08) USAGE COMP    VALUE  1964.
009770     05  WK-806-1965-IDX   PIC S9(08) USAGE COMP    VALUE  1965.
009780     05  WK-806-1966-IDX   PIC S9(08) USAGE COMP    VALUE  1966.
009790     05  WK-806-1967-IDX   PIC S9(08) USAGE COMP    VALUE  1967.
009800     05  WK-806-1968-IDX   PIC S9(08) USAGE COMP    VALUE  1968.
009810     05  WK-806-1969-IDX   PIC S9(08) USAGE COMP    VALUE  1969.
009820     05  WK-806-1970-IDX   PIC S9(08) USAGE COMP    VALUE  1970.
009830     05  WK-806-1971-IDX   PIC S9(08) USAGE COMP    VALUE  1971.
009840     05  WK-806-1972-IDX   PIC S9(08) USAGE COMP    VALUE  1972.
009850     05  WK-806-1973-IDX   PIC S9(08) USAGE COMP    VALUE  1973.
009860     05  WK-806-1974-IDX   PIC S9(08) USAGE COMP    VALUE  1974.
009870     05  WK-806-1975-IDX   PIC S9(08) USAGE COMP    VALUE  1975.
009880     05  WK-806-1976-IDX   PIC S9(08) USAGE COMP    VALUE  1976.
009890     05  WK-806-1977-IDX   PIC S9(08) USAGE COMP    VALUE  1977.
009900     05  WK-806-1978-IDX   PIC S9(08) USAGE COMP    VALUE  1978.
009910     05  WK-806-1979-IDX   PIC S9(08) USAGE COMP    VALUE  1979.
009920     05  WK-806-1980-IDX   PIC S9(08) USAGE COMP    VALUE  1980.
009930     05  WK-806-1981-IDX   PIC S9(08) USAGE COMP    VALUE  1981.
009940     05  WK-806-1982-IDX   PIC S9(08) USAGE COMP    VALUE  1982.
009950     05  WK-806-1983-IDX   PIC S9(08) USAGE COMP    VALUE  1983.
009960     05  WK-806-1984-IDX   PIC S9(08) USAGE COMP    VALUE  1984.
009970     05  WK-806-1985-IDX   PIC S9(08) USAGE COMP    VALUE  1985.
009980     05  WK-806-1986-IDX   PIC S9(08) USAGE COMP    VALUE  1986.
009990     05  WK-806-1987-IDX   PIC S9(08) USAGE COMP    VALUE  1987.
010000     05  WK-806-1988-IDX   PIC S9(08) USAGE COMP    VALUE  1988.
010010     05  WK-806-1989-IDX   PIC S9(08) USAGE COMP    VALUE  1989.
010020     05  WK-806-1990-IDX   PIC S9(08) USAGE COMP    VALUE  1990.
010030     05  WK-806-1991-IDX   PIC S9(08) USAGE COMP    VALUE  1991.
010040     05  WK-806-1992-IDX   PIC S9(08) USAGE COMP    VALUE  1992.
010050     05  WK-806-1993-IDX   PIC S9(08) USAGE COMP    VALUE  1993.
010060     05  WK-806-1994-IDX   PIC S9(08) USAGE COMP    VALUE  1994.
010070     05  WK-806-1995-IDX   PIC S9(08) USAGE COMP    VALUE  1995.
010080     05  WK-806-1996-IDX   PIC S9(08) USAGE COMP    VALUE  1996.
010090     05  WK-806-1997-IDX   PIC S9(08) USAGE COMP    VALUE  1997.
010100     05  WK-806-1998-IDX   PIC S9(08) USAGE COMP    VALUE  1998.
010110     05  WK-806-1999-IDX   PIC S9(08) USAGE COMP    VALUE  1999.
010110     05  WK-806-2000-IDX   PIC S9(08) USAGE COMP    VALUE  2000.
000130     05  WK-806-2001-IDX   PIC S9(08) USAGE COMP    VALUE  2001.
000140     05  WK-806-2002-IDX   PIC S9(08) USAGE COMP    VALUE  2002.
000150     05  WK-806-2003-IDX   PIC S9(08) USAGE COMP    VALUE  2003.
000160     05  WK-806-2004-IDX   PIC S9(08) USAGE COMP    VALUE  2004.
000170     05  WK-806-2005-IDX   PIC S9(08) USAGE COMP    VALUE  2005.
000180     05  WK-806-2006-IDX   PIC S9(08) USAGE COMP    VALUE  2006.
000190     05  WK-806-2007-IDX   PIC S9(08) USAGE COMP    VALUE  2007.
000200     05  WK-806-2008-IDX   PIC S9(08) USAGE COMP    VALUE  2008.
000210     05  WK-806-2009-IDX   PIC S9(08) USAGE COMP    VALUE  2009.
000220     05  WK-806-2010-IDX   PIC S9(08) USAGE COMP    VALUE  2010.
000230     05  WK-806-2011-IDX   PIC S9(08) USAGE COMP    VALUE  2011.
000240     05  WK-806-2012-IDX   PIC S9(08) USAGE COMP    VALUE  2012.
000250     05  WK-806-2013-IDX   PIC S9(08) USAGE COMP    VALUE  2013.
000260     05  WK-806-2014-IDX   PIC S9(08) USAGE COMP    VALUE  2014.
000270     05  WK-806-2015-IDX   PIC S9(08) USAGE COMP    VALUE  2015.
000280     05  WK-806-2016-IDX   PIC S9(08) USAGE COMP    VALUE  2016.
000290     05  WK-806-2017-IDX   PIC S9(08) USAGE COMP    VALUE  2017.
000300     05  WK-806-2018-IDX   PIC S9(08) USAGE COMP    VALUE  2018.
000310     05  WK-806-2019-IDX   PIC S9(08) USAGE COMP    VALUE  2019.
000320     05  WK-806-2020-IDX   PIC S9(08) USAGE COMP    VALUE  2020.
000330     05  WK-806-2021-IDX   PIC S9(08) USAGE COMP    VALUE  2021.
000340     05  WK-806-2022-IDX   PIC S9(08) USAGE COMP    VALUE  2022.
000350     05  WK-806-2023-IDX   PIC S9(08) USAGE COMP    VALUE  2023.
000360     05  WK-806-2024-IDX   PIC S9(08) USAGE COMP    VALUE  2024.
000370     05  WK-806-2025-IDX   PIC S9(08) USAGE COMP    VALUE  2025.
000380     05  WK-806-2026-IDX   PIC S9(08) USAGE COMP    VALUE  2026.
000390     05  WK-806-2027-IDX   PIC S9(08) USAGE COMP    VALUE  2027.
000400     05  WK-806-2028-IDX   PIC S9(08) USAGE COMP    VALUE  2028.
000410     05  WK-806-2029-IDX   PIC S9(08) USAGE COMP    VALUE  2029.
000420     05  WK-806-2030-IDX   PIC S9(08) USAGE COMP    VALUE  2030.
000430     05  WK-806-2031-IDX   PIC S9(08) USAGE COMP    VALUE  2031.
000440     05  WK-806-2032-IDX   PIC S9(08) USAGE COMP    VALUE  2032.
000450     05  WK-806-2033-IDX   PIC S9(08) USAGE COMP    VALUE  2033.
000460     05  WK-806-2034-IDX   PIC S9(08) USAGE COMP    VALUE  2034.
000470     05  WK-806-2035-IDX   PIC S9(08) USAGE COMP    VALUE  2035.
000480     05  WK-806-2036-IDX   PIC S9(08) USAGE COMP    VALUE  2036.
000490     05  WK-806-2037-IDX   PIC S9(08) USAGE COMP    VALUE  2037.
000500     05  WK-806-2038-IDX   PIC S9(08) USAGE COMP    VALUE  2038.
000510     05  WK-806-2039-IDX   PIC S9(08) USAGE COMP    VALUE  2039.
000520     05  WK-806-2040-IDX   PIC S9(08) USAGE COMP    VALUE  2040.
000530     05  WK-806-2041-IDX   PIC S9(08) USAGE COMP    VALUE  2041.
000540     05  WK-806-2042-IDX   PIC S9(08) USAGE COMP    VALUE  2042.
000550     05  WK-806-2043-IDX   PIC S9(08) USAGE COMP    VALUE  2043.
000560     05  WK-806-2044-IDX   PIC S9(08) USAGE COMP    VALUE  2044.
000570     05  WK-806-2045-IDX   PIC S9(08) USAGE COMP    VALUE  2045.
000580     05  WK-806-2046-IDX   PIC S9(08) USAGE COMP    VALUE  2046.
000590     05  WK-806-2047-IDX   PIC S9(08) USAGE COMP    VALUE  2047.
000600     05  WK-806-2048-IDX   PIC S9(08) USAGE COMP    VALUE  2048.
000610     05  WK-806-2049-IDX   PIC S9(08) USAGE COMP    VALUE  2049.
000620     05  WK-806-2050-IDX   PIC S9(08) USAGE COMP    VALUE  2050.
000630     05  WK-806-2051-IDX   PIC S9(08) USAGE COMP    VALUE  2051.
000640     05  WK-806-2052-IDX   PIC S9(08) USAGE COMP    VALUE  2052.
000650     05  WK-806-2053-IDX   PIC S9(08) USAGE COMP    VALUE  2053.
000660     05  WK-806-2054-IDX   PIC S9(08) USAGE COMP    VALUE  2054.
000670     05  WK-806-2055-IDX   PIC S9(08) USAGE COMP    VALUE  2055.
000680     05  WK-806-2056-IDX   PIC S9(08) USAGE COMP    VALUE  2056.
000690     05  WK-806-2057-IDX   PIC S9(08) USAGE COMP    VALUE  2057.
000700     05  WK-806-2058-IDX   PIC S9(08) USAGE COMP    VALUE  2058.
000710     05  WK-806-2059-IDX   PIC S9(08) USAGE COMP    VALUE  2059.
000720     05  WK-806-2060-IDX   PIC S9(08) USAGE COMP    VALUE  2060.
000730     05  WK-806-2061-IDX   PIC S9(08) USAGE COMP    VALUE  2061.
000740     05  WK-806-2062-IDX   PIC S9(08) USAGE COMP    VALUE  2062.
000750     05  WK-806-2063-IDX   PIC S9(08) USAGE COMP    VALUE  2063.
000760     05  WK-806-2064-IDX   PIC S9(08) USAGE COMP    VALUE  2064.
000770     05  WK-806-2065-IDX   PIC S9(08) USAGE COMP    VALUE  2065.
000780     05  WK-806-2066-IDX   PIC S9(08) USAGE COMP    VALUE  2066.
000790     05  WK-806-2067-IDX   PIC S9(08) USAGE COMP    VALUE  2067.
000800     05  WK-806-2068-IDX   PIC S9(08) USAGE COMP    VALUE  2068.
000810     05  WK-806-2069-IDX   PIC S9(08) USAGE COMP    VALUE  2069.
000820     05  WK-806-2070-IDX   PIC S9(08) USAGE COMP    VALUE  2070.
000830     05  WK-806-2071-IDX   PIC S9(08) USAGE COMP    VALUE  2071.
000840     05  WK-806-2072-IDX   PIC S9(08) USAGE COMP    VALUE  2072.
000850     05  WK-806-2073-IDX   PIC S9(08) USAGE COMP    VALUE  2073.
000860     05  WK-806-2074-IDX   PIC S9(08) USAGE COMP    VALUE  2074.
000870     05  WK-806-2075-IDX   PIC S9(08) USAGE COMP    VALUE  2075.
000880     05  WK-806-2076-IDX   PIC S9(08) USAGE COMP    VALUE  2076.
000890     05  WK-806-2077-IDX   PIC S9(08) USAGE COMP    VALUE  2077.
000900     05  WK-806-2078-IDX   PIC S9(08) USAGE COMP    VALUE  2078.
000910     05  WK-806-2079-IDX   PIC S9(08) USAGE COMP    VALUE  2079.
000920     05  WK-806-2080-IDX   PIC S9(08) USAGE COMP    VALUE  2080.
000930     05  WK-806-2081-IDX   PIC S9(08) USAGE COMP    VALUE  2081.
000940     05  WK-806-2082-IDX   PIC S9(08) USAGE COMP    VALUE  2082.
000950     05  WK-806-2083-IDX   PIC S9(08) USAGE COMP    VALUE  2083.
000960     05  WK-806-2084-IDX   PIC S9(08) USAGE COMP    VALUE  2084.
000970     05  WK-806-2085-IDX   PIC S9(08) USAGE COMP    VALUE  2085.
000980     05  WK-806-2086-IDX   PIC S9(08) USAGE COMP    VALUE  2086.
000990     05  WK-806-2087-IDX   PIC S9(08) USAGE COMP    VALUE  2087.
001000     05  WK-806-2088-IDX   PIC S9(08) USAGE COMP    VALUE  2088.
001010     05  WK-806-2089-IDX   PIC S9(08) USAGE COMP    VALUE  2089.
001020     05  WK-806-2090-IDX   PIC S9(08) USAGE COMP    VALUE  2090.
001030     05  WK-806-2091-IDX   PIC S9(08) USAGE COMP    VALUE  2091.
001040     05  WK-806-2092-IDX   PIC S9(08) USAGE COMP    VALUE  2092.
001050     05  WK-806-2093-IDX   PIC S9(08) USAGE COMP    VALUE  2093.
001060     05  WK-806-2094-IDX   PIC S9(08) USAGE COMP    VALUE  2094.
001070     05  WK-806-2095-IDX   PIC S9(08) USAGE COMP    VALUE  2095.
001080     05  WK-806-2096-IDX   PIC S9(08) USAGE COMP    VALUE  2096.
001090     05  WK-806-2097-IDX   PIC S9(08) USAGE COMP    VALUE  2097.
001100     05  WK-806-2098-IDX   PIC S9(08) USAGE COMP    VALUE  2098.
001110     05  WK-806-2099-IDX   PIC S9(08) USAGE COMP    VALUE  2099.
001120     05  WK-806-2100-IDX   PIC S9(08) USAGE COMP    VALUE  2100.
001130     05  WK-806-2101-IDX   PIC S9(08) USAGE COMP    VALUE  2101.
001140     05  WK-806-2102-IDX   PIC S9(08) USAGE COMP    VALUE  2102.
001150     05  WK-806-2103-IDX   PIC S9(08) USAGE COMP    VALUE  2103.
001160     05  WK-806-2104-IDX   PIC S9(08) USAGE COMP    VALUE  2104.
001170     05  WK-806-2105-IDX   PIC S9(08) USAGE COMP    VALUE  2105.
001180     05  WK-806-2106-IDX   PIC S9(08) USAGE COMP    VALUE  2106.
001190     05  WK-806-2107-IDX   PIC S9(08) USAGE COMP    VALUE  2107.
001200     05  WK-806-2108-IDX   PIC S9(08) USAGE COMP    VALUE  2108.
001210     05  WK-806-2109-IDX   PIC S9(08) USAGE COMP    VALUE  2109.
001220     05  WK-806-2110-IDX   PIC S9(08) USAGE COMP    VALUE  2110.
001230     05  WK-806-2111-IDX   PIC S9(08) USAGE COMP    VALUE  2111.
001240     05  WK-806-2112-IDX   PIC S9(08) USAGE COMP    VALUE  2112.
001250     05  WK-806-2113-IDX   PIC S9(08) USAGE COMP    VALUE  2113.
001260     05  WK-806-2114-IDX   PIC S9(08) USAGE COMP    VALUE  2114.
001270     05  WK-806-2115-IDX   PIC S9(08) USAGE COMP    VALUE  2115.
001280     05  WK-806-2116-IDX   PIC S9(08) USAGE COMP    VALUE  2116.
001290     05  WK-806-2117-IDX   PIC S9(08) USAGE COMP    VALUE  2117.
001300     05  WK-806-2118-IDX   PIC S9(08) USAGE COMP    VALUE  2118.
001310     05  WK-806-2119-IDX   PIC S9(08) USAGE COMP    VALUE  2119.
001320     05  WK-806-2120-IDX   PIC S9(08) USAGE COMP    VALUE  2120.
001330     05  WK-806-2121-IDX   PIC S9(08) USAGE COMP    VALUE  2121.
001340     05  WK-806-2122-IDX   PIC S9(08) USAGE COMP    VALUE  2122.
001350     05  WK-806-2123-IDX   PIC S9(08) USAGE COMP    VALUE  2123.
001360     05  WK-806-2124-IDX   PIC S9(08) USAGE COMP    VALUE  2124.
001370     05  WK-806-2125-IDX   PIC S9(08) USAGE COMP    VALUE  2125.
001380     05  WK-806-2126-IDX   PIC S9(08) USAGE COMP    VALUE  2126.
001390     05  WK-806-2127-IDX   PIC S9(08) USAGE COMP    VALUE  2127.
001400     05  WK-806-2128-IDX   PIC S9(08) USAGE COMP    VALUE  2128.
001410     05  WK-806-2129-IDX   PIC S9(08) USAGE COMP    VALUE  2129.
001420     05  WK-806-2130-IDX   PIC S9(08) USAGE COMP    VALUE  2130.
001430     05  WK-806-2131-IDX   PIC S9(08) USAGE COMP    VALUE  2131.
001440     05  WK-806-2132-IDX   PIC S9(08) USAGE COMP    VALUE  2132.
001450     05  WK-806-2133-IDX   PIC S9(08) USAGE COMP    VALUE  2133.
001460     05  WK-806-2134-IDX   PIC S9(08) USAGE COMP    VALUE  2134.
001470     05  WK-806-2135-IDX   PIC S9(08) USAGE COMP    VALUE  2135.
001480     05  WK-806-2136-IDX   PIC S9(08) USAGE COMP    VALUE  2136.
001490     05  WK-806-2137-IDX   PIC S9(08) USAGE COMP    VALUE  2137.
001500     05  WK-806-2138-IDX   PIC S9(08) USAGE COMP    VALUE  2138.
001510     05  WK-806-2139-IDX   PIC S9(08) USAGE COMP    VALUE  2139.
001520     05  WK-806-2140-IDX   PIC S9(08) USAGE COMP    VALUE  2140.
001530     05  WK-806-2141-IDX   PIC S9(08) USAGE COMP    VALUE  2141.
001540     05  WK-806-2142-IDX   PIC S9(08) USAGE COMP    VALUE  2142.
001550     05  WK-806-2143-IDX   PIC S9(08) USAGE COMP    VALUE  2143.
001560     05  WK-806-2144-IDX   PIC S9(08) USAGE COMP    VALUE  2144.
001570     05  WK-806-2145-IDX   PIC S9(08) USAGE COMP    VALUE  2145.
001580     05  WK-806-2146-IDX   PIC S9(08) USAGE COMP    VALUE  2146.
001590     05  WK-806-2147-IDX   PIC S9(08) USAGE COMP    VALUE  2147.
001600     05  WK-806-2148-IDX   PIC S9(08) USAGE COMP    VALUE  2148.
001610     05  WK-806-2149-IDX   PIC S9(08) USAGE COMP    VALUE  2149.
001620     05  WK-806-2150-IDX   PIC S9(08) USAGE COMP    VALUE  2150.
001630     05  WK-806-2151-IDX   PIC S9(08) USAGE COMP    VALUE  2151.
001640     05  WK-806-2152-IDX   PIC S9(08) USAGE COMP    VALUE  2152.
001650     05  WK-806-2153-IDX   PIC S9(08) USAGE COMP    VALUE  2153.
001660     05  WK-806-2154-IDX   PIC S9(08) USAGE COMP    VALUE  2154.
001670     05  WK-806-2155-IDX   PIC S9(08) USAGE COMP    VALUE  2155.
001680     05  WK-806-2156-IDX   PIC S9(08) USAGE COMP    VALUE  2156.
001690     05  WK-806-2157-IDX   PIC S9(08) USAGE COMP    VALUE  2157.
001700     05  WK-806-2158-IDX   PIC S9(08) USAGE COMP    VALUE  2158.
001710     05  WK-806-2159-IDX   PIC S9(08) USAGE COMP    VALUE  2159.
001720     05  WK-806-2160-IDX   PIC S9(08) USAGE COMP    VALUE  2160.
001730     05  WK-806-2161-IDX   PIC S9(08) USAGE COMP    VALUE  2161.
001740     05  WK-806-2162-IDX   PIC S9(08) USAGE COMP    VALUE  2162.
001750     05  WK-806-2163-IDX   PIC S9(08) USAGE COMP    VALUE  2163.
001760     05  WK-806-2164-IDX   PIC S9(08) USAGE COMP    VALUE  2164.
001770     05  WK-806-2165-IDX   PIC S9(08) USAGE COMP    VALUE  2165.
001780     05  WK-806-2166-IDX   PIC S9(08) USAGE COMP    VALUE  2166.
001790     05  WK-806-2167-IDX   PIC S9(08) USAGE COMP    VALUE  2167.
001800     05  WK-806-2168-IDX   PIC S9(08) USAGE COMP    VALUE  2168.
001810     05  WK-806-2169-IDX   PIC S9(08) USAGE COMP    VALUE  2169.
001820     05  WK-806-2170-IDX   PIC S9(08) USAGE COMP    VALUE  2170.
001830     05  WK-806-2171-IDX   PIC S9(08) USAGE COMP    VALUE  2171.
001840     05  WK-806-2172-IDX   PIC S9(08) USAGE COMP    VALUE  2172.
001850     05  WK-806-2173-IDX   PIC S9(08) USAGE COMP    VALUE  2173.
001860     05  WK-806-2174-IDX   PIC S9(08) USAGE COMP    VALUE  2174.
001870     05  WK-806-2175-IDX   PIC S9(08) USAGE COMP    VALUE  2175.
001880     05  WK-806-2176-IDX   PIC S9(08) USAGE COMP    VALUE  2176.
001890     05  WK-806-2177-IDX   PIC S9(08) USAGE COMP    VALUE  2177.
001900     05  WK-806-2178-IDX   PIC S9(08) USAGE COMP    VALUE  2178.
001910     05  WK-806-2179-IDX   PIC S9(08) USAGE COMP    VALUE  2179.
001920     05  WK-806-2180-IDX   PIC S9(08) USAGE COMP    VALUE  2180.
001930     05  WK-806-2181-IDX   PIC S9(08) USAGE COMP    VALUE  2181.
001940     05  WK-806-2182-IDX   PIC S9(08) USAGE COMP    VALUE  2182.
001950     05  WK-806-2183-IDX   PIC S9(08) USAGE COMP    VALUE  2183.
001960     05  WK-806-2184-IDX   PIC S9(08) USAGE COMP    VALUE  2184.
001970     05  WK-806-2185-IDX   PIC S9(08) USAGE COMP    VALUE  2185.
001980     05  WK-806-2186-IDX   PIC S9(08) USAGE COMP    VALUE  2186.
001990     05  WK-806-2187-IDX   PIC S9(08) USAGE COMP    VALUE  2187.
002000     05  WK-806-2188-IDX   PIC S9(08) USAGE COMP    VALUE  2188.
002010     05  WK-806-2189-IDX   PIC S9(08) USAGE COMP    VALUE  2189.
002020     05  WK-806-2190-IDX   PIC S9(08) USAGE COMP    VALUE  2190.
002030     05  WK-806-2191-IDX   PIC S9(08) USAGE COMP    VALUE  2191.
002040     05  WK-806-2192-IDX   PIC S9(08) USAGE COMP    VALUE  2192.
002050     05  WK-806-2193-IDX   PIC S9(08) USAGE COMP    VALUE  2193.
002060     05  WK-806-2194-IDX   PIC S9(08) USAGE COMP    VALUE  2194.
002070     05  WK-806-2195-IDX   PIC S9(08) USAGE COMP    VALUE  2195.
002080     05  WK-806-2196-IDX   PIC S9(08) USAGE COMP    VALUE  2196.
002090     05  WK-806-2197-IDX   PIC S9(08) USAGE COMP    VALUE  2197.
002100     05  WK-806-2198-IDX   PIC S9(08) USAGE COMP    VALUE  2198.
002110     05  WK-806-2199-IDX   PIC S9(08) USAGE COMP    VALUE  2199.
002120     05  WK-806-2200-IDX   PIC S9(08) USAGE COMP    VALUE  2200.
002130     05  WK-806-2201-IDX   PIC S9(08) USAGE COMP    VALUE  2201.
002140     05  WK-806-2202-IDX   PIC S9(08) USAGE COMP    VALUE  2202.
002150     05  WK-806-2203-IDX   PIC S9(08) USAGE COMP    VALUE  2203.
002160     05  WK-806-2204-IDX   PIC S9(08) USAGE COMP    VALUE  2204.
002170     05  WK-806-2205-IDX   PIC S9(08) USAGE COMP    VALUE  2205.
002180     05  WK-806-2206-IDX   PIC S9(08) USAGE COMP    VALUE  2206.
002190     05  WK-806-2207-IDX   PIC S9(08) USAGE COMP    VALUE  2207.
002200     05  WK-806-2208-IDX   PIC S9(08) USAGE COMP    VALUE  2208.
002210     05  WK-806-2209-IDX   PIC S9(08) USAGE COMP    VALUE  2209.
002220     05  WK-806-2210-IDX   PIC S9(08) USAGE COMP    VALUE  2210.
002230     05  WK-806-2211-IDX   PIC S9(08) USAGE COMP    VALUE  2211.
002240     05  WK-806-2212-IDX   PIC S9(08) USAGE COMP    VALUE  2212.
002250     05  WK-806-2213-IDX   PIC S9(08) USAGE COMP    VALUE  2213.
002260     05  WK-806-2214-IDX   PIC S9(08) USAGE COMP    VALUE  2214.
002270     05  WK-806-2215-IDX   PIC S9(08) USAGE COMP    VALUE  2215.
002280     05  WK-806-2216-IDX   PIC S9(08) USAGE COMP    VALUE  2216.
002290     05  WK-806-2217-IDX   PIC S9(08) USAGE COMP    VALUE  2217.
002300     05  WK-806-2218-IDX   PIC S9(08) USAGE COMP    VALUE  2218.
002310     05  WK-806-2219-IDX   PIC S9(08) USAGE COMP    VALUE  2219.
002320     05  WK-806-2220-IDX   PIC S9(08) USAGE COMP    VALUE  2220.
002330     05  WK-806-2221-IDX   PIC S9(08) USAGE COMP    VALUE  2221.
002340     05  WK-806-2222-IDX   PIC S9(08) USAGE COMP    VALUE  2222.
002350     05  WK-806-2223-IDX   PIC S9(08) USAGE COMP    VALUE  2223.
002360     05  WK-806-2224-IDX   PIC S9(08) USAGE COMP    VALUE  2224.
002370     05  WK-806-2225-IDX   PIC S9(08) USAGE COMP    VALUE  2225.
002380     05  WK-806-2226-IDX   PIC S9(08) USAGE COMP    VALUE  2226.
002390     05  WK-806-2227-IDX   PIC S9(08) USAGE COMP    VALUE  2227.
002400     05  WK-806-2228-IDX   PIC S9(08) USAGE COMP    VALUE  2228.
002410     05  WK-806-2229-IDX   PIC S9(08) USAGE COMP    VALUE  2229.
002420     05  WK-806-2230-IDX   PIC S9(08) USAGE COMP    VALUE  2230.
002430     05  WK-806-2231-IDX   PIC S9(08) USAGE COMP    VALUE  2231.
002440     05  WK-806-2232-IDX   PIC S9(08) USAGE COMP    VALUE  2232.
002450     05  WK-806-2233-IDX   PIC S9(08) USAGE COMP    VALUE  2233.
002460     05  WK-806-2234-IDX   PIC S9(08) USAGE COMP    VALUE  2234.
002470     05  WK-806-2235-IDX   PIC S9(08) USAGE COMP    VALUE  2235.
002480     05  WK-806-2236-IDX   PIC S9(08) USAGE COMP    VALUE  2236.
002490     05  WK-806-2237-IDX   PIC S9(08) USAGE COMP    VALUE  2237.
002500     05  WK-806-2238-IDX   PIC S9(08) USAGE COMP    VALUE  2238.
002510     05  WK-806-2239-IDX   PIC S9(08) USAGE COMP    VALUE  2239.
002520     05  WK-806-2240-IDX   PIC S9(08) USAGE COMP    VALUE  2240.
002530     05  WK-806-2241-IDX   PIC S9(08) USAGE COMP    VALUE  2241.
002540     05  WK-806-2242-IDX   PIC S9(08) USAGE COMP    VALUE  2242.
002550     05  WK-806-2243-IDX   PIC S9(08) USAGE COMP    VALUE  2243.
002560     05  WK-806-2244-IDX   PIC S9(08) USAGE COMP    VALUE  2244.
002570     05  WK-806-2245-IDX   PIC S9(08) USAGE COMP    VALUE  2245.
002580     05  WK-806-2246-IDX   PIC S9(08) USAGE COMP    VALUE  2246.
002590     05  WK-806-2247-IDX   PIC S9(08) USAGE COMP    VALUE  2247.
002600     05  WK-806-2248-IDX   PIC S9(08) USAGE COMP    VALUE  2248.
002610     05  WK-806-2249-IDX   PIC S9(08) USAGE COMP    VALUE  2249.
002620     05  WK-806-2250-IDX   PIC S9(08) USAGE COMP    VALUE  2250.
002630     05  WK-806-2251-IDX   PIC S9(08) USAGE COMP    VALUE  2251.
002640     05  WK-806-2252-IDX   PIC S9(08) USAGE COMP    VALUE  2252.
002650     05  WK-806-2253-IDX   PIC S9(08) USAGE COMP    VALUE  2253.
002660     05  WK-806-2254-IDX   PIC S9(08) USAGE COMP    VALUE  2254.
002670     05  WK-806-2255-IDX   PIC S9(08) USAGE COMP    VALUE  2255.
002680     05  WK-806-2256-IDX   PIC S9(08) USAGE COMP    VALUE  2256.
002690     05  WK-806-2257-IDX   PIC S9(08) USAGE COMP    VALUE  2257.
002700     05  WK-806-2258-IDX   PIC S9(08) USAGE COMP    VALUE  2258.
002710     05  WK-806-2259-IDX   PIC S9(08) USAGE COMP    VALUE  2259.
002720     05  WK-806-2260-IDX   PIC S9(08) USAGE COMP    VALUE  2260.
002730     05  WK-806-2261-IDX   PIC S9(08) USAGE COMP    VALUE  2261.
002740     05  WK-806-2262-IDX   PIC S9(08) USAGE COMP    VALUE  2262.
002750     05  WK-806-2263-IDX   PIC S9(08) USAGE COMP    VALUE  2263.
002760     05  WK-806-2264-IDX   PIC S9(08) USAGE COMP    VALUE  2264.
002770     05  WK-806-2265-IDX   PIC S9(08) USAGE COMP    VALUE  2265.
002780     05  WK-806-2266-IDX   PIC S9(08) USAGE COMP    VALUE  2266.
002790     05  WK-806-2267-IDX   PIC S9(08) USAGE COMP    VALUE  2267.
002800     05  WK-806-2268-IDX   PIC S9(08) USAGE COMP    VALUE  2268.
002810     05  WK-806-2269-IDX   PIC S9(08) USAGE COMP    VALUE  2269.
002820     05  WK-806-2270-IDX   PIC S9(08) USAGE COMP    VALUE  2270.
002830     05  WK-806-2271-IDX   PIC S9(08) USAGE COMP    VALUE  2271.
002840     05  WK-806-2272-IDX   PIC S9(08) USAGE COMP    VALUE  2272.
002850     05  WK-806-2273-IDX   PIC S9(08) USAGE COMP    VALUE  2273.
002860     05  WK-806-2274-IDX   PIC S9(08) USAGE COMP    VALUE  2274.
002870     05  WK-806-2275-IDX   PIC S9(08) USAGE COMP    VALUE  2275.
002880     05  WK-806-2276-IDX   PIC S9(08) USAGE COMP    VALUE  2276.
002890     05  WK-806-2277-IDX   PIC S9(08) USAGE COMP    VALUE  2277.
002900     05  WK-806-2278-IDX   PIC S9(08) USAGE COMP    VALUE  2278.
002910     05  WK-806-2279-IDX   PIC S9(08) USAGE COMP    VALUE  2279.
002920     05  WK-806-2280-IDX   PIC S9(08) USAGE COMP    VALUE  2280.
002930     05  WK-806-2281-IDX   PIC S9(08) USAGE COMP    VALUE  2281.
002940     05  WK-806-2282-IDX   PIC S9(08) USAGE COMP    VALUE  2282.
002950     05  WK-806-2283-IDX   PIC S9(08) USAGE COMP    VALUE  2283.
002960     05  WK-806-2284-IDX   PIC S9(08) USAGE COMP    VALUE  2284.
002970     05  WK-806-2285-IDX   PIC S9(08) USAGE COMP    VALUE  2285.
002980     05  WK-806-2286-IDX   PIC S9(08) USAGE COMP    VALUE  2286.
002990     05  WK-806-2287-IDX   PIC S9(08) USAGE COMP    VALUE  2287.
003000     05  WK-806-2288-IDX   PIC S9(08) USAGE COMP    VALUE  2288.
003010     05  WK-806-2289-IDX   PIC S9(08) USAGE COMP    VALUE  2289.
003020     05  WK-806-2290-IDX   PIC S9(08) USAGE COMP    VALUE  2290.
003030     05  WK-806-2291-IDX   PIC S9(08) USAGE COMP    VALUE  2291.
003040     05  WK-806-2292-IDX   PIC S9(08) USAGE COMP    VALUE  2292.
003050     05  WK-806-2293-IDX   PIC S9(08) USAGE COMP    VALUE  2293.
003060     05  WK-806-2294-IDX   PIC S9(08) USAGE COMP    VALUE  2294.
003070     05  WK-806-2295-IDX   PIC S9(08) USAGE COMP    VALUE  2295.
003080     05  WK-806-2296-IDX   PIC S9(08) USAGE COMP    VALUE  2296.
003090     05  WK-806-2297-IDX   PIC S9(08) USAGE COMP    VALUE  2297.
003100     05  WK-806-2298-IDX   PIC S9(08) USAGE COMP    VALUE  2298.
003110     05  WK-806-2299-IDX   PIC S9(08) USAGE COMP    VALUE  2299.
003120     05  WK-806-2300-IDX   PIC S9(08) USAGE COMP    VALUE  2300.
003130     05  WK-806-2301-IDX   PIC S9(08) USAGE COMP    VALUE  2301.
003140     05  WK-806-2302-IDX   PIC S9(08) USAGE COMP    VALUE  2302.
003150     05  WK-806-2303-IDX   PIC S9(08) USAGE COMP    VALUE  2303.
003160     05  WK-806-2304-IDX   PIC S9(08) USAGE COMP    VALUE  2304.
003170     05  WK-806-2305-IDX   PIC S9(08) USAGE COMP    VALUE  2305.
003180     05  WK-806-2306-IDX   PIC S9(08) USAGE COMP    VALUE  2306.
003190     05  WK-806-2307-IDX   PIC S9(08) USAGE COMP    VALUE  2307.
003200     05  WK-806-2308-IDX   PIC S9(08) USAGE COMP    VALUE  2308.
003210     05  WK-806-2309-IDX   PIC S9(08) USAGE COMP    VALUE  2309.
003220     05  WK-806-2310-IDX   PIC S9(08) USAGE COMP    VALUE  2310.
003230     05  WK-806-2311-IDX   PIC S9(08) USAGE COMP    VALUE  2311.
003240     05  WK-806-2312-IDX   PIC S9(08) USAGE COMP    VALUE  2312.
003250     05  WK-806-2313-IDX   PIC S9(08) USAGE COMP    VALUE  2313.
003260     05  WK-806-2314-IDX   PIC S9(08) USAGE COMP    VALUE  2314.
003270     05  WK-806-2315-IDX   PIC S9(08) USAGE COMP    VALUE  2315.
003280     05  WK-806-2316-IDX   PIC S9(08) USAGE COMP    VALUE  2316.
003290     05  WK-806-2317-IDX   PIC S9(08) USAGE COMP    VALUE  2317.
003300     05  WK-806-2318-IDX   PIC S9(08) USAGE COMP    VALUE  2318.
003310     05  WK-806-2319-IDX   PIC S9(08) USAGE COMP    VALUE  2319.
003320     05  WK-806-2320-IDX   PIC S9(08) USAGE COMP    VALUE  2320.
003330     05  WK-806-2321-IDX   PIC S9(08) USAGE COMP    VALUE  2321.
003340     05  WK-806-2322-IDX   PIC S9(08) USAGE COMP    VALUE  2322.
003350     05  WK-806-2323-IDX   PIC S9(08) USAGE COMP    VALUE  2323.
003360     05  WK-806-2324-IDX   PIC S9(08) USAGE COMP    VALUE  2324.
003370     05  WK-806-2325-IDX   PIC S9(08) USAGE COMP    VALUE  2325.
003380     05  WK-806-2326-IDX   PIC S9(08) USAGE COMP    VALUE  2326.
003390     05  WK-806-2327-IDX   PIC S9(08) USAGE COMP    VALUE  2327.
003400     05  WK-806-2328-IDX   PIC S9(08) USAGE COMP    VALUE  2328.
003410     05  WK-806-2329-IDX   PIC S9(08) USAGE COMP    VALUE  2329.
003420     05  WK-806-2330-IDX   PIC S9(08) USAGE COMP    VALUE  2330.
003430     05  WK-806-2331-IDX   PIC S9(08) USAGE COMP    VALUE  2331.
003440     05  WK-806-2332-IDX   PIC S9(08) USAGE COMP    VALUE  2332.
003450     05  WK-806-2333-IDX   PIC S9(08) USAGE COMP    VALUE  2333.
003460     05  WK-806-2334-IDX   PIC S9(08) USAGE COMP    VALUE  2334.
003470     05  WK-806-2335-IDX   PIC S9(08) USAGE COMP    VALUE  2335.
003480     05  WK-806-2336-IDX   PIC S9(08) USAGE COMP    VALUE  2336.
003490     05  WK-806-2337-IDX   PIC S9(08) USAGE COMP    VALUE  2337.
003500     05  WK-806-2338-IDX   PIC S9(08) USAGE COMP    VALUE  2338.
003510     05  WK-806-2339-IDX   PIC S9(08) USAGE COMP    VALUE  2339.
003520     05  WK-806-2340-IDX   PIC S9(08) USAGE COMP    VALUE  2340.
003530     05  WK-806-2341-IDX   PIC S9(08) USAGE COMP    VALUE  2341.
003540     05  WK-806-2342-IDX   PIC S9(08) USAGE COMP    VALUE  2342.
003550     05  WK-806-2343-IDX   PIC S9(08) USAGE COMP    VALUE  2343.
003560     05  WK-806-2344-IDX   PIC S9(08) USAGE COMP    VALUE  2344.
003570     05  WK-806-2345-IDX   PIC S9(08) USAGE COMP    VALUE  2345.
003580     05  WK-806-2346-IDX   PIC S9(08) USAGE COMP    VALUE  2346.
003590     05  WK-806-2347-IDX   PIC S9(08) USAGE COMP    VALUE  2347.
003600     05  WK-806-2348-IDX   PIC S9(08) USAGE COMP    VALUE  2348.
003610     05  WK-806-2349-IDX   PIC S9(08) USAGE COMP    VALUE  2349.
003620     05  WK-806-2350-IDX   PIC S9(08) USAGE COMP    VALUE  2350.
003630     05  WK-806-2351-IDX   PIC S9(08) USAGE COMP    VALUE  2351.
003640     05  WK-806-2352-IDX   PIC S9(08) USAGE COMP    VALUE  2352.
003650     05  WK-806-2353-IDX   PIC S9(08) USAGE COMP    VALUE  2353.
003660     05  WK-806-2354-IDX   PIC S9(08) USAGE COMP    VALUE  2354.
003670     05  WK-806-2355-IDX   PIC S9(08) USAGE COMP    VALUE  2355.
003680     05  WK-806-2356-IDX   PIC S9(08) USAGE COMP    VALUE  2356.
003690     05  WK-806-2357-IDX   PIC S9(08) USAGE COMP    VALUE  2357.
003700     05  WK-806-2358-IDX   PIC S9(08) USAGE COMP    VALUE  2358.
003710     05  WK-806-2359-IDX   PIC S9(08) USAGE COMP    VALUE  2359.
003720     05  WK-806-2360-IDX   PIC S9(08) USAGE COMP    VALUE  2360.
003730     05  WK-806-2361-IDX   PIC S9(08) USAGE COMP    VALUE  2361.
003740     05  WK-806-2362-IDX   PIC S9(08) USAGE COMP    VALUE  2362.
003750     05  WK-806-2363-IDX   PIC S9(08) USAGE COMP    VALUE  2363.
003760     05  WK-806-2364-IDX   PIC S9(08) USAGE COMP    VALUE  2364.
003770     05  WK-806-2365-IDX   PIC S9(08) USAGE COMP    VALUE  2365.
003780     05  WK-806-2366-IDX   PIC S9(08) USAGE COMP    VALUE  2366.
003790     05  WK-806-2367-IDX   PIC S9(08) USAGE COMP    VALUE  2367.
003800     05  WK-806-2368-IDX   PIC S9(08) USAGE COMP    VALUE  2368.
003810     05  WK-806-2369-IDX   PIC S9(08) USAGE COMP    VALUE  2369.
003820     05  WK-806-2370-IDX   PIC S9(08) USAGE COMP    VALUE  2370.
003830     05  WK-806-2371-IDX   PIC S9(08) USAGE COMP    VALUE  2371.
003840     05  WK-806-2372-IDX   PIC S9(08) USAGE COMP    VALUE  2372.
003850     05  WK-806-2373-IDX   PIC S9(08) USAGE COMP    VALUE  2373.
003860     05  WK-806-2374-IDX   PIC S9(08) USAGE COMP    VALUE  2374.
003870     05  WK-806-2375-IDX   PIC S9(08) USAGE COMP    VALUE  2375.
003880     05  WK-806-2376-IDX   PIC S9(08) USAGE COMP    VALUE  2376.
003890     05  WK-806-2377-IDX   PIC S9(08) USAGE COMP    VALUE  2377.
003900     05  WK-806-2378-IDX   PIC S9(08) USAGE COMP    VALUE  2378.
003910     05  WK-806-2379-IDX   PIC S9(08) USAGE COMP    VALUE  2379.
003920     05  WK-806-2380-IDX   PIC S9(08) USAGE COMP    VALUE  2380.
003930     05  WK-806-2381-IDX   PIC S9(08) USAGE COMP    VALUE  2381.
003940     05  WK-806-2382-IDX   PIC S9(08) USAGE COMP    VALUE  2382.
003950     05  WK-806-2383-IDX   PIC S9(08) USAGE COMP    VALUE  2383.
003960     05  WK-806-2384-IDX   PIC S9(08) USAGE COMP    VALUE  2384.
003970     05  WK-806-2385-IDX   PIC S9(08) USAGE COMP    VALUE  2385.
003980     05  WK-806-2386-IDX   PIC S9(08) USAGE COMP    VALUE  2386.
003990     05  WK-806-2387-IDX   PIC S9(08) USAGE COMP    VALUE  2387.
004000     05  WK-806-2388-IDX   PIC S9(08) USAGE COMP    VALUE  2388.
004010     05  WK-806-2389-IDX   PIC S9(08) USAGE COMP    VALUE  2389.
004020     05  WK-806-2390-IDX   PIC S9(08) USAGE COMP    VALUE  2390.
004030     05  WK-806-2391-IDX   PIC S9(08) USAGE COMP    VALUE  2391.
004040     05  WK-806-2392-IDX   PIC S9(08) USAGE COMP    VALUE  2392.
004050     05  WK-806-2393-IDX   PIC S9(08) USAGE COMP    VALUE  2393.
004060     05  WK-806-2394-IDX   PIC S9(08) USAGE COMP    VALUE  2394.
004070     05  WK-806-2395-IDX   PIC S9(08) USAGE COMP    VALUE  2395.
004080     05  WK-806-2396-IDX   PIC S9(08) USAGE COMP    VALUE  2396.
004090     05  WK-806-2397-IDX   PIC S9(08) USAGE COMP    VALUE  2397.
004100     05  WK-806-2398-IDX   PIC S9(08) USAGE COMP    VALUE  2398.
004110     05  WK-806-2399-IDX   PIC S9(08) USAGE COMP    VALUE  2399.
004120     05  WK-806-2400-IDX   PIC S9(08) USAGE COMP    VALUE  2400.
004130     05  WK-806-2401-IDX   PIC S9(08) USAGE COMP    VALUE  2401.
004140     05  WK-806-2402-IDX   PIC S9(08) USAGE COMP    VALUE  2402.
004150     05  WK-806-2403-IDX   PIC S9(08) USAGE COMP    VALUE  2403.
004160     05  WK-806-2404-IDX   PIC S9(08) USAGE COMP    VALUE  2404.
004170     05  WK-806-2405-IDX   PIC S9(08) USAGE COMP    VALUE  2405.
004180     05  WK-806-2406-IDX   PIC S9(08) USAGE COMP    VALUE  2406.
004190     05  WK-806-2407-IDX   PIC S9(08) USAGE COMP    VALUE  2407.
004200     05  WK-806-2408-IDX   PIC S9(08) USAGE COMP    VALUE  2408.
004210     05  WK-806-2409-IDX   PIC S9(08) USAGE COMP    VALUE  2409.
004220     05  WK-806-2410-IDX   PIC S9(08) USAGE COMP    VALUE  2410.
004230     05  WK-806-2411-IDX   PIC S9(08) USAGE COMP    VALUE  2411.
004240     05  WK-806-2412-IDX   PIC S9(08) USAGE COMP    VALUE  2412.
004250     05  WK-806-2413-IDX   PIC S9(08) USAGE COMP    VALUE  2413.
004260     05  WK-806-2414-IDX   PIC S9(08) USAGE COMP    VALUE  2414.
004270     05  WK-806-2415-IDX   PIC S9(08) USAGE COMP    VALUE  2415.
004280     05  WK-806-2416-IDX   PIC S9(08) USAGE COMP    VALUE  2416.
004290     05  WK-806-2417-IDX   PIC S9(08) USAGE COMP    VALUE  2417.
004300     05  WK-806-2418-IDX   PIC S9(08) USAGE COMP    VALUE  2418.
004310     05  WK-806-2419-IDX   PIC S9(08) USAGE COMP    VALUE  2419.
004320     05  WK-806-2420-IDX   PIC S9(08) USAGE COMP    VALUE  2420.
004330     05  WK-806-2421-IDX   PIC S9(08) USAGE COMP    VALUE  2421.
004340     05  WK-806-2422-IDX   PIC S9(08) USAGE COMP    VALUE  2422.
004350     05  WK-806-2423-IDX   PIC S9(08) USAGE COMP    VALUE  2423.
004360     05  WK-806-2424-IDX   PIC S9(08) USAGE COMP    VALUE  2424.
004370     05  WK-806-2425-IDX   PIC S9(08) USAGE COMP    VALUE  2425.
004380     05  WK-806-2426-IDX   PIC S9(08) USAGE COMP    VALUE  2426.
004390     05  WK-806-2427-IDX   PIC S9(08) USAGE COMP    VALUE  2427.
004400     05  WK-806-2428-IDX   PIC S9(08) USAGE COMP    VALUE  2428.
004410     05  WK-806-2429-IDX   PIC S9(08) USAGE COMP    VALUE  2429.
004420     05  WK-806-2430-IDX   PIC S9(08) USAGE COMP    VALUE  2430.
004430     05  WK-806-2431-IDX   PIC S9(08) USAGE COMP    VALUE  2431.
004440     05  WK-806-2432-IDX   PIC S9(08) USAGE COMP    VALUE  2432.
004450     05  WK-806-2433-IDX   PIC S9(08) USAGE COMP    VALUE  2433.
004460     05  WK-806-2434-IDX   PIC S9(08) USAGE COMP    VALUE  2434.
004470     05  WK-806-2435-IDX   PIC S9(08) USAGE COMP    VALUE  2435.
004480     05  WK-806-2436-IDX   PIC S9(08) USAGE COMP    VALUE  2436.
004490     05  WK-806-2437-IDX   PIC S9(08) USAGE COMP    VALUE  2437.
004500     05  WK-806-2438-IDX   PIC S9(08) USAGE COMP    VALUE  2438.
004510     05  WK-806-2439-IDX   PIC S9(08) USAGE COMP    VALUE  2439.
004520     05  WK-806-2440-IDX   PIC S9(08) USAGE COMP    VALUE  2440.
004530     05  WK-806-2441-IDX   PIC S9(08) USAGE COMP    VALUE  2441.
004540     05  WK-806-2442-IDX   PIC S9(08) USAGE COMP    VALUE  2442.
004550     05  WK-806-2443-IDX   PIC S9(08) USAGE COMP    VALUE  2443.
004560     05  WK-806-2444-IDX   PIC S9(08) USAGE COMP    VALUE  2444.
004570     05  WK-806-2445-IDX   PIC S9(08) USAGE COMP    VALUE  2445.
004580     05  WK-806-2446-IDX   PIC S9(08) USAGE COMP    VALUE  2446.
004590     05  WK-806-2447-IDX   PIC S9(08) USAGE COMP    VALUE  2447.
004600     05  WK-806-2448-IDX   PIC S9(08) USAGE COMP    VALUE  2448.
004610     05  WK-806-2449-IDX   PIC S9(08) USAGE COMP    VALUE  2449.
004620     05  WK-806-2450-IDX   PIC S9(08) USAGE COMP    VALUE  2450.
004630     05  WK-806-2451-IDX   PIC S9(08) USAGE COMP    VALUE  2451.
004640     05  WK-806-2452-IDX   PIC S9(08) USAGE COMP    VALUE  2452.
004650     05  WK-806-2453-IDX   PIC S9(08) USAGE COMP    VALUE  2453.
004660     05  WK-806-2454-IDX   PIC S9(08) USAGE COMP    VALUE  2454.
004670     05  WK-806-2455-IDX   PIC S9(08) USAGE COMP    VALUE  2455.
004680     05  WK-806-2456-IDX   PIC S9(08) USAGE COMP    VALUE  2456.
004690     05  WK-806-2457-IDX   PIC S9(08) USAGE COMP    VALUE  2457.
004700     05  WK-806-2458-IDX   PIC S9(08) USAGE COMP    VALUE  2458.
004710     05  WK-806-2459-IDX   PIC S9(08) USAGE COMP    VALUE  2459.
004720     05  WK-806-2460-IDX   PIC S9(08) USAGE COMP    VALUE  2460.
004730     05  WK-806-2461-IDX   PIC S9(08) USAGE COMP    VALUE  2461.
004740     05  WK-806-2462-IDX   PIC S9(08) USAGE COMP    VALUE  2462.
004750     05  WK-806-2463-IDX   PIC S9(08) USAGE COMP    VALUE  2463.
004760     05  WK-806-2464-IDX   PIC S9(08) USAGE COMP    VALUE  2464.
004770     05  WK-806-2465-IDX   PIC S9(08) USAGE COMP    VALUE  2465.
004780     05  WK-806-2466-IDX   PIC S9(08) USAGE COMP    VALUE  2466.
004790     05  WK-806-2467-IDX   PIC S9(08) USAGE COMP    VALUE  2467.
004800     05  WK-806-2468-IDX   PIC S9(08) USAGE COMP    VALUE  2468.
004810     05  WK-806-2469-IDX   PIC S9(08) USAGE COMP    VALUE  2469.
004820     05  WK-806-2470-IDX   PIC S9(08) USAGE COMP    VALUE  2470.
004830     05  WK-806-2471-IDX   PIC S9(08) USAGE COMP    VALUE  2471.
004840     05  WK-806-2472-IDX   PIC S9(08) USAGE COMP    VALUE  2472.
004850     05  WK-806-2473-IDX   PIC S9(08) USAGE COMP    VALUE  2473.
004860     05  WK-806-2474-IDX   PIC S9(08) USAGE COMP    VALUE  2474.
004870     05  WK-806-2475-IDX   PIC S9(08) USAGE COMP    VALUE  2475.
004880     05  WK-806-2476-IDX   PIC S9(08) USAGE COMP    VALUE  2476.
004890     05  WK-806-2477-IDX   PIC S9(08) USAGE COMP    VALUE  2477.
004900     05  WK-806-2478-IDX   PIC S9(08) USAGE COMP    VALUE  2478.
004910     05  WK-806-2479-IDX   PIC S9(08) USAGE COMP    VALUE  2479.
004920     05  WK-806-2480-IDX   PIC S9(08) USAGE COMP    VALUE  2480.
004930     05  WK-806-2481-IDX   PIC S9(08) USAGE COMP    VALUE  2481.
004940     05  WK-806-2482-IDX   PIC S9(08) USAGE COMP    VALUE  2482.
004950     05  WK-806-2483-IDX   PIC S9(08) USAGE COMP    VALUE  2483.
004960     05  WK-806-2484-IDX   PIC S9(08) USAGE COMP    VALUE  2484.
004970     05  WK-806-2485-IDX   PIC S9(08) USAGE COMP    VALUE  2485.
004980     05  WK-806-2486-IDX   PIC S9(08) USAGE COMP    VALUE  2486.
004990     05  WK-806-2487-IDX   PIC S9(08) USAGE COMP    VALUE  2487.
005000     05  WK-806-2488-IDX   PIC S9(08) USAGE COMP    VALUE  2488.
005010     05  WK-806-2489-IDX   PIC S9(08) USAGE COMP    VALUE  2489.
005020     05  WK-806-2490-IDX   PIC S9(08) USAGE COMP    VALUE  2490.
005030     05  WK-806-2491-IDX   PIC S9(08) USAGE COMP    VALUE  2491.
005040     05  WK-806-2492-IDX   PIC S9(08) USAGE COMP    VALUE  2492.
005050     05  WK-806-2493-IDX   PIC S9(08) USAGE COMP    VALUE  2493.
005060     05  WK-806-2494-IDX   PIC S9(08) USAGE COMP    VALUE  2494.
005070     05  WK-806-2495-IDX   PIC S9(08) USAGE COMP    VALUE  2495.
005080     05  WK-806-2496-IDX   PIC S9(08) USAGE COMP    VALUE  2496.
005090     05  WK-806-2497-IDX   PIC S9(08) USAGE COMP    VALUE  2497.
005100     05  WK-806-2498-IDX   PIC S9(08) USAGE COMP    VALUE  2498.
005110     05  WK-806-2499-IDX   PIC S9(08) USAGE COMP    VALUE  2499.
005120     05  WK-806-2500-IDX   PIC S9(08) USAGE COMP    VALUE  2500.
005130     05  WK-806-2501-IDX   PIC S9(08) USAGE COMP    VALUE  2501.
005140     05  WK-806-2502-IDX   PIC S9(08) USAGE COMP    VALUE  2502.
005150     05  WK-806-2503-IDX   PIC S9(08) USAGE COMP    VALUE  2503.
005160     05  WK-806-2504-IDX   PIC S9(08) USAGE COMP    VALUE  2504.
005170     05  WK-806-2505-IDX   PIC S9(08) USAGE COMP    VALUE  2505.
005180     05  WK-806-2506-IDX   PIC S9(08) USAGE COMP    VALUE  2506.
005190     05  WK-806-2507-IDX   PIC S9(08) USAGE COMP    VALUE  2507.
005200     05  WK-806-2508-IDX   PIC S9(08) USAGE COMP    VALUE  2508.
005210     05  WK-806-2509-IDX   PIC S9(08) USAGE COMP    VALUE  2509.
005220     05  WK-806-2510-IDX   PIC S9(08) USAGE COMP    VALUE  2510.
005230     05  WK-806-2511-IDX   PIC S9(08) USAGE COMP    VALUE  2511.
005240     05  WK-806-2512-IDX   PIC S9(08) USAGE COMP    VALUE  2512.
005250     05  WK-806-2513-IDX   PIC S9(08) USAGE COMP    VALUE  2513.
005260     05  WK-806-2514-IDX   PIC S9(08) USAGE COMP    VALUE  2514.
005270     05  WK-806-2515-IDX   PIC S9(08) USAGE COMP    VALUE  2515.
005280     05  WK-806-2516-IDX   PIC S9(08) USAGE COMP    VALUE  2516.
005290     05  WK-806-2517-IDX   PIC S9(08) USAGE COMP    VALUE  2517.
005300     05  WK-806-2518-IDX   PIC S9(08) USAGE COMP    VALUE  2518.
005310     05  WK-806-2519-IDX   PIC S9(08) USAGE COMP    VALUE  2519.
005320     05  WK-806-2520-IDX   PIC S9(08) USAGE COMP    VALUE  2520.
005330     05  WK-806-2521-IDX   PIC S9(08) USAGE COMP    VALUE  2521.
005340     05  WK-806-2522-IDX   PIC S9(08) USAGE COMP    VALUE  2522.
005350     05  WK-806-2523-IDX   PIC S9(08) USAGE COMP    VALUE  2523.
005360     05  WK-806-2524-IDX   PIC S9(08) USAGE COMP    VALUE  2524.
005370     05  WK-806-2525-IDX   PIC S9(08) USAGE COMP    VALUE  2525.
005380     05  WK-806-2526-IDX   PIC S9(08) USAGE COMP    VALUE  2526.
005390     05  WK-806-2527-IDX   PIC S9(08) USAGE COMP    VALUE  2527.
005400     05  WK-806-2528-IDX   PIC S9(08) USAGE COMP    VALUE  2528.
005410     05  WK-806-2529-IDX   PIC S9(08) USAGE COMP    VALUE  2529.
005420     05  WK-806-2530-IDX   PIC S9(08) USAGE COMP    VALUE  2530.
005430     05  WK-806-2531-IDX   PIC S9(08) USAGE COMP    VALUE  2531.
005440     05  WK-806-2532-IDX   PIC S9(08) USAGE COMP    VALUE  2532.
005450     05  WK-806-2533-IDX   PIC S9(08) USAGE COMP    VALUE  2533.
005460     05  WK-806-2534-IDX   PIC S9(08) USAGE COMP    VALUE  2534.
005470     05  WK-806-2535-IDX   PIC S9(08) USAGE COMP    VALUE  2535.
005480     05  WK-806-2536-IDX   PIC S9(08) USAGE COMP    VALUE  2536.
005490     05  WK-806-2537-IDX   PIC S9(08) USAGE COMP    VALUE  2537.
005500     05  WK-806-2538-IDX   PIC S9(08) USAGE COMP    VALUE  2538.
005510     05  WK-806-2539-IDX   PIC S9(08) USAGE COMP    VALUE  2539.
005520     05  WK-806-2540-IDX   PIC S9(08) USAGE COMP    VALUE  2540.
005530     05  WK-806-2541-IDX   PIC S9(08) USAGE COMP    VALUE  2541.
005540     05  WK-806-2542-IDX   PIC S9(08) USAGE COMP    VALUE  2542.
005550     05  WK-806-2543-IDX   PIC S9(08) USAGE COMP    VALUE  2543.
005560     05  WK-806-2544-IDX   PIC S9(08) USAGE COMP    VALUE  2544.
005570     05  WK-806-2545-IDX   PIC S9(08) USAGE COMP    VALUE  2545.
005580     05  WK-806-2546-IDX   PIC S9(08) USAGE COMP    VALUE  2546.
005590     05  WK-806-2547-IDX   PIC S9(08) USAGE COMP    VALUE  2547.
005600     05  WK-806-2548-IDX   PIC S9(08) USAGE COMP    VALUE  2548.
005610     05  WK-806-2549-IDX   PIC S9(08) USAGE COMP    VALUE  2549.
005620     05  WK-806-2550-IDX   PIC S9(08) USAGE COMP    VALUE  2550.
005630     05  WK-806-2551-IDX   PIC S9(08) USAGE COMP    VALUE  2551.
005640     05  WK-806-2552-IDX   PIC S9(08) USAGE COMP    VALUE  2552.
005650     05  WK-806-2553-IDX   PIC S9(08) USAGE COMP    VALUE  2553.
005660     05  WK-806-2554-IDX   PIC S9(08) USAGE COMP    VALUE  2554.
005670     05  WK-806-2555-IDX   PIC S9(08) USAGE COMP    VALUE  2555.
005680     05  WK-806-2556-IDX   PIC S9(08) USAGE COMP    VALUE  2556.
005690     05  WK-806-2557-IDX   PIC S9(08) USAGE COMP    VALUE  2557.
005700     05  WK-806-2558-IDX   PIC S9(08) USAGE COMP    VALUE  2558.
005710     05  WK-806-2559-IDX   PIC S9(08) USAGE COMP    VALUE  2559.
005720     05  WK-806-2560-IDX   PIC S9(08) USAGE COMP    VALUE  2560.
005730     05  WK-806-2561-IDX   PIC S9(08) USAGE COMP    VALUE  2561.
005740     05  WK-806-2562-IDX   PIC S9(08) USAGE COMP    VALUE  2562.
005750     05  WK-806-2563-IDX   PIC S9(08) USAGE COMP    VALUE  2563.
005760     05  WK-806-2564-IDX   PIC S9(08) USAGE COMP    VALUE  2564.
005770     05  WK-806-2565-IDX   PIC S9(08) USAGE COMP    VALUE  2565.
005780     05  WK-806-2566-IDX   PIC S9(08) USAGE COMP    VALUE  2566.
005790     05  WK-806-2567-IDX   PIC S9(08) USAGE COMP    VALUE  2567.
005800     05  WK-806-2568-IDX   PIC S9(08) USAGE COMP    VALUE  2568.
005810     05  WK-806-2569-IDX   PIC S9(08) USAGE COMP    VALUE  2569.
005820     05  WK-806-2570-IDX   PIC S9(08) USAGE COMP    VALUE  2570.
005830     05  WK-806-2571-IDX   PIC S9(08) USAGE COMP    VALUE  2571.
005840     05  WK-806-2572-IDX   PIC S9(08) USAGE COMP    VALUE  2572.
005850     05  WK-806-2573-IDX   PIC S9(08) USAGE COMP    VALUE  2573.
005860     05  WK-806-2574-IDX   PIC S9(08) USAGE COMP    VALUE  2574.
005870     05  WK-806-2575-IDX   PIC S9(08) USAGE COMP    VALUE  2575.
005880     05  WK-806-2576-IDX   PIC S9(08) USAGE COMP    VALUE  2576.
005890     05  WK-806-2577-IDX   PIC S9(08) USAGE COMP    VALUE  2577.
005900     05  WK-806-2578-IDX   PIC S9(08) USAGE COMP    VALUE  2578.
005910     05  WK-806-2579-IDX   PIC S9(08) USAGE COMP    VALUE  2579.
005920     05  WK-806-2580-IDX   PIC S9(08) USAGE COMP    VALUE  2580.
005930     05  WK-806-2581-IDX   PIC S9(08) USAGE COMP    VALUE  2581.
005940     05  WK-806-2582-IDX   PIC S9(08) USAGE COMP    VALUE  2582.
005950     05  WK-806-2583-IDX   PIC S9(08) USAGE COMP    VALUE  2583.
005960     05  WK-806-2584-IDX   PIC S9(08) USAGE COMP    VALUE  2584.
005970     05  WK-806-2585-IDX   PIC S9(08) USAGE COMP    VALUE  2585.
005980     05  WK-806-2586-IDX   PIC S9(08) USAGE COMP    VALUE  2586.
005990     05  WK-806-2587-IDX   PIC S9(08) USAGE COMP    VALUE  2587.
006000     05  WK-806-2588-IDX   PIC S9(08) USAGE COMP    VALUE  2588.
006010     05  WK-806-2589-IDX   PIC S9(08) USAGE COMP    VALUE  2589.
006020     05  WK-806-2590-IDX   PIC S9(08) USAGE COMP    VALUE  2590.
006030     05  WK-806-2591-IDX   PIC S9(08) USAGE COMP    VALUE  2591.
006040     05  WK-806-2592-IDX   PIC S9(08) USAGE COMP    VALUE  2592.
006050     05  WK-806-2593-IDX   PIC S9(08) USAGE COMP    VALUE  2593.
006060     05  WK-806-2594-IDX   PIC S9(08) USAGE COMP    VALUE  2594.
006070     05  WK-806-2595-IDX   PIC S9(08) USAGE COMP    VALUE  2595.
006080     05  WK-806-2596-IDX   PIC S9(08) USAGE COMP    VALUE  2596.
006090     05  WK-806-2597-IDX   PIC S9(08) USAGE COMP    VALUE  2597.
006100     05  WK-806-2598-IDX   PIC S9(08) USAGE COMP    VALUE  2598.
006110     05  WK-806-2599-IDX   PIC S9(08) USAGE COMP    VALUE  2599.
006120     05  WK-806-2600-IDX   PIC S9(08) USAGE COMP    VALUE  2600.
006130     05  WK-806-2601-IDX   PIC S9(08) USAGE COMP    VALUE  2601.
006140     05  WK-806-2602-IDX   PIC S9(08) USAGE COMP    VALUE  2602.
006150     05  WK-806-2603-IDX   PIC S9(08) USAGE COMP    VALUE  2603.
006160     05  WK-806-2604-IDX   PIC S9(08) USAGE COMP    VALUE  2604.
006170     05  WK-806-2605-IDX   PIC S9(08) USAGE COMP    VALUE  2605.
006180     05  WK-806-2606-IDX   PIC S9(08) USAGE COMP    VALUE  2606.
006190     05  WK-806-2607-IDX   PIC S9(08) USAGE COMP    VALUE  2607.
006200     05  WK-806-2608-IDX   PIC S9(08) USAGE COMP    VALUE  2608.
006210     05  WK-806-2609-IDX   PIC S9(08) USAGE COMP    VALUE  2609.
006220     05  WK-806-2610-IDX   PIC S9(08) USAGE COMP    VALUE  2610.
006230     05  WK-806-2611-IDX   PIC S9(08) USAGE COMP    VALUE  2611.
006240     05  WK-806-2612-IDX   PIC S9(08) USAGE COMP    VALUE  2612.
006250     05  WK-806-2613-IDX   PIC S9(08) USAGE COMP    VALUE  2613.
006260     05  WK-806-2614-IDX   PIC S9(08) USAGE COMP    VALUE  2614.
006270     05  WK-806-2615-IDX   PIC S9(08) USAGE COMP    VALUE  2615.
006280     05  WK-806-2616-IDX   PIC S9(08) USAGE COMP    VALUE  2616.
006290     05  WK-806-2617-IDX   PIC S9(08) USAGE COMP    VALUE  2617.
006300     05  WK-806-2618-IDX   PIC S9(08) USAGE COMP    VALUE  2618.
006310     05  WK-806-2619-IDX   PIC S9(08) USAGE COMP    VALUE  2619.
006320     05  WK-806-2620-IDX   PIC S9(08) USAGE COMP    VALUE  2620.
006330     05  WK-806-2621-IDX   PIC S9(08) USAGE COMP    VALUE  2621.
006340     05  WK-806-2622-IDX   PIC S9(08) USAGE COMP    VALUE  2622.
006350     05  WK-806-2623-IDX   PIC S9(08) USAGE COMP    VALUE  2623.
006360     05  WK-806-2624-IDX   PIC S9(08) USAGE COMP    VALUE  2624.
006370     05  WK-806-2625-IDX   PIC S9(08) USAGE COMP    VALUE  2625.
006380     05  WK-806-2626-IDX   PIC S9(08) USAGE COMP    VALUE  2626.
006390     05  WK-806-2627-IDX   PIC S9(08) USAGE COMP    VALUE  2627.
006400     05  WK-806-2628-IDX   PIC S9(08) USAGE COMP    VALUE  2628.
006410     05  WK-806-2629-IDX   PIC S9(08) USAGE COMP    VALUE  2629.
006420     05  WK-806-2630-IDX   PIC S9(08) USAGE COMP    VALUE  2630.
006430     05  WK-806-2631-IDX   PIC S9(08) USAGE COMP    VALUE  2631.
006440     05  WK-806-2632-IDX   PIC S9(08) USAGE COMP    VALUE  2632.
006450     05  WK-806-2633-IDX   PIC S9(08) USAGE COMP    VALUE  2633.
006460     05  WK-806-2634-IDX   PIC S9(08) USAGE COMP    VALUE  2634.
006470     05  WK-806-2635-IDX   PIC S9(08) USAGE COMP    VALUE  2635.
006480     05  WK-806-2636-IDX   PIC S9(08) USAGE COMP    VALUE  2636.
006490     05  WK-806-2637-IDX   PIC S9(08) USAGE COMP    VALUE  2637.
006500     05  WK-806-2638-IDX   PIC S9(08) USAGE COMP    VALUE  2638.
006510     05  WK-806-2639-IDX   PIC S9(08) USAGE COMP    VALUE  2639.
006520     05  WK-806-2640-IDX   PIC S9(08) USAGE COMP    VALUE  2640.
006530     05  WK-806-2641-IDX   PIC S9(08) USAGE COMP    VALUE  2641.
006540     05  WK-806-2642-IDX   PIC S9(08) USAGE COMP    VALUE  2642.
006550     05  WK-806-2643-IDX   PIC S9(08) USAGE COMP    VALUE  2643.
006560     05  WK-806-2644-IDX   PIC S9(08) USAGE COMP    VALUE  2644.
006570     05  WK-806-2645-IDX   PIC S9(08) USAGE COMP    VALUE  2645.
006580     05  WK-806-2646-IDX   PIC S9(08) USAGE COMP    VALUE  2646.
006590     05  WK-806-2647-IDX   PIC S9(08) USAGE COMP    VALUE  2647.
006600     05  WK-806-2648-IDX   PIC S9(08) USAGE COMP    VALUE  2648.
006610     05  WK-806-2649-IDX   PIC S9(08) USAGE COMP    VALUE  2649.
006620     05  WK-806-2650-IDX   PIC S9(08) USAGE COMP    VALUE  2650.
006630     05  WK-806-2651-IDX   PIC S9(08) USAGE COMP    VALUE  2651.
006640     05  WK-806-2652-IDX   PIC S9(08) USAGE COMP    VALUE  2652.
006650     05  WK-806-2653-IDX   PIC S9(08) USAGE COMP    VALUE  2653.
006660     05  WK-806-2654-IDX   PIC S9(08) USAGE COMP    VALUE  2654.
006670     05  WK-806-2655-IDX   PIC S9(08) USAGE COMP    VALUE  2655.
006680     05  WK-806-2656-IDX   PIC S9(08) USAGE COMP    VALUE  2656.
006690     05  WK-806-2657-IDX   PIC S9(08) USAGE COMP    VALUE  2657.
006700     05  WK-806-2658-IDX   PIC S9(08) USAGE COMP    VALUE  2658.
006710     05  WK-806-2659-IDX   PIC S9(08) USAGE COMP    VALUE  2659.
006720     05  WK-806-2660-IDX   PIC S9(08) USAGE COMP    VALUE  2660.
006730     05  WK-806-2661-IDX   PIC S9(08) USAGE COMP    VALUE  2661.
006740     05  WK-806-2662-IDX   PIC S9(08) USAGE COMP    VALUE  2662.
006750     05  WK-806-2663-IDX   PIC S9(08) USAGE COMP    VALUE  2663.
006760     05  WK-806-2664-IDX   PIC S9(08) USAGE COMP    VALUE  2664.
006770     05  WK-806-2665-IDX   PIC S9(08) USAGE COMP    VALUE  2665.
006780     05  WK-806-2666-IDX   PIC S9(08) USAGE COMP    VALUE  2666.
006790     05  WK-806-2667-IDX   PIC S9(08) USAGE COMP    VALUE  2667.
006800     05  WK-806-2668-IDX   PIC S9(08) USAGE COMP    VALUE  2668.
006810     05  WK-806-2669-IDX   PIC S9(08) USAGE COMP    VALUE  2669.
006820     05  WK-806-2670-IDX   PIC S9(08) USAGE COMP    VALUE  2670.
006830     05  WK-806-2671-IDX   PIC S9(08) USAGE COMP    VALUE  2671.
006840     05  WK-806-2672-IDX   PIC S9(08) USAGE COMP    VALUE  2672.
006850     05  WK-806-2673-IDX   PIC S9(08) USAGE COMP    VALUE  2673.
006860     05  WK-806-2674-IDX   PIC S9(08) USAGE COMP    VALUE  2674.
006870     05  WK-806-2675-IDX   PIC S9(08) USAGE COMP    VALUE  2675.
006880     05  WK-806-2676-IDX   PIC S9(08) USAGE COMP    VALUE  2676.
006890     05  WK-806-2677-IDX   PIC S9(08) USAGE COMP    VALUE  2677.
006900     05  WK-806-2678-IDX   PIC S9(08) USAGE COMP    VALUE  2678.
006910     05  WK-806-2679-IDX   PIC S9(08) USAGE COMP    VALUE  2679.
006920     05  WK-806-2680-IDX   PIC S9(08) USAGE COMP    VALUE  2680.
006930     05  WK-806-2681-IDX   PIC S9(08) USAGE COMP    VALUE  2681.
006940     05  WK-806-2682-IDX   PIC S9(08) USAGE COMP    VALUE  2682.
006950     05  WK-806-2683-IDX   PIC S9(08) USAGE COMP    VALUE  2683.
006960     05  WK-806-2684-IDX   PIC S9(08) USAGE COMP    VALUE  2684.
006970     05  WK-806-2685-IDX   PIC S9(08) USAGE COMP    VALUE  2685.
006980     05  WK-806-2686-IDX   PIC S9(08) USAGE COMP    VALUE  2686.
006990     05  WK-806-2687-IDX   PIC S9(08) USAGE COMP    VALUE  2687.
007000     05  WK-806-2688-IDX   PIC S9(08) USAGE COMP    VALUE  2688.
007010     05  WK-806-2689-IDX   PIC S9(08) USAGE COMP    VALUE  2689.
007020     05  WK-806-2690-IDX   PIC S9(08) USAGE COMP    VALUE  2690.
007030     05  WK-806-2691-IDX   PIC S9(08) USAGE COMP    VALUE  2691.
007040     05  WK-806-2692-IDX   PIC S9(08) USAGE COMP    VALUE  2692.
007050     05  WK-806-2693-IDX   PIC S9(08) USAGE COMP    VALUE  2693.
007060     05  WK-806-2694-IDX   PIC S9(08) USAGE COMP    VALUE  2694.
007070     05  WK-806-2695-IDX   PIC S9(08) USAGE COMP    VALUE  2695.
007080     05  WK-806-2696-IDX   PIC S9(08) USAGE COMP    VALUE  2696.
007090     05  WK-806-2697-IDX   PIC S9(08) USAGE COMP    VALUE  2697.
007100     05  WK-806-2698-IDX   PIC S9(08) USAGE COMP    VALUE  2698.
007110     05  WK-806-2699-IDX   PIC S9(08) USAGE COMP    VALUE  2699.
007120     05  WK-806-2700-IDX   PIC S9(08) USAGE COMP    VALUE  2700.
007130     05  WK-806-2701-IDX   PIC S9(08) USAGE COMP    VALUE  2701.
007140     05  WK-806-2702-IDX   PIC S9(08) USAGE COMP    VALUE  2702.
007150     05  WK-806-2703-IDX   PIC S9(08) USAGE COMP    VALUE  2703.
007160     05  WK-806-2704-IDX   PIC S9(08) USAGE COMP    VALUE  2704.
007170     05  WK-806-2705-IDX   PIC S9(08) USAGE COMP    VALUE  2705.
007180     05  WK-806-2706-IDX   PIC S9(08) USAGE COMP    VALUE  2706.
007190     05  WK-806-2707-IDX   PIC S9(08) USAGE COMP    VALUE  2707.
007200     05  WK-806-2708-IDX   PIC S9(08) USAGE COMP    VALUE  2708.
007210     05  WK-806-2709-IDX   PIC S9(08) USAGE COMP    VALUE  2709.
007220     05  WK-806-2710-IDX   PIC S9(08) USAGE COMP    VALUE  2710.
007230     05  WK-806-2711-IDX   PIC S9(08) USAGE COMP    VALUE  2711.
007240     05  WK-806-2712-IDX   PIC S9(08) USAGE COMP    VALUE  2712.
007250     05  WK-806-2713-IDX   PIC S9(08) USAGE COMP    VALUE  2713.
007260     05  WK-806-2714-IDX   PIC S9(08) USAGE COMP    VALUE  2714.
007270     05  WK-806-2715-IDX   PIC S9(08) USAGE COMP    VALUE  2715.
007280     05  WK-806-2716-IDX   PIC S9(08) USAGE COMP    VALUE  2716.
007290     05  WK-806-2717-IDX   PIC S9(08) USAGE COMP    VALUE  2717.
007300     05  WK-806-2718-IDX   PIC S9(08) USAGE COMP    VALUE  2718.
007310     05  WK-806-2719-IDX   PIC S9(08) USAGE COMP    VALUE  2719.
007320     05  WK-806-2720-IDX   PIC S9(08) USAGE COMP    VALUE  2720.
007330     05  WK-806-2721-IDX   PIC S9(08) USAGE COMP    VALUE  2721.
007340     05  WK-806-2722-IDX   PIC S9(08) USAGE COMP    VALUE  2722.
007350     05  WK-806-2723-IDX   PIC S9(08) USAGE COMP    VALUE  2723.
007360     05  WK-806-2724-IDX   PIC S9(08) USAGE COMP    VALUE  2724.
007370     05  WK-806-2725-IDX   PIC S9(08) USAGE COMP    VALUE  2725.
007380     05  WK-806-2726-IDX   PIC S9(08) USAGE COMP    VALUE  2726.
007390     05  WK-806-2727-IDX   PIC S9(08) USAGE COMP    VALUE  2727.
007400     05  WK-806-2728-IDX   PIC S9(08) USAGE COMP    VALUE  2728.
007410     05  WK-806-2729-IDX   PIC S9(08) USAGE COMP    VALUE  2729.
007420     05  WK-806-2730-IDX   PIC S9(08) USAGE COMP    VALUE  2730.
007430     05  WK-806-2731-IDX   PIC S9(08) USAGE COMP    VALUE  2731.
007440     05  WK-806-2732-IDX   PIC S9(08) USAGE COMP    VALUE  2732.
007450     05  WK-806-2733-IDX   PIC S9(08) USAGE COMP    VALUE  2733.
007460     05  WK-806-2734-IDX   PIC S9(08) USAGE COMP    VALUE  2734.
007470     05  WK-806-2735-IDX   PIC S9(08) USAGE COMP    VALUE  2735.
007480     05  WK-806-2736-IDX   PIC S9(08) USAGE COMP    VALUE  2736.
007490     05  WK-806-2737-IDX   PIC S9(08) USAGE COMP    VALUE  2737.
007500     05  WK-806-2738-IDX   PIC S9(08) USAGE COMP    VALUE  2738.
007510     05  WK-806-2739-IDX   PIC S9(08) USAGE COMP    VALUE  2739.
007520     05  WK-806-2740-IDX   PIC S9(08) USAGE COMP    VALUE  2740.
007530     05  WK-806-2741-IDX   PIC S9(08) USAGE COMP    VALUE  2741.
007540     05  WK-806-2742-IDX   PIC S9(08) USAGE COMP    VALUE  2742.
007550     05  WK-806-2743-IDX   PIC S9(08) USAGE COMP    VALUE  2743.
007560     05  WK-806-2744-IDX   PIC S9(08) USAGE COMP    VALUE  2744.
007570     05  WK-806-2745-IDX   PIC S9(08) USAGE COMP    VALUE  2745.
007580     05  WK-806-2746-IDX   PIC S9(08) USAGE COMP    VALUE  2746.
007590     05  WK-806-2747-IDX   PIC S9(08) USAGE COMP    VALUE  2747.
007600     05  WK-806-2748-IDX   PIC S9(08) USAGE COMP    VALUE  2748.
007610     05  WK-806-2749-IDX   PIC S9(08) USAGE COMP    VALUE  2749.
007620     05  WK-806-2750-IDX   PIC S9(08) USAGE COMP    VALUE  2750.
007630     05  WK-806-2751-IDX   PIC S9(08) USAGE COMP    VALUE  2751.
007640     05  WK-806-2752-IDX   PIC S9(08) USAGE COMP    VALUE  2752.
007650     05  WK-806-2753-IDX   PIC S9(08) USAGE COMP    VALUE  2753.
007660     05  WK-806-2754-IDX   PIC S9(08) USAGE COMP    VALUE  2754.
007670     05  WK-806-2755-IDX   PIC S9(08) USAGE COMP    VALUE  2755.
007680     05  WK-806-2756-IDX   PIC S9(08) USAGE COMP    VALUE  2756.
007690     05  WK-806-2757-IDX   PIC S9(08) USAGE COMP    VALUE  2757.
007700     05  WK-806-2758-IDX   PIC S9(08) USAGE COMP    VALUE  2758.
007710     05  WK-806-2759-IDX   PIC S9(08) USAGE COMP    VALUE  2759.
007720     05  WK-806-2760-IDX   PIC S9(08) USAGE COMP    VALUE  2760.
007730     05  WK-806-2761-IDX   PIC S9(08) USAGE COMP    VALUE  2761.
007740     05  WK-806-2762-IDX   PIC S9(08) USAGE COMP    VALUE  2762.
007750     05  WK-806-2763-IDX   PIC S9(08) USAGE COMP    VALUE  2763.
007760     05  WK-806-2764-IDX   PIC S9(08) USAGE COMP    VALUE  2764.
007770     05  WK-806-2765-IDX   PIC S9(08) USAGE COMP    VALUE  2765.
007780     05  WK-806-2766-IDX   PIC S9(08) USAGE COMP    VALUE  2766.
007790     05  WK-806-2767-IDX   PIC S9(08) USAGE COMP    VALUE  2767.
007800     05  WK-806-2768-IDX   PIC S9(08) USAGE COMP    VALUE  2768.
007810     05  WK-806-2769-IDX   PIC S9(08) USAGE COMP    VALUE  2769.
007820     05  WK-806-2770-IDX   PIC S9(08) USAGE COMP    VALUE  2770.
007830     05  WK-806-2771-IDX   PIC S9(08) USAGE COMP    VALUE  2771.
007840     05  WK-806-2772-IDX   PIC S9(08) USAGE COMP    VALUE  2772.
007850     05  WK-806-2773-IDX   PIC S9(08) USAGE COMP    VALUE  2773.
007860     05  WK-806-2774-IDX   PIC S9(08) USAGE COMP    VALUE  2774.
007870     05  WK-806-2775-IDX   PIC S9(08) USAGE COMP    VALUE  2775.
007880     05  WK-806-2776-IDX   PIC S9(08) USAGE COMP    VALUE  2776.
007890     05  WK-806-2777-IDX   PIC S9(08) USAGE COMP    VALUE  2777.
007900     05  WK-806-2778-IDX   PIC S9(08) USAGE COMP    VALUE  2778.
007910     05  WK-806-2779-IDX   PIC S9(08) USAGE COMP    VALUE  2779.
007920     05  WK-806-2780-IDX   PIC S9(08) USAGE COMP    VALUE  2780.
007930     05  WK-806-2781-IDX   PIC S9(08) USAGE COMP    VALUE  2781.
007940     05  WK-806-2782-IDX   PIC S9(08) USAGE COMP    VALUE  2782.
007950     05  WK-806-2783-IDX   PIC S9(08) USAGE COMP    VALUE  2783.
007960     05  WK-806-2784-IDX   PIC S9(08) USAGE COMP    VALUE  2784.
007970     05  WK-806-2785-IDX   PIC S9(08) USAGE COMP    VALUE  2785.
007980     05  WK-806-2786-IDX   PIC S9(08) USAGE COMP    VALUE  2786.
007990     05  WK-806-2787-IDX   PIC S9(08) USAGE COMP    VALUE  2787.
008000     05  WK-806-2788-IDX   PIC S9(08) USAGE COMP    VALUE  2788.
008010     05  WK-806-2789-IDX   PIC S9(08) USAGE COMP    VALUE  2789.
008020     05  WK-806-2790-IDX   PIC S9(08) USAGE COMP    VALUE  2790.
008030     05  WK-806-2791-IDX   PIC S9(08) USAGE COMP    VALUE  2791.
008040     05  WK-806-2792-IDX   PIC S9(08) USAGE COMP    VALUE  2792.
008050     05  WK-806-2793-IDX   PIC S9(08) USAGE COMP    VALUE  2793.
008060     05  WK-806-2794-IDX   PIC S9(08) USAGE COMP    VALUE  2794.
008070     05  WK-806-2795-IDX   PIC S9(08) USAGE COMP    VALUE  2795.
008080     05  WK-806-2796-IDX   PIC S9(08) USAGE COMP    VALUE  2796.
008090     05  WK-806-2797-IDX   PIC S9(08) USAGE COMP    VALUE  2797.
008100     05  WK-806-2798-IDX   PIC S9(08) USAGE COMP    VALUE  2798.
008110     05  WK-806-2799-IDX   PIC S9(08) USAGE COMP    VALUE  2799.
008120     05  WK-806-2800-IDX   PIC S9(08) USAGE COMP    VALUE  2800.
008130     05  WK-806-2801-IDX   PIC S9(08) USAGE COMP    VALUE  2801.
008140     05  WK-806-2802-IDX   PIC S9(08) USAGE COMP    VALUE  2802.
008150     05  WK-806-2803-IDX   PIC S9(08) USAGE COMP    VALUE  2803.
008160     05  WK-806-2804-IDX   PIC S9(08) USAGE COMP    VALUE  2804.
008170     05  WK-806-2805-IDX   PIC S9(08) USAGE COMP    VALUE  2805.
008180     05  WK-806-2806-IDX   PIC S9(08) USAGE COMP    VALUE  2806.
008190     05  WK-806-2807-IDX   PIC S9(08) USAGE COMP    VALUE  2807.
008200     05  WK-806-2808-IDX   PIC S9(08) USAGE COMP    VALUE  2808.
008210     05  WK-806-2809-IDX   PIC S9(08) USAGE COMP    VALUE  2809.
008220     05  WK-806-2810-IDX   PIC S9(08) USAGE COMP    VALUE  2810.
008230     05  WK-806-2811-IDX   PIC S9(08) USAGE COMP    VALUE  2811.
008240     05  WK-806-2812-IDX   PIC S9(08) USAGE COMP    VALUE  2812.
008250     05  WK-806-2813-IDX   PIC S9(08) USAGE COMP    VALUE  2813.
008260     05  WK-806-2814-IDX   PIC S9(08) USAGE COMP    VALUE  2814.
008270     05  WK-806-2815-IDX   PIC S9(08) USAGE COMP    VALUE  2815.
008280     05  WK-806-2816-IDX   PIC S9(08) USAGE COMP    VALUE  2816.
008290     05  WK-806-2817-IDX   PIC S9(08) USAGE COMP    VALUE  2817.
008300     05  WK-806-2818-IDX   PIC S9(08) USAGE COMP    VALUE  2818.
008310     05  WK-806-2819-IDX   PIC S9(08) USAGE COMP    VALUE  2819.
008320     05  WK-806-2820-IDX   PIC S9(08) USAGE COMP    VALUE  2820.
008330     05  WK-806-2821-IDX   PIC S9(08) USAGE COMP    VALUE  2821.
008340     05  WK-806-2822-IDX   PIC S9(08) USAGE COMP    VALUE  2822.
008350     05  WK-806-2823-IDX   PIC S9(08) USAGE COMP    VALUE  2823.
008360     05  WK-806-2824-IDX   PIC S9(08) USAGE COMP    VALUE  2824.
008370     05  WK-806-2825-IDX   PIC S9(08) USAGE COMP    VALUE  2825.
008380     05  WK-806-2826-IDX   PIC S9(08) USAGE COMP    VALUE  2826.
008390     05  WK-806-2827-IDX   PIC S9(08) USAGE COMP    VALUE  2827.
008400     05  WK-806-2828-IDX   PIC S9(08) USAGE COMP    VALUE  2828.
008410     05  WK-806-2829-IDX   PIC S9(08) USAGE COMP    VALUE  2829.
008420     05  WK-806-2830-IDX   PIC S9(08) USAGE COMP    VALUE  2830.
008430     05  WK-806-2831-IDX   PIC S9(08) USAGE COMP    VALUE  2831.
008440     05  WK-806-2832-IDX   PIC S9(08) USAGE COMP    VALUE  2832.
008450     05  WK-806-2833-IDX   PIC S9(08) USAGE COMP    VALUE  2833.
008460     05  WK-806-2834-IDX   PIC S9(08) USAGE COMP    VALUE  2834.
008470     05  WK-806-2835-IDX   PIC S9(08) USAGE COMP    VALUE  2835.
008480     05  WK-806-2836-IDX   PIC S9(08) USAGE COMP    VALUE  2836.
008490     05  WK-806-2837-IDX   PIC S9(08) USAGE COMP    VALUE  2837.
008500     05  WK-806-2838-IDX   PIC S9(08) USAGE COMP    VALUE  2838.
008510     05  WK-806-2839-IDX   PIC S9(08) USAGE COMP    VALUE  2839.
008520     05  WK-806-2840-IDX   PIC S9(08) USAGE COMP    VALUE  2840.
008530     05  WK-806-2841-IDX   PIC S9(08) USAGE COMP    VALUE  2841.
008540     05  WK-806-2842-IDX   PIC S9(08) USAGE COMP    VALUE  2842.
008550     05  WK-806-2843-IDX   PIC S9(08) USAGE COMP    VALUE  2843.
008560     05  WK-806-2844-IDX   PIC S9(08) USAGE COMP    VALUE  2844.
008570     05  WK-806-2845-IDX   PIC S9(08) USAGE COMP    VALUE  2845.
008580     05  WK-806-2846-IDX   PIC S9(08) USAGE COMP    VALUE  2846.
008590     05  WK-806-2847-IDX   PIC S9(08) USAGE COMP    VALUE  2847.
008600     05  WK-806-2848-IDX   PIC S9(08) USAGE COMP    VALUE  2848.
008610     05  WK-806-2849-IDX   PIC S9(08) USAGE COMP    VALUE  2849.
008620     05  WK-806-2850-IDX   PIC S9(08) USAGE COMP    VALUE  2850.
008630     05  WK-806-2851-IDX   PIC S9(08) USAGE COMP    VALUE  2851.
008640     05  WK-806-2852-IDX   PIC S9(08) USAGE COMP    VALUE  2852.
008650     05  WK-806-2853-IDX   PIC S9(08) USAGE COMP    VALUE  2853.
008660     05  WK-806-2854-IDX   PIC S9(08) USAGE COMP    VALUE  2854.
008670     05  WK-806-2855-IDX   PIC S9(08) USAGE COMP    VALUE  2855.
008680     05  WK-806-2856-IDX   PIC S9(08) USAGE COMP    VALUE  2856.
008690     05  WK-806-2857-IDX   PIC S9(08) USAGE COMP    VALUE  2857.
008700     05  WK-806-2858-IDX   PIC S9(08) USAGE COMP    VALUE  2858.
008710     05  WK-806-2859-IDX   PIC S9(08) USAGE COMP    VALUE  2859.
008720     05  WK-806-2860-IDX   PIC S9(08) USAGE COMP    VALUE  2860.
008730     05  WK-806-2861-IDX   PIC S9(08) USAGE COMP    VALUE  2861.
008740     05  WK-806-2862-IDX   PIC S9(08) USAGE COMP    VALUE  2862.
008750     05  WK-806-2863-IDX   PIC S9(08) USAGE COMP    VALUE  2863.
008760     05  WK-806-2864-IDX   PIC S9(08) USAGE COMP    VALUE  2864.
008770     05  WK-806-2865-IDX   PIC S9(08) USAGE COMP    VALUE  2865.
008780     05  WK-806-2866-IDX   PIC S9(08) USAGE COMP    VALUE  2866.
008790     05  WK-806-2867-IDX   PIC S9(08) USAGE COMP    VALUE  2867.
008800     05  WK-806-2868-IDX   PIC S9(08) USAGE COMP    VALUE  2868.
008810     05  WK-806-2869-IDX   PIC S9(08) USAGE COMP    VALUE  2869.
008820     05  WK-806-2870-IDX   PIC S9(08) USAGE COMP    VALUE  2870.
008830     05  WK-806-2871-IDX   PIC S9(08) USAGE COMP    VALUE  2871.
008840     05  WK-806-2872-IDX   PIC S9(08) USAGE COMP    VALUE  2872.
008850     05  WK-806-2873-IDX   PIC S9(08) USAGE COMP    VALUE  2873.
008860     05  WK-806-2874-IDX   PIC S9(08) USAGE COMP    VALUE  2874.
008870     05  WK-806-2875-IDX   PIC S9(08) USAGE COMP    VALUE  2875.
008880     05  WK-806-2876-IDX   PIC S9(08) USAGE COMP    VALUE  2876.
008890     05  WK-806-2877-IDX   PIC S9(08) USAGE COMP    VALUE  2877.
008900     05  WK-806-2878-IDX   PIC S9(08) USAGE COMP    VALUE  2878.
008910     05  WK-806-2879-IDX   PIC S9(08) USAGE COMP    VALUE  2879.
008920     05  WK-806-2880-IDX   PIC S9(08) USAGE COMP    VALUE  2880.
008930     05  WK-806-2881-IDX   PIC S9(08) USAGE COMP    VALUE  2881.
008940     05  WK-806-2882-IDX   PIC S9(08) USAGE COMP    VALUE  2882.
008950     05  WK-806-2883-IDX   PIC S9(08) USAGE COMP    VALUE  2883.
008960     05  WK-806-2884-IDX   PIC S9(08) USAGE COMP    VALUE  2884.
008970     05  WK-806-2885-IDX   PIC S9(08) USAGE COMP    VALUE  2885.
008980     05  WK-806-2886-IDX   PIC S9(08) USAGE COMP    VALUE  2886.
008990     05  WK-806-2887-IDX   PIC S9(08) USAGE COMP    VALUE  2887.
009000     05  WK-806-2888-IDX   PIC S9(08) USAGE COMP    VALUE  2888.
009010     05  WK-806-2889-IDX   PIC S9(08) USAGE COMP    VALUE  2889.
009020     05  WK-806-2890-IDX   PIC S9(08) USAGE COMP    VALUE  2890.
009030     05  WK-806-2891-IDX   PIC S9(08) USAGE COMP    VALUE  2891.
009040     05  WK-806-2892-IDX   PIC S9(08) USAGE COMP    VALUE  2892.
009050     05  WK-806-2893-IDX   PIC S9(08) USAGE COMP    VALUE  2893.
009060     05  WK-806-2894-IDX   PIC S9(08) USAGE COMP    VALUE  2894.
009070     05  WK-806-2895-IDX   PIC S9(08) USAGE COMP    VALUE  2895.
009080     05  WK-806-2896-IDX   PIC S9(08) USAGE COMP    VALUE  2896.
009090     05  WK-806-2897-IDX   PIC S9(08) USAGE COMP    VALUE  2897.
009100     05  WK-806-2898-IDX   PIC S9(08) USAGE COMP    VALUE  2898.
009110     05  WK-806-2899-IDX   PIC S9(08) USAGE COMP    VALUE  2899.
009120     05  WK-806-2900-IDX   PIC S9(08) USAGE COMP    VALUE  2900.
009130     05  WK-806-2901-IDX   PIC S9(08) USAGE COMP    VALUE  2901.
009140     05  WK-806-2902-IDX   PIC S9(08) USAGE COMP    VALUE  2902.
009150     05  WK-806-2903-IDX   PIC S9(08) USAGE COMP    VALUE  2903.
009160     05  WK-806-2904-IDX   PIC S9(08) USAGE COMP    VALUE  2904.
009170     05  WK-806-2905-IDX   PIC S9(08) USAGE COMP    VALUE  2905.
009180     05  WK-806-2906-IDX   PIC S9(08) USAGE COMP    VALUE  2906.
009190     05  WK-806-2907-IDX   PIC S9(08) USAGE COMP    VALUE  2907.
009200     05  WK-806-2908-IDX   PIC S9(08) USAGE COMP    VALUE  2908.
009210     05  WK-806-2909-IDX   PIC S9(08) USAGE COMP    VALUE  2909.
009220     05  WK-806-2910-IDX   PIC S9(08) USAGE COMP    VALUE  2910.
009230     05  WK-806-2911-IDX   PIC S9(08) USAGE COMP    VALUE  2911.
009240     05  WK-806-2912-IDX   PIC S9(08) USAGE COMP    VALUE  2912.
009250     05  WK-806-2913-IDX   PIC S9(08) USAGE COMP    VALUE  2913.
009260     05  WK-806-2914-IDX   PIC S9(08) USAGE COMP    VALUE  2914.
009270     05  WK-806-2915-IDX   PIC S9(08) USAGE COMP    VALUE  2915.
009280     05  WK-806-2916-IDX   PIC S9(08) USAGE COMP    VALUE  2916.
009290     05  WK-806-2917-IDX   PIC S9(08) USAGE COMP    VALUE  2917.
009300     05  WK-806-2918-IDX   PIC S9(08) USAGE COMP    VALUE  2918.
009310     05  WK-806-2919-IDX   PIC S9(08) USAGE COMP    VALUE  2919.
009320     05  WK-806-2920-IDX   PIC S9(08) USAGE COMP    VALUE  2920.
009330     05  WK-806-2921-IDX   PIC S9(08) USAGE COMP    VALUE  2921.
009340     05  WK-806-2922-IDX   PIC S9(08) USAGE COMP    VALUE  2922.
009350     05  WK-806-2923-IDX   PIC S9(08) USAGE COMP    VALUE  2923.
009360     05  WK-806-2924-IDX   PIC S9(08) USAGE COMP    VALUE  2924.
009370     05  WK-806-2925-IDX   PIC S9(08) USAGE COMP    VALUE  2925.
009380     05  WK-806-2926-IDX   PIC S9(08) USAGE COMP    VALUE  2926.
009390     05  WK-806-2927-IDX   PIC S9(08) USAGE COMP    VALUE  2927.
009400     05  WK-806-2928-IDX   PIC S9(08) USAGE COMP    VALUE  2928.
009410     05  WK-806-2929-IDX   PIC S9(08) USAGE COMP    VALUE  2929.
009420     05  WK-806-2930-IDX   PIC S9(08) USAGE COMP    VALUE  2930.
009430     05  WK-806-2931-IDX   PIC S9(08) USAGE COMP    VALUE  2931.
009440     05  WK-806-2932-IDX   PIC S9(08) USAGE COMP    VALUE  2932.
009450     05  WK-806-2933-IDX   PIC S9(08) USAGE COMP    VALUE  2933.
009460     05  WK-806-2934-IDX   PIC S9(08) USAGE COMP    VALUE  2934.
009470     05  WK-806-2935-IDX   PIC S9(08) USAGE COMP    VALUE  2935.
009480     05  WK-806-2936-IDX   PIC S9(08) USAGE COMP    VALUE  2936.
009490     05  WK-806-2937-IDX   PIC S9(08) USAGE COMP    VALUE  2937.
009500     05  WK-806-2938-IDX   PIC S9(08) USAGE COMP    VALUE  2938.
009510     05  WK-806-2939-IDX   PIC S9(08) USAGE COMP    VALUE  2939.
009520     05  WK-806-2940-IDX   PIC S9(08) USAGE COMP    VALUE  2940.
009530     05  WK-806-2941-IDX   PIC S9(08) USAGE COMP    VALUE  2941.
009540     05  WK-806-2942-IDX   PIC S9(08) USAGE COMP    VALUE  2942.
009550     05  WK-806-2943-IDX   PIC S9(08) USAGE COMP    VALUE  2943.
009560     05  WK-806-2944-IDX   PIC S9(08) USAGE COMP    VALUE  2944.
009570     05  WK-806-2945-IDX   PIC S9(08) USAGE COMP    VALUE  2945.
009580     05  WK-806-2946-IDX   PIC S9(08) USAGE COMP    VALUE  2946.
009590     05  WK-806-2947-IDX   PIC S9(08) USAGE COMP    VALUE  2947.
009600     05  WK-806-2948-IDX   PIC S9(08) USAGE COMP    VALUE  2948.
009610     05  WK-806-2949-IDX   PIC S9(08) USAGE COMP    VALUE  2949.
009620     05  WK-806-2950-IDX   PIC S9(08) USAGE COMP    VALUE  2950.
009630     05  WK-806-2951-IDX   PIC S9(08) USAGE COMP    VALUE  2951.
009640     05  WK-806-2952-IDX   PIC S9(08) USAGE COMP    VALUE  2952.
009650     05  WK-806-2953-IDX   PIC S9(08) USAGE COMP    VALUE  2953.
009660     05  WK-806-2954-IDX   PIC S9(08) USAGE COMP    VALUE  2954.
009670     05  WK-806-2955-IDX   PIC S9(08) USAGE COMP    VALUE  2955.
009680     05  WK-806-2956-IDX   PIC S9(08) USAGE COMP    VALUE  2956.
009690     05  WK-806-2957-IDX   PIC S9(08) USAGE COMP    VALUE  2957.
009700     05  WK-806-2958-IDX   PIC S9(08) USAGE COMP    VALUE  2958.
009710     05  WK-806-2959-IDX   PIC S9(08) USAGE COMP    VALUE  2959.
009720     05  WK-806-2960-IDX   PIC S9(08) USAGE COMP    VALUE  2960.
009730     05  WK-806-2961-IDX   PIC S9(08) USAGE COMP    VALUE  2961.
009740     05  WK-806-2962-IDX   PIC S9(08) USAGE COMP    VALUE  2962.
009750     05  WK-806-2963-IDX   PIC S9(08) USAGE COMP    VALUE  2963.
009760     05  WK-806-2964-IDX   PIC S9(08) USAGE COMP    VALUE  2964.
009770     05  WK-806-2965-IDX   PIC S9(08) USAGE COMP    VALUE  2965.
009780     05  WK-806-2966-IDX   PIC S9(08) USAGE COMP    VALUE  2966.
009790     05  WK-806-2967-IDX   PIC S9(08) USAGE COMP    VALUE  2967.
009800     05  WK-806-2968-IDX   PIC S9(08) USAGE COMP    VALUE  2968.
009810     05  WK-806-2969-IDX   PIC S9(08) USAGE COMP    VALUE  2969.
009820     05  WK-806-2970-IDX   PIC S9(08) USAGE COMP    VALUE  2970.
009830     05  WK-806-2971-IDX   PIC S9(08) USAGE COMP    VALUE  2971.
009840     05  WK-806-2972-IDX   PIC S9(08) USAGE COMP    VALUE  2972.
009850     05  WK-806-2973-IDX   PIC S9(08) USAGE COMP    VALUE  2973.
009860     05  WK-806-2974-IDX   PIC S9(08) USAGE COMP    VALUE  2974.
009870     05  WK-806-2975-IDX   PIC S9(08) USAGE COMP    VALUE  2975.
009880     05  WK-806-2976-IDX   PIC S9(08) USAGE COMP    VALUE  2976.
009890     05  WK-806-2977-IDX   PIC S9(08) USAGE COMP    VALUE  2977.
009900     05  WK-806-2978-IDX   PIC S9(08) USAGE COMP    VALUE  2978.
009910     05  WK-806-2979-IDX   PIC S9(08) USAGE COMP    VALUE  2979.
009920     05  WK-806-2980-IDX   PIC S9(08) USAGE COMP    VALUE  2980.
009930     05  WK-806-2981-IDX   PIC S9(08) USAGE COMP    VALUE  2981.
009940     05  WK-806-2982-IDX   PIC S9(08) USAGE COMP    VALUE  2982.
009950     05  WK-806-2983-IDX   PIC S9(08) USAGE COMP    VALUE  2983.
009960     05  WK-806-2984-IDX   PIC S9(08) USAGE COMP    VALUE  2984.
009970     05  WK-806-2985-IDX   PIC S9(08) USAGE COMP    VALUE  2985.
009980     05  WK-806-2986-IDX   PIC S9(08) USAGE COMP    VALUE  2986.
009990     05  WK-806-2987-IDX   PIC S9(08) USAGE COMP    VALUE  2987.
010000     05  WK-806-2988-IDX   PIC S9(08) USAGE COMP    VALUE  2988.
010010     05  WK-806-2989-IDX   PIC S9(08) USAGE COMP    VALUE  2989.
010020     05  WK-806-2990-IDX   PIC S9(08) USAGE COMP    VALUE  2990.
010030     05  WK-806-2991-IDX   PIC S9(08) USAGE COMP    VALUE  2991.
010040     05  WK-806-2992-IDX   PIC S9(08) USAGE COMP    VALUE  2992.
010050     05  WK-806-2993-IDX   PIC S9(08) USAGE COMP    VALUE  2993.
010060     05  WK-806-2994-IDX   PIC S9(08) USAGE COMP    VALUE  2994.
010070     05  WK-806-2995-IDX   PIC S9(08) USAGE COMP    VALUE  2995.
010080     05  WK-806-2996-IDX   PIC S9(08) USAGE COMP    VALUE  2996.
010090     05  WK-806-2997-IDX   PIC S9(08) USAGE COMP    VALUE  2997.
010100     05  WK-806-2998-IDX   PIC S9(08) USAGE COMP    VALUE  2998.
010110     05  WK-806-2999-IDX   PIC S9(08) USAGE COMP    VALUE  2999.
010110     05  WK-806-3000-IDX   PIC S9(08) USAGE COMP    VALUE  3000.
000130     05  WK-806-3001-IDX   PIC S9(08) USAGE COMP    VALUE  3001.
000140     05  WK-806-3002-IDX   PIC S9(08) USAGE COMP    VALUE  3002.
000150     05  WK-806-3003-IDX   PIC S9(08) USAGE COMP    VALUE  3003.
000160     05  WK-806-3004-IDX   PIC S9(08) USAGE COMP    VALUE  3004.
000170     05  WK-806-3005-IDX   PIC S9(08) USAGE COMP    VALUE  3005.
000180     05  WK-806-3006-IDX   PIC S9(08) USAGE COMP    VALUE  3006.
000190     05  WK-806-3007-IDX   PIC S9(08) USAGE COMP    VALUE  3007.
000200     05  WK-806-3008-IDX   PIC S9(08) USAGE COMP    VALUE  3008.
000210     05  WK-806-3009-IDX   PIC S9(08) USAGE COMP    VALUE  3009.
000220     05  WK-806-3010-IDX   PIC S9(08) USAGE COMP    VALUE  3010.
000230     05  WK-806-3011-IDX   PIC S9(08) USAGE COMP    VALUE  3011.
000240     05  WK-806-3012-IDX   PIC S9(08) USAGE COMP    VALUE  3012.
000250     05  WK-806-3013-IDX   PIC S9(08) USAGE COMP    VALUE  3013.
000260     05  WK-806-3014-IDX   PIC S9(08) USAGE COMP    VALUE  3014.
000270     05  WK-806-3015-IDX   PIC S9(08) USAGE COMP    VALUE  3015.
000280     05  WK-806-3016-IDX   PIC S9(08) USAGE COMP    VALUE  3016.
000290     05  WK-806-3017-IDX   PIC S9(08) USAGE COMP    VALUE  3017.
000300     05  WK-806-3018-IDX   PIC S9(08) USAGE COMP    VALUE  3018.
000310     05  WK-806-3019-IDX   PIC S9(08) USAGE COMP    VALUE  3019.
000320     05  WK-806-3020-IDX   PIC S9(08) USAGE COMP    VALUE  3020.
000330     05  WK-806-3021-IDX   PIC S9(08) USAGE COMP    VALUE  3021.
000340     05  WK-806-3022-IDX   PIC S9(08) USAGE COMP    VALUE  3022.
000350     05  WK-806-3023-IDX   PIC S9(08) USAGE COMP    VALUE  3023.
000360     05  WK-806-3024-IDX   PIC S9(08) USAGE COMP    VALUE  3024.
000370     05  WK-806-3025-IDX   PIC S9(08) USAGE COMP    VALUE  3025.
000380     05  WK-806-3026-IDX   PIC S9(08) USAGE COMP    VALUE  3026.
000390     05  WK-806-3027-IDX   PIC S9(08) USAGE COMP    VALUE  3027.
000400     05  WK-806-3028-IDX   PIC S9(08) USAGE COMP    VALUE  3028.
000410     05  WK-806-3029-IDX   PIC S9(08) USAGE COMP    VALUE  3029.
000420     05  WK-806-3030-IDX   PIC S9(08) USAGE COMP    VALUE  3030.
000430     05  WK-806-3031-IDX   PIC S9(08) USAGE COMP    VALUE  3031.
000440     05  WK-806-3032-IDX   PIC S9(08) USAGE COMP    VALUE  3032.
000450     05  WK-806-3033-IDX   PIC S9(08) USAGE COMP    VALUE  3033.
000460     05  WK-806-3034-IDX   PIC S9(08) USAGE COMP    VALUE  3034.
000470     05  WK-806-3035-IDX   PIC S9(08) USAGE COMP    VALUE  3035.
000480     05  WK-806-3036-IDX   PIC S9(08) USAGE COMP    VALUE  3036.
000490     05  WK-806-3037-IDX   PIC S9(08) USAGE COMP    VALUE  3037.
000500     05  WK-806-3038-IDX   PIC S9(08) USAGE COMP    VALUE  3038.
000510     05  WK-806-3039-IDX   PIC S9(08) USAGE COMP    VALUE  3039.
000520     05  WK-806-3040-IDX   PIC S9(08) USAGE COMP    VALUE  3040.
000530     05  WK-806-3041-IDX   PIC S9(08) USAGE COMP    VALUE  3041.
000540     05  WK-806-3042-IDX   PIC S9(08) USAGE COMP    VALUE  3042.
000550     05  WK-806-3043-IDX   PIC S9(08) USAGE COMP    VALUE  3043.
000560     05  WK-806-3044-IDX   PIC S9(08) USAGE COMP    VALUE  3044.
000570     05  WK-806-3045-IDX   PIC S9(08) USAGE COMP    VALUE  3045.
000580     05  WK-806-3046-IDX   PIC S9(08) USAGE COMP    VALUE  3046.
000590     05  WK-806-3047-IDX   PIC S9(08) USAGE COMP    VALUE  3047.
000600     05  WK-806-3048-IDX   PIC S9(08) USAGE COMP    VALUE  3048.
000610     05  WK-806-3049-IDX   PIC S9(08) USAGE COMP    VALUE  3049.
000620     05  WK-806-3050-IDX   PIC S9(08) USAGE COMP    VALUE  3050.
000630     05  WK-806-3051-IDX   PIC S9(08) USAGE COMP    VALUE  3051.
000640     05  WK-806-3052-IDX   PIC S9(08) USAGE COMP    VALUE  3052.
000650     05  WK-806-3053-IDX   PIC S9(08) USAGE COMP    VALUE  3053.
000660     05  WK-806-3054-IDX   PIC S9(08) USAGE COMP    VALUE  3054.
000670     05  WK-806-3055-IDX   PIC S9(08) USAGE COMP    VALUE  3055.
000680     05  WK-806-3056-IDX   PIC S9(08) USAGE COMP    VALUE  3056.
000690     05  WK-806-3057-IDX   PIC S9(08) USAGE COMP    VALUE  3057.
000700     05  WK-806-3058-IDX   PIC S9(08) USAGE COMP    VALUE  3058.
000710     05  WK-806-3059-IDX   PIC S9(08) USAGE COMP    VALUE  3059.
000720     05  WK-806-3060-IDX   PIC S9(08) USAGE COMP    VALUE  3060.
000730     05  WK-806-3061-IDX   PIC S9(08) USAGE COMP    VALUE  3061.
000740     05  WK-806-3062-IDX   PIC S9(08) USAGE COMP    VALUE  3062.
000750     05  WK-806-3063-IDX   PIC S9(08) USAGE COMP    VALUE  3063.
000760     05  WK-806-3064-IDX   PIC S9(08) USAGE COMP    VALUE  3064.
000770     05  WK-806-3065-IDX   PIC S9(08) USAGE COMP    VALUE  3065.
000780     05  WK-806-3066-IDX   PIC S9(08) USAGE COMP    VALUE  3066.
000790     05  WK-806-3067-IDX   PIC S9(08) USAGE COMP    VALUE  3067.
000800     05  WK-806-3068-IDX   PIC S9(08) USAGE COMP    VALUE  3068.
000810     05  WK-806-3069-IDX   PIC S9(08) USAGE COMP    VALUE  3069.
000820     05  WK-806-3070-IDX   PIC S9(08) USAGE COMP    VALUE  3070.
000830     05  WK-806-3071-IDX   PIC S9(08) USAGE COMP    VALUE  3071.
000840     05  WK-806-3072-IDX   PIC S9(08) USAGE COMP    VALUE  3072.
000850     05  WK-806-3073-IDX   PIC S9(08) USAGE COMP    VALUE  3073.
000860     05  WK-806-3074-IDX   PIC S9(08) USAGE COMP    VALUE  3074.
000870     05  WK-806-3075-IDX   PIC S9(08) USAGE COMP    VALUE  3075.
000880     05  WK-806-3076-IDX   PIC S9(08) USAGE COMP    VALUE  3076.
000890     05  WK-806-3077-IDX   PIC S9(08) USAGE COMP    VALUE  3077.
000900     05  WK-806-3078-IDX   PIC S9(08) USAGE COMP    VALUE  3078.
000910     05  WK-806-3079-IDX   PIC S9(08) USAGE COMP    VALUE  3079.
000920     05  WK-806-3080-IDX   PIC S9(08) USAGE COMP    VALUE  3080.
000930     05  WK-806-3081-IDX   PIC S9(08) USAGE COMP    VALUE  3081.
000940     05  WK-806-3082-IDX   PIC S9(08) USAGE COMP    VALUE  3082.
000950     05  WK-806-3083-IDX   PIC S9(08) USAGE COMP    VALUE  3083.
000960     05  WK-806-3084-IDX   PIC S9(08) USAGE COMP    VALUE  3084.
000970     05  WK-806-3085-IDX   PIC S9(08) USAGE COMP    VALUE  3085.
000980     05  WK-806-3086-IDX   PIC S9(08) USAGE COMP    VALUE  3086.
000990     05  WK-806-3087-IDX   PIC S9(08) USAGE COMP    VALUE  3087.
001000     05  WK-806-3088-IDX   PIC S9(08) USAGE COMP    VALUE  3088.
001010     05  WK-806-3089-IDX   PIC S9(08) USAGE COMP    VALUE  3089.
001020     05  WK-806-3090-IDX   PIC S9(08) USAGE COMP    VALUE  3090.
001030     05  WK-806-3091-IDX   PIC S9(08) USAGE COMP    VALUE  3091.
001040     05  WK-806-3092-IDX   PIC S9(08) USAGE COMP    VALUE  3092.
001050     05  WK-806-3093-IDX   PIC S9(08) USAGE COMP    VALUE  3093.
001060     05  WK-806-3094-IDX   PIC S9(08) USAGE COMP    VALUE  3094.
001070     05  WK-806-3095-IDX   PIC S9(08) USAGE COMP    VALUE  3095.
001080     05  WK-806-3096-IDX   PIC S9(08) USAGE COMP    VALUE  3096.
001090     05  WK-806-3097-IDX   PIC S9(08) USAGE COMP    VALUE  3097.
001100     05  WK-806-3098-IDX   PIC S9(08) USAGE COMP    VALUE  3098.
001110     05  WK-806-3099-IDX   PIC S9(08) USAGE COMP    VALUE  3099.
001120     05  WK-806-3100-IDX   PIC S9(08) USAGE COMP    VALUE  3100.
001130     05  WK-806-3101-IDX   PIC S9(08) USAGE COMP    VALUE  3101.
001140     05  WK-806-3102-IDX   PIC S9(08) USAGE COMP    VALUE  3102.
001150     05  WK-806-3103-IDX   PIC S9(08) USAGE COMP    VALUE  3103.
001160     05  WK-806-3104-IDX   PIC S9(08) USAGE COMP    VALUE  3104.
001170     05  WK-806-3105-IDX   PIC S9(08) USAGE COMP    VALUE  3105.
001180     05  WK-806-3106-IDX   PIC S9(08) USAGE COMP    VALUE  3106.
001190     05  WK-806-3107-IDX   PIC S9(08) USAGE COMP    VALUE  3107.
001200     05  WK-806-3108-IDX   PIC S9(08) USAGE COMP    VALUE  3108.
001210     05  WK-806-3109-IDX   PIC S9(08) USAGE COMP    VALUE  3109.
001220     05  WK-806-3110-IDX   PIC S9(08) USAGE COMP    VALUE  3110.
001230     05  WK-806-3111-IDX   PIC S9(08) USAGE COMP    VALUE  3111.
001240     05  WK-806-3112-IDX   PIC S9(08) USAGE COMP    VALUE  3112.
001250     05  WK-806-3113-IDX   PIC S9(08) USAGE COMP    VALUE  3113.
001260     05  WK-806-3114-IDX   PIC S9(08) USAGE COMP    VALUE  3114.
001270     05  WK-806-3115-IDX   PIC S9(08) USAGE COMP    VALUE  3115.
001280     05  WK-806-3116-IDX   PIC S9(08) USAGE COMP    VALUE  3116.
001290     05  WK-806-3117-IDX   PIC S9(08) USAGE COMP    VALUE  3117.
001300     05  WK-806-3118-IDX   PIC S9(08) USAGE COMP    VALUE  3118.
001310     05  WK-806-3119-IDX   PIC S9(08) USAGE COMP    VALUE  3119.
001320     05  WK-806-3120-IDX   PIC S9(08) USAGE COMP    VALUE  3120.
001330     05  WK-806-3121-IDX   PIC S9(08) USAGE COMP    VALUE  3121.
001340     05  WK-806-3122-IDX   PIC S9(08) USAGE COMP    VALUE  3122.
001350     05  WK-806-3123-IDX   PIC S9(08) USAGE COMP    VALUE  3123.
001360     05  WK-806-3124-IDX   PIC S9(08) USAGE COMP    VALUE  3124.
001370     05  WK-806-3125-IDX   PIC S9(08) USAGE COMP    VALUE  3125.
001380     05  WK-806-3126-IDX   PIC S9(08) USAGE COMP    VALUE  3126.
001390     05  WK-806-3127-IDX   PIC S9(08) USAGE COMP    VALUE  3127.
001400     05  WK-806-3128-IDX   PIC S9(08) USAGE COMP    VALUE  3128.
001410     05  WK-806-3129-IDX   PIC S9(08) USAGE COMP    VALUE  3129.
001420     05  WK-806-3130-IDX   PIC S9(08) USAGE COMP    VALUE  3130.
001430     05  WK-806-3131-IDX   PIC S9(08) USAGE COMP    VALUE  3131.
001440     05  WK-806-3132-IDX   PIC S9(08) USAGE COMP    VALUE  3132.
001450     05  WK-806-3133-IDX   PIC S9(08) USAGE COMP    VALUE  3133.
001460     05  WK-806-3134-IDX   PIC S9(08) USAGE COMP    VALUE  3134.
001470     05  WK-806-3135-IDX   PIC S9(08) USAGE COMP    VALUE  3135.
001480     05  WK-806-3136-IDX   PIC S9(08) USAGE COMP    VALUE  3136.
001490     05  WK-806-3137-IDX   PIC S9(08) USAGE COMP    VALUE  3137.
001500     05  WK-806-3138-IDX   PIC S9(08) USAGE COMP    VALUE  3138.
001510     05  WK-806-3139-IDX   PIC S9(08) USAGE COMP    VALUE  3139.
001520     05  WK-806-3140-IDX   PIC S9(08) USAGE COMP    VALUE  3140.
001530     05  WK-806-3141-IDX   PIC S9(08) USAGE COMP    VALUE  3141.
001540     05  WK-806-3142-IDX   PIC S9(08) USAGE COMP    VALUE  3142.
001550     05  WK-806-3143-IDX   PIC S9(08) USAGE COMP    VALUE  3143.
001560     05  WK-806-3144-IDX   PIC S9(08) USAGE COMP    VALUE  3144.
001570     05  WK-806-3145-IDX   PIC S9(08) USAGE COMP    VALUE  3145.
001580     05  WK-806-3146-IDX   PIC S9(08) USAGE COMP    VALUE  3146.
001590     05  WK-806-3147-IDX   PIC S9(08) USAGE COMP    VALUE  3147.
001600     05  WK-806-3148-IDX   PIC S9(08) USAGE COMP    VALUE  3148.
001610     05  WK-806-3149-IDX   PIC S9(08) USAGE COMP    VALUE  3149.
001620     05  WK-806-3150-IDX   PIC S9(08) USAGE COMP    VALUE  3150.
001630     05  WK-806-3151-IDX   PIC S9(08) USAGE COMP    VALUE  3151.
001640     05  WK-806-3152-IDX   PIC S9(08) USAGE COMP    VALUE  3152.
001650     05  WK-806-3153-IDX   PIC S9(08) USAGE COMP    VALUE  3153.
001660     05  WK-806-3154-IDX   PIC S9(08) USAGE COMP    VALUE  3154.
001670     05  WK-806-3155-IDX   PIC S9(08) USAGE COMP    VALUE  3155.
001680     05  WK-806-3156-IDX   PIC S9(08) USAGE COMP    VALUE  3156.
001690     05  WK-806-3157-IDX   PIC S9(08) USAGE COMP    VALUE  3157.
001700     05  WK-806-3158-IDX   PIC S9(08) USAGE COMP    VALUE  3158.
001710     05  WK-806-3159-IDX   PIC S9(08) USAGE COMP    VALUE  3159.
001720     05  WK-806-3160-IDX   PIC S9(08) USAGE COMP    VALUE  3160.
001730     05  WK-806-3161-IDX   PIC S9(08) USAGE COMP    VALUE  3161.
001740     05  WK-806-3162-IDX   PIC S9(08) USAGE COMP    VALUE  3162.
001750     05  WK-806-3163-IDX   PIC S9(08) USAGE COMP    VALUE  3163.
001760     05  WK-806-3164-IDX   PIC S9(08) USAGE COMP    VALUE  3164.
001770     05  WK-806-3165-IDX   PIC S9(08) USAGE COMP    VALUE  3165.
001780     05  WK-806-3166-IDX   PIC S9(08) USAGE COMP    VALUE  3166.
001790     05  WK-806-3167-IDX   PIC S9(08) USAGE COMP    VALUE  3167.
001800     05  WK-806-3168-IDX   PIC S9(08) USAGE COMP    VALUE  3168.
001810     05  WK-806-3169-IDX   PIC S9(08) USAGE COMP    VALUE  3169.
001820     05  WK-806-3170-IDX   PIC S9(08) USAGE COMP    VALUE  3170.
001830     05  WK-806-3171-IDX   PIC S9(08) USAGE COMP    VALUE  3171.
001840     05  WK-806-3172-IDX   PIC S9(08) USAGE COMP    VALUE  3172.
001850     05  WK-806-3173-IDX   PIC S9(08) USAGE COMP    VALUE  3173.
001860     05  WK-806-3174-IDX   PIC S9(08) USAGE COMP    VALUE  3174.
001870     05  WK-806-3175-IDX   PIC S9(08) USAGE COMP    VALUE  3175.
001880     05  WK-806-3176-IDX   PIC S9(08) USAGE COMP    VALUE  3176.
001890     05  WK-806-3177-IDX   PIC S9(08) USAGE COMP    VALUE  3177.
001900     05  WK-806-3178-IDX   PIC S9(08) USAGE COMP    VALUE  3178.
001910     05  WK-806-3179-IDX   PIC S9(08) USAGE COMP    VALUE  3179.
001920     05  WK-806-3180-IDX   PIC S9(08) USAGE COMP    VALUE  3180.
001930     05  WK-806-3181-IDX   PIC S9(08) USAGE COMP    VALUE  3181.
001940     05  WK-806-3182-IDX   PIC S9(08) USAGE COMP    VALUE  3182.
001950     05  WK-806-3183-IDX   PIC S9(08) USAGE COMP    VALUE  3183.
001960     05  WK-806-3184-IDX   PIC S9(08) USAGE COMP    VALUE  3184.
001970     05  WK-806-3185-IDX   PIC S9(08) USAGE COMP    VALUE  3185.
001980     05  WK-806-3186-IDX   PIC S9(08) USAGE COMP    VALUE  3186.
001990     05  WK-806-3187-IDX   PIC S9(08) USAGE COMP    VALUE  3187.
002000     05  WK-806-3188-IDX   PIC S9(08) USAGE COMP    VALUE  3188.
002010     05  WK-806-3189-IDX   PIC S9(08) USAGE COMP    VALUE  3189.
002020     05  WK-806-3190-IDX   PIC S9(08) USAGE COMP    VALUE  3190.
002030     05  WK-806-3191-IDX   PIC S9(08) USAGE COMP    VALUE  3191.
002040     05  WK-806-3192-IDX   PIC S9(08) USAGE COMP    VALUE  3192.
002050     05  WK-806-3193-IDX   PIC S9(08) USAGE COMP    VALUE  3193.
002060     05  WK-806-3194-IDX   PIC S9(08) USAGE COMP    VALUE  3194.
002070     05  WK-806-3195-IDX   PIC S9(08) USAGE COMP    VALUE  3195.
002080     05  WK-806-3196-IDX   PIC S9(08) USAGE COMP    VALUE  3196.
002090     05  WK-806-3197-IDX   PIC S9(08) USAGE COMP    VALUE  3197.
002100     05  WK-806-3198-IDX   PIC S9(08) USAGE COMP    VALUE  3198.
002110     05  WK-806-3199-IDX   PIC S9(08) USAGE COMP    VALUE  3199.
002120     05  WK-806-3200-IDX   PIC S9(08) USAGE COMP    VALUE  3200.
002130     05  WK-806-3201-IDX   PIC S9(08) USAGE COMP    VALUE  3201.
002140     05  WK-806-3202-IDX   PIC S9(08) USAGE COMP    VALUE  3202.
002150     05  WK-806-3203-IDX   PIC S9(08) USAGE COMP    VALUE  3203.
002160     05  WK-806-3204-IDX   PIC S9(08) USAGE COMP    VALUE  3204.
002170     05  WK-806-3205-IDX   PIC S9(08) USAGE COMP    VALUE  3205.
002180     05  WK-806-3206-IDX   PIC S9(08) USAGE COMP    VALUE  3206.
002190     05  WK-806-3207-IDX   PIC S9(08) USAGE COMP    VALUE  3207.
002200     05  WK-806-3208-IDX   PIC S9(08) USAGE COMP    VALUE  3208.
002210     05  WK-806-3209-IDX   PIC S9(08) USAGE COMP    VALUE  3209.
002220     05  WK-806-3210-IDX   PIC S9(08) USAGE COMP    VALUE  3210.
002230     05  WK-806-3211-IDX   PIC S9(08) USAGE COMP    VALUE  3211.
002240     05  WK-806-3212-IDX   PIC S9(08) USAGE COMP    VALUE  3212.
002250     05  WK-806-3213-IDX   PIC S9(08) USAGE COMP    VALUE  3213.
002260     05  WK-806-3214-IDX   PIC S9(08) USAGE COMP    VALUE  3214.
002270     05  WK-806-3215-IDX   PIC S9(08) USAGE COMP    VALUE  3215.
002280     05  WK-806-3216-IDX   PIC S9(08) USAGE COMP    VALUE  3216.
002290     05  WK-806-3217-IDX   PIC S9(08) USAGE COMP    VALUE  3217.
002300     05  WK-806-3218-IDX   PIC S9(08) USAGE COMP    VALUE  3218.
002310     05  WK-806-3219-IDX   PIC S9(08) USAGE COMP    VALUE  3219.
002320     05  WK-806-3220-IDX   PIC S9(08) USAGE COMP    VALUE  3220.
002330     05  WK-806-3221-IDX   PIC S9(08) USAGE COMP    VALUE  3221.
002340     05  WK-806-3222-IDX   PIC S9(08) USAGE COMP    VALUE  3222.
002350     05  WK-806-3223-IDX   PIC S9(08) USAGE COMP    VALUE  3223.
002360     05  WK-806-3224-IDX   PIC S9(08) USAGE COMP    VALUE  3224.
002370     05  WK-806-3225-IDX   PIC S9(08) USAGE COMP    VALUE  3225.
002380     05  WK-806-3226-IDX   PIC S9(08) USAGE COMP    VALUE  3226.
002390     05  WK-806-3227-IDX   PIC S9(08) USAGE COMP    VALUE  3227.
002400     05  WK-806-3228-IDX   PIC S9(08) USAGE COMP    VALUE  3228.
002410     05  WK-806-3229-IDX   PIC S9(08) USAGE COMP    VALUE  3229.
002420     05  WK-806-3230-IDX   PIC S9(08) USAGE COMP    VALUE  3230.
002430     05  WK-806-3231-IDX   PIC S9(08) USAGE COMP    VALUE  3231.
002440     05  WK-806-3232-IDX   PIC S9(08) USAGE COMP    VALUE  3232.
002450     05  WK-806-3233-IDX   PIC S9(08) USAGE COMP    VALUE  3233.
002460     05  WK-806-3234-IDX   PIC S9(08) USAGE COMP    VALUE  3234.
002470     05  WK-806-3235-IDX   PIC S9(08) USAGE COMP    VALUE  3235.
002480     05  WK-806-3236-IDX   PIC S9(08) USAGE COMP    VALUE  3236.
002490     05  WK-806-3237-IDX   PIC S9(08) USAGE COMP    VALUE  3237.
002500     05  WK-806-3238-IDX   PIC S9(08) USAGE COMP    VALUE  3238.
002510     05  WK-806-3239-IDX   PIC S9(08) USAGE COMP    VALUE  3239.
002520     05  WK-806-3240-IDX   PIC S9(08) USAGE COMP    VALUE  3240.
002530     05  WK-806-3241-IDX   PIC S9(08) USAGE COMP    VALUE  3241.
002540     05  WK-806-3242-IDX   PIC S9(08) USAGE COMP    VALUE  3242.
002550     05  WK-806-3243-IDX   PIC S9(08) USAGE COMP    VALUE  3243.
002560     05  WK-806-3244-IDX   PIC S9(08) USAGE COMP    VALUE  3244.
002570     05  WK-806-3245-IDX   PIC S9(08) USAGE COMP    VALUE  3245.
002580     05  WK-806-3246-IDX   PIC S9(08) USAGE COMP    VALUE  3246.
002590     05  WK-806-3247-IDX   PIC S9(08) USAGE COMP    VALUE  3247.
002600     05  WK-806-3248-IDX   PIC S9(08) USAGE COMP    VALUE  3248.
002610     05  WK-806-3249-IDX   PIC S9(08) USAGE COMP    VALUE  3249.
002620     05  WK-806-3250-IDX   PIC S9(08) USAGE COMP    VALUE  3250.
002630     05  WK-806-3251-IDX   PIC S9(08) USAGE COMP    VALUE  3251.
002640     05  WK-806-3252-IDX   PIC S9(08) USAGE COMP    VALUE  3252.
002650     05  WK-806-3253-IDX   PIC S9(08) USAGE COMP    VALUE  3253.
002660     05  WK-806-3254-IDX   PIC S9(08) USAGE COMP    VALUE  3254.
002670     05  WK-806-3255-IDX   PIC S9(08) USAGE COMP    VALUE  3255.
002680     05  WK-806-3256-IDX   PIC S9(08) USAGE COMP    VALUE  3256.
002690     05  WK-806-3257-IDX   PIC S9(08) USAGE COMP    VALUE  3257.
002700     05  WK-806-3258-IDX   PIC S9(08) USAGE COMP    VALUE  3258.
002710     05  WK-806-3259-IDX   PIC S9(08) USAGE COMP    VALUE  3259.
002720     05  WK-806-3260-IDX   PIC S9(08) USAGE COMP    VALUE  3260.
002730     05  WK-806-3261-IDX   PIC S9(08) USAGE COMP    VALUE  3261.
002740     05  WK-806-3262-IDX   PIC S9(08) USAGE COMP    VALUE  3262.
002750     05  WK-806-3263-IDX   PIC S9(08) USAGE COMP    VALUE  3263.
002760     05  WK-806-3264-IDX   PIC S9(08) USAGE COMP    VALUE  3264.
002770     05  WK-806-3265-IDX   PIC S9(08) USAGE COMP    VALUE  3265.
002780     05  WK-806-3266-IDX   PIC S9(08) USAGE COMP    VALUE  3266.
002790     05  WK-806-3267-IDX   PIC S9(08) USAGE COMP    VALUE  3267.
002800     05  WK-806-3268-IDX   PIC S9(08) USAGE COMP    VALUE  3268.
002810     05  WK-806-3269-IDX   PIC S9(08) USAGE COMP    VALUE  3269.
002820     05  WK-806-3270-IDX   PIC S9(08) USAGE COMP    VALUE  3270.
002830     05  WK-806-3271-IDX   PIC S9(08) USAGE COMP    VALUE  3271.
002840     05  WK-806-3272-IDX   PIC S9(08) USAGE COMP    VALUE  3272.
002850     05  WK-806-3273-IDX   PIC S9(08) USAGE COMP    VALUE  3273.
002860     05  WK-806-3274-IDX   PIC S9(08) USAGE COMP    VALUE  3274.
002870     05  WK-806-3275-IDX   PIC S9(08) USAGE COMP    VALUE  3275.
002880     05  WK-806-3276-IDX   PIC S9(08) USAGE COMP    VALUE  3276.
002890     05  WK-806-3277-IDX   PIC S9(08) USAGE COMP    VALUE  3277.
002900     05  WK-806-3278-IDX   PIC S9(08) USAGE COMP    VALUE  3278.
002910     05  WK-806-3279-IDX   PIC S9(08) USAGE COMP    VALUE  3279.
002920     05  WK-806-3280-IDX   PIC S9(08) USAGE COMP    VALUE  3280.
002930     05  WK-806-3281-IDX   PIC S9(08) USAGE COMP    VALUE  3281.
002940     05  WK-806-3282-IDX   PIC S9(08) USAGE COMP    VALUE  3282.
002950     05  WK-806-3283-IDX   PIC S9(08) USAGE COMP    VALUE  3283.
002960     05  WK-806-3284-IDX   PIC S9(08) USAGE COMP    VALUE  3284.
002970     05  WK-806-3285-IDX   PIC S9(08) USAGE COMP    VALUE  3285.
002980     05  WK-806-3286-IDX   PIC S9(08) USAGE COMP    VALUE  3286.
002990     05  WK-806-3287-IDX   PIC S9(08) USAGE COMP    VALUE  3287.
003000     05  WK-806-3288-IDX   PIC S9(08) USAGE COMP    VALUE  3288.
003010     05  WK-806-3289-IDX   PIC S9(08) USAGE COMP    VALUE  3289.
003020     05  WK-806-3290-IDX   PIC S9(08) USAGE COMP    VALUE  3290.
003030     05  WK-806-3291-IDX   PIC S9(08) USAGE COMP    VALUE  3291.
003040     05  WK-806-3292-IDX   PIC S9(08) USAGE COMP    VALUE  3292.
003050     05  WK-806-3293-IDX   PIC S9(08) USAGE COMP    VALUE  3293.
003060     05  WK-806-3294-IDX   PIC S9(08) USAGE COMP    VALUE  3294.
003070     05  WK-806-3295-IDX   PIC S9(08) USAGE COMP    VALUE  3295.
003080     05  WK-806-3296-IDX   PIC S9(08) USAGE COMP    VALUE  3296.
003090     05  WK-806-3297-IDX   PIC S9(08) USAGE COMP    VALUE  3297.
003100     05  WK-806-3298-IDX   PIC S9(08) USAGE COMP    VALUE  3298.
003110     05  WK-806-3299-IDX   PIC S9(08) USAGE COMP    VALUE  3299.
003120     05  WK-806-3300-IDX   PIC S9(08) USAGE COMP    VALUE  3300.
003130     05  WK-806-3301-IDX   PIC S9(08) USAGE COMP    VALUE  3301.
003140     05  WK-806-3302-IDX   PIC S9(08) USAGE COMP    VALUE  3302.
003150     05  WK-806-3303-IDX   PIC S9(08) USAGE COMP    VALUE  3303.
003160     05  WK-806-3304-IDX   PIC S9(08) USAGE COMP    VALUE  3304.
003170     05  WK-806-3305-IDX   PIC S9(08) USAGE COMP    VALUE  3305.
003180     05  WK-806-3306-IDX   PIC S9(08) USAGE COMP    VALUE  3306.
003190     05  WK-806-3307-IDX   PIC S9(08) USAGE COMP    VALUE  3307.
003200     05  WK-806-3308-IDX   PIC S9(08) USAGE COMP    VALUE  3308.
003210     05  WK-806-3309-IDX   PIC S9(08) USAGE COMP    VALUE  3309.
003220     05  WK-806-3310-IDX   PIC S9(08) USAGE COMP    VALUE  3310.
003230     05  WK-806-3311-IDX   PIC S9(08) USAGE COMP    VALUE  3311.
003240     05  WK-806-3312-IDX   PIC S9(08) USAGE COMP    VALUE  3312.
003250     05  WK-806-3313-IDX   PIC S9(08) USAGE COMP    VALUE  3313.
003260     05  WK-806-3314-IDX   PIC S9(08) USAGE COMP    VALUE  3314.
003270     05  WK-806-3315-IDX   PIC S9(08) USAGE COMP    VALUE  3315.
003280     05  WK-806-3316-IDX   PIC S9(08) USAGE COMP    VALUE  3316.
003290     05  WK-806-3317-IDX   PIC S9(08) USAGE COMP    VALUE  3317.
003300     05  WK-806-3318-IDX   PIC S9(08) USAGE COMP    VALUE  3318.
003310     05  WK-806-3319-IDX   PIC S9(08) USAGE COMP    VALUE  3319.
003320     05  WK-806-3320-IDX   PIC S9(08) USAGE COMP    VALUE  3320.
003330     05  WK-806-3321-IDX   PIC S9(08) USAGE COMP    VALUE  3321.
003340     05  WK-806-3322-IDX   PIC S9(08) USAGE COMP    VALUE  3322.
003350     05  WK-806-3323-IDX   PIC S9(08) USAGE COMP    VALUE  3323.
003360     05  WK-806-3324-IDX   PIC S9(08) USAGE COMP    VALUE  3324.
003370     05  WK-806-3325-IDX   PIC S9(08) USAGE COMP    VALUE  3325.
003380     05  WK-806-3326-IDX   PIC S9(08) USAGE COMP    VALUE  3326.
003390     05  WK-806-3327-IDX   PIC S9(08) USAGE COMP    VALUE  3327.
003400     05  WK-806-3328-IDX   PIC S9(08) USAGE COMP    VALUE  3328.
003410     05  WK-806-3329-IDX   PIC S9(08) USAGE COMP    VALUE  3329.
003420     05  WK-806-3330-IDX   PIC S9(08) USAGE COMP    VALUE  3330.
003430     05  WK-806-3331-IDX   PIC S9(08) USAGE COMP    VALUE  3331.
003440     05  WK-806-3332-IDX   PIC S9(08) USAGE COMP    VALUE  3332.
003450     05  WK-806-3333-IDX   PIC S9(08) USAGE COMP    VALUE  3333.
003460     05  WK-806-3334-IDX   PIC S9(08) USAGE COMP    VALUE  3334.
003470     05  WK-806-3335-IDX   PIC S9(08) USAGE COMP    VALUE  3335.
003480     05  WK-806-3336-IDX   PIC S9(08) USAGE COMP    VALUE  3336.
003490     05  WK-806-3337-IDX   PIC S9(08) USAGE COMP    VALUE  3337.
003500     05  WK-806-3338-IDX   PIC S9(08) USAGE COMP    VALUE  3338.
003510     05  WK-806-3339-IDX   PIC S9(08) USAGE COMP    VALUE  3339.
003520     05  WK-806-3340-IDX   PIC S9(08) USAGE COMP    VALUE  3340.
003530     05  WK-806-3341-IDX   PIC S9(08) USAGE COMP    VALUE  3341.
003540     05  WK-806-3342-IDX   PIC S9(08) USAGE COMP    VALUE  3342.
003550     05  WK-806-3343-IDX   PIC S9(08) USAGE COMP    VALUE  3343.
003560     05  WK-806-3344-IDX   PIC S9(08) USAGE COMP    VALUE  3344.
003570     05  WK-806-3345-IDX   PIC S9(08) USAGE COMP    VALUE  3345.
003580     05  WK-806-3346-IDX   PIC S9(08) USAGE COMP    VALUE  3346.
003590     05  WK-806-3347-IDX   PIC S9(08) USAGE COMP    VALUE  3347.
003600     05  WK-806-3348-IDX   PIC S9(08) USAGE COMP    VALUE  3348.
003610     05  WK-806-3349-IDX   PIC S9(08) USAGE COMP    VALUE  3349.
003620     05  WK-806-3350-IDX   PIC S9(08) USAGE COMP    VALUE  3350.
003630     05  WK-806-3351-IDX   PIC S9(08) USAGE COMP    VALUE  3351.
003640     05  WK-806-3352-IDX   PIC S9(08) USAGE COMP    VALUE  3352.
003650     05  WK-806-3353-IDX   PIC S9(08) USAGE COMP    VALUE  3353.
003660     05  WK-806-3354-IDX   PIC S9(08) USAGE COMP    VALUE  3354.
003670     05  WK-806-3355-IDX   PIC S9(08) USAGE COMP    VALUE  3355.
003680     05  WK-806-3356-IDX   PIC S9(08) USAGE COMP    VALUE  3356.
003690     05  WK-806-3357-IDX   PIC S9(08) USAGE COMP    VALUE  3357.
003700     05  WK-806-3358-IDX   PIC S9(08) USAGE COMP    VALUE  3358.
003710     05  WK-806-3359-IDX   PIC S9(08) USAGE COMP    VALUE  3359.
003720     05  WK-806-3360-IDX   PIC S9(08) USAGE COMP    VALUE  3360.
003730     05  WK-806-3361-IDX   PIC S9(08) USAGE COMP    VALUE  3361.
003740     05  WK-806-3362-IDX   PIC S9(08) USAGE COMP    VALUE  3362.
003750     05  WK-806-3363-IDX   PIC S9(08) USAGE COMP    VALUE  3363.
003760     05  WK-806-3364-IDX   PIC S9(08) USAGE COMP    VALUE  3364.
003770     05  WK-806-3365-IDX   PIC S9(08) USAGE COMP    VALUE  3365.
003780     05  WK-806-3366-IDX   PIC S9(08) USAGE COMP    VALUE  3366.
003790     05  WK-806-3367-IDX   PIC S9(08) USAGE COMP    VALUE  3367.
003800     05  WK-806-3368-IDX   PIC S9(08) USAGE COMP    VALUE  3368.
003810     05  WK-806-3369-IDX   PIC S9(08) USAGE COMP    VALUE  3369.
003820     05  WK-806-3370-IDX   PIC S9(08) USAGE COMP    VALUE  3370.
003830     05  WK-806-3371-IDX   PIC S9(08) USAGE COMP    VALUE  3371.
003840     05  WK-806-3372-IDX   PIC S9(08) USAGE COMP    VALUE  3372.
003850     05  WK-806-3373-IDX   PIC S9(08) USAGE COMP    VALUE  3373.
003860     05  WK-806-3374-IDX   PIC S9(08) USAGE COMP    VALUE  3374.
003870     05  WK-806-3375-IDX   PIC S9(08) USAGE COMP    VALUE  3375.
003880     05  WK-806-3376-IDX   PIC S9(08) USAGE COMP    VALUE  3376.
003890     05  WK-806-3377-IDX   PIC S9(08) USAGE COMP    VALUE  3377.
003900     05  WK-806-3378-IDX   PIC S9(08) USAGE COMP    VALUE  3378.
003910     05  WK-806-3379-IDX   PIC S9(08) USAGE COMP    VALUE  3379.
003920     05  WK-806-3380-IDX   PIC S9(08) USAGE COMP    VALUE  3380.
003930     05  WK-806-3381-IDX   PIC S9(08) USAGE COMP    VALUE  3381.
003940     05  WK-806-3382-IDX   PIC S9(08) USAGE COMP    VALUE  3382.
003950     05  WK-806-3383-IDX   PIC S9(08) USAGE COMP    VALUE  3383.
003960     05  WK-806-3384-IDX   PIC S9(08) USAGE COMP    VALUE  3384.
003970     05  WK-806-3385-IDX   PIC S9(08) USAGE COMP    VALUE  3385.
003980     05  WK-806-3386-IDX   PIC S9(08) USAGE COMP    VALUE  3386.
003990     05  WK-806-3387-IDX   PIC S9(08) USAGE COMP    VALUE  3387.
004000     05  WK-806-3388-IDX   PIC S9(08) USAGE COMP    VALUE  3388.
004010     05  WK-806-3389-IDX   PIC S9(08) USAGE COMP    VALUE  3389.
004020     05  WK-806-3390-IDX   PIC S9(08) USAGE COMP    VALUE  3390.
004030     05  WK-806-3391-IDX   PIC S9(08) USAGE COMP    VALUE  3391.
004040     05  WK-806-3392-IDX   PIC S9(08) USAGE COMP    VALUE  3392.
004050     05  WK-806-3393-IDX   PIC S9(08) USAGE COMP    VALUE  3393.
004060     05  WK-806-3394-IDX   PIC S9(08) USAGE COMP    VALUE  3394.
004070     05  WK-806-3395-IDX   PIC S9(08) USAGE COMP    VALUE  3395.
004080     05  WK-806-3396-IDX   PIC S9(08) USAGE COMP    VALUE  3396.
004090     05  WK-806-3397-IDX   PIC S9(08) USAGE COMP    VALUE  3397.
004100     05  WK-806-3398-IDX   PIC S9(08) USAGE COMP    VALUE  3398.
004110     05  WK-806-3399-IDX   PIC S9(08) USAGE COMP    VALUE  3399.
004120     05  WK-806-3400-IDX   PIC S9(08) USAGE COMP    VALUE  3400.
004130     05  WK-806-3401-IDX   PIC S9(08) USAGE COMP    VALUE  3401.
004140     05  WK-806-3402-IDX   PIC S9(08) USAGE COMP    VALUE  3402.
004150     05  WK-806-3403-IDX   PIC S9(08) USAGE COMP    VALUE  3403.
004160     05  WK-806-3404-IDX   PIC S9(08) USAGE COMP    VALUE  3404.
004170     05  WK-806-3405-IDX   PIC S9(08) USAGE COMP    VALUE  3405.
004180     05  WK-806-3406-IDX   PIC S9(08) USAGE COMP    VALUE  3406.
004190     05  WK-806-3407-IDX   PIC S9(08) USAGE COMP    VALUE  3407.
004200     05  WK-806-3408-IDX   PIC S9(08) USAGE COMP    VALUE  3408.
004210     05  WK-806-3409-IDX   PIC S9(08) USAGE COMP    VALUE  3409.
004220     05  WK-806-3410-IDX   PIC S9(08) USAGE COMP    VALUE  3410.
004230     05  WK-806-3411-IDX   PIC S9(08) USAGE COMP    VALUE  3411.
004240     05  WK-806-3412-IDX   PIC S9(08) USAGE COMP    VALUE  3412.
004250     05  WK-806-3413-IDX   PIC S9(08) USAGE COMP    VALUE  3413.
004260     05  WK-806-3414-IDX   PIC S9(08) USAGE COMP    VALUE  3414.
004270     05  WK-806-3415-IDX   PIC S9(08) USAGE COMP    VALUE  3415.
004280     05  WK-806-3416-IDX   PIC S9(08) USAGE COMP    VALUE  3416.
004290     05  WK-806-3417-IDX   PIC S9(08) USAGE COMP    VALUE  3417.
004300     05  WK-806-3418-IDX   PIC S9(08) USAGE COMP    VALUE  3418.
004310     05  WK-806-3419-IDX   PIC S9(08) USAGE COMP    VALUE  3419.
004320     05  WK-806-3420-IDX   PIC S9(08) USAGE COMP    VALUE  3420.
004330     05  WK-806-3421-IDX   PIC S9(08) USAGE COMP    VALUE  3421.
004340     05  WK-806-3422-IDX   PIC S9(08) USAGE COMP    VALUE  3422.
004350     05  WK-806-3423-IDX   PIC S9(08) USAGE COMP    VALUE  3423.
004360     05  WK-806-3424-IDX   PIC S9(08) USAGE COMP    VALUE  3424.
004370     05  WK-806-3425-IDX   PIC S9(08) USAGE COMP    VALUE  3425.
004380     05  WK-806-3426-IDX   PIC S9(08) USAGE COMP    VALUE  3426.
004390     05  WK-806-3427-IDX   PIC S9(08) USAGE COMP    VALUE  3427.
004400     05  WK-806-3428-IDX   PIC S9(08) USAGE COMP    VALUE  3428.
004410     05  WK-806-3429-IDX   PIC S9(08) USAGE COMP    VALUE  3429.
004420     05  WK-806-3430-IDX   PIC S9(08) USAGE COMP    VALUE  3430.
004430     05  WK-806-3431-IDX   PIC S9(08) USAGE COMP    VALUE  3431.
004440     05  WK-806-3432-IDX   PIC S9(08) USAGE COMP    VALUE  3432.
004450     05  WK-806-3433-IDX   PIC S9(08) USAGE COMP    VALUE  3433.
004460     05  WK-806-3434-IDX   PIC S9(08) USAGE COMP    VALUE  3434.
004470     05  WK-806-3435-IDX   PIC S9(08) USAGE COMP    VALUE  3435.
004480     05  WK-806-3436-IDX   PIC S9(08) USAGE COMP    VALUE  3436.
004490     05  WK-806-3437-IDX   PIC S9(08) USAGE COMP    VALUE  3437.
004500     05  WK-806-3438-IDX   PIC S9(08) USAGE COMP    VALUE  3438.
004510     05  WK-806-3439-IDX   PIC S9(08) USAGE COMP    VALUE  3439.
004520     05  WK-806-3440-IDX   PIC S9(08) USAGE COMP    VALUE  3440.
004530     05  WK-806-3441-IDX   PIC S9(08) USAGE COMP    VALUE  3441.
004540     05  WK-806-3442-IDX   PIC S9(08) USAGE COMP    VALUE  3442.
004550     05  WK-806-3443-IDX   PIC S9(08) USAGE COMP    VALUE  3443.
004560     05  WK-806-3444-IDX   PIC S9(08) USAGE COMP    VALUE  3444.
004570     05  WK-806-3445-IDX   PIC S9(08) USAGE COMP    VALUE  3445.
004580     05  WK-806-3446-IDX   PIC S9(08) USAGE COMP    VALUE  3446.
004590     05  WK-806-3447-IDX   PIC S9(08) USAGE COMP    VALUE  3447.
004600     05  WK-806-3448-IDX   PIC S9(08) USAGE COMP    VALUE  3448.
004610     05  WK-806-3449-IDX   PIC S9(08) USAGE COMP    VALUE  3449.
004620     05  WK-806-3450-IDX   PIC S9(08) USAGE COMP    VALUE  3450.
004630     05  WK-806-3451-IDX   PIC S9(08) USAGE COMP    VALUE  3451.
004640     05  WK-806-3452-IDX   PIC S9(08) USAGE COMP    VALUE  3452.
004650     05  WK-806-3453-IDX   PIC S9(08) USAGE COMP    VALUE  3453.
004660     05  WK-806-3454-IDX   PIC S9(08) USAGE COMP    VALUE  3454.
004670     05  WK-806-3455-IDX   PIC S9(08) USAGE COMP    VALUE  3455.
004680     05  WK-806-3456-IDX   PIC S9(08) USAGE COMP    VALUE  3456.
004690     05  WK-806-3457-IDX   PIC S9(08) USAGE COMP    VALUE  3457.
004700     05  WK-806-3458-IDX   PIC S9(08) USAGE COMP    VALUE  3458.
004710     05  WK-806-3459-IDX   PIC S9(08) USAGE COMP    VALUE  3459.
004720     05  WK-806-3460-IDX   PIC S9(08) USAGE COMP    VALUE  3460.
004730     05  WK-806-3461-IDX   PIC S9(08) USAGE COMP    VALUE  3461.
004740     05  WK-806-3462-IDX   PIC S9(08) USAGE COMP    VALUE  3462.
004750     05  WK-806-3463-IDX   PIC S9(08) USAGE COMP    VALUE  3463.
004760     05  WK-806-3464-IDX   PIC S9(08) USAGE COMP    VALUE  3464.
004770     05  WK-806-3465-IDX   PIC S9(08) USAGE COMP    VALUE  3465.
004780     05  WK-806-3466-IDX   PIC S9(08) USAGE COMP    VALUE  3466.
004790     05  WK-806-3467-IDX   PIC S9(08) USAGE COMP    VALUE  3467.
004800     05  WK-806-3468-IDX   PIC S9(08) USAGE COMP    VALUE  3468.
004810     05  WK-806-3469-IDX   PIC S9(08) USAGE COMP    VALUE  3469.
004820     05  WK-806-3470-IDX   PIC S9(08) USAGE COMP    VALUE  3470.
004830     05  WK-806-3471-IDX   PIC S9(08) USAGE COMP    VALUE  3471.
004840     05  WK-806-3472-IDX   PIC S9(08) USAGE COMP    VALUE  3472.
004850     05  WK-806-3473-IDX   PIC S9(08) USAGE COMP    VALUE  3473.
004860     05  WK-806-3474-IDX   PIC S9(08) USAGE COMP    VALUE  3474.
004870     05  WK-806-3475-IDX   PIC S9(08) USAGE COMP    VALUE  3475.
004880     05  WK-806-3476-IDX   PIC S9(08) USAGE COMP    VALUE  3476.
004890     05  WK-806-3477-IDX   PIC S9(08) USAGE COMP    VALUE  3477.
004900     05  WK-806-3478-IDX   PIC S9(08) USAGE COMP    VALUE  3478.
004910     05  WK-806-3479-IDX   PIC S9(08) USAGE COMP    VALUE  3479.
004920     05  WK-806-3480-IDX   PIC S9(08) USAGE COMP    VALUE  3480.
004930     05  WK-806-3481-IDX   PIC S9(08) USAGE COMP    VALUE  3481.
004940     05  WK-806-3482-IDX   PIC S9(08) USAGE COMP    VALUE  3482.
004950     05  WK-806-3483-IDX   PIC S9(08) USAGE COMP    VALUE  3483.
004960     05  WK-806-3484-IDX   PIC S9(08) USAGE COMP    VALUE  3484.
004970     05  WK-806-3485-IDX   PIC S9(08) USAGE COMP    VALUE  3485.
004980     05  WK-806-3486-IDX   PIC S9(08) USAGE COMP    VALUE  3486.
004990     05  WK-806-3487-IDX   PIC S9(08) USAGE COMP    VALUE  3487.
005000     05  WK-806-3488-IDX   PIC S9(08) USAGE COMP    VALUE  3488.
005010     05  WK-806-3489-IDX   PIC S9(08) USAGE COMP    VALUE  3489.
005020     05  WK-806-3490-IDX   PIC S9(08) USAGE COMP    VALUE  3490.
005030     05  WK-806-3491-IDX   PIC S9(08) USAGE COMP    VALUE  3491.
005040     05  WK-806-3492-IDX   PIC S9(08) USAGE COMP    VALUE  3492.
005050     05  WK-806-3493-IDX   PIC S9(08) USAGE COMP    VALUE  3493.
005060     05  WK-806-3494-IDX   PIC S9(08) USAGE COMP    VALUE  3494.
005070     05  WK-806-3495-IDX   PIC S9(08) USAGE COMP    VALUE  3495.
005080     05  WK-806-3496-IDX   PIC S9(08) USAGE COMP    VALUE  3496.
005090     05  WK-806-3497-IDX   PIC S9(08) USAGE COMP    VALUE  3497.
005100     05  WK-806-3498-IDX   PIC S9(08) USAGE COMP    VALUE  3498.
005110     05  WK-806-3499-IDX   PIC S9(08) USAGE COMP    VALUE  3499.
005120     05  WK-806-3500-IDX   PIC S9(08) USAGE COMP    VALUE  3500.
005130     05  WK-806-3501-IDX   PIC S9(08) USAGE COMP    VALUE  3501.
005140     05  WK-806-3502-IDX   PIC S9(08) USAGE COMP    VALUE  3502.
005150     05  WK-806-3503-IDX   PIC S9(08) USAGE COMP    VALUE  3503.
005160     05  WK-806-3504-IDX   PIC S9(08) USAGE COMP    VALUE  3504.
005170     05  WK-806-3505-IDX   PIC S9(08) USAGE COMP    VALUE  3505.
005180     05  WK-806-3506-IDX   PIC S9(08) USAGE COMP    VALUE  3506.
005190     05  WK-806-3507-IDX   PIC S9(08) USAGE COMP    VALUE  3507.
005200     05  WK-806-3508-IDX   PIC S9(08) USAGE COMP    VALUE  3508.
005210     05  WK-806-3509-IDX   PIC S9(08) USAGE COMP    VALUE  3509.
005220     05  WK-806-3510-IDX   PIC S9(08) USAGE COMP    VALUE  3510.
005230     05  WK-806-3511-IDX   PIC S9(08) USAGE COMP    VALUE  3511.
005240     05  WK-806-3512-IDX   PIC S9(08) USAGE COMP    VALUE  3512.
005250     05  WK-806-3513-IDX   PIC S9(08) USAGE COMP    VALUE  3513.
005260     05  WK-806-3514-IDX   PIC S9(08) USAGE COMP    VALUE  3514.
005270     05  WK-806-3515-IDX   PIC S9(08) USAGE COMP    VALUE  3515.
005280     05  WK-806-3516-IDX   PIC S9(08) USAGE COMP    VALUE  3516.
005290     05  WK-806-3517-IDX   PIC S9(08) USAGE COMP    VALUE  3517.
005300     05  WK-806-3518-IDX   PIC S9(08) USAGE COMP    VALUE  3518.
005310     05  WK-806-3519-IDX   PIC S9(08) USAGE COMP    VALUE  3519.
005320     05  WK-806-3520-IDX   PIC S9(08) USAGE COMP    VALUE  3520.
005330     05  WK-806-3521-IDX   PIC S9(08) USAGE COMP    VALUE  3521.
005340     05  WK-806-3522-IDX   PIC S9(08) USAGE COMP    VALUE  3522.
005350     05  WK-806-3523-IDX   PIC S9(08) USAGE COMP    VALUE  3523.
005360     05  WK-806-3524-IDX   PIC S9(08) USAGE COMP    VALUE  3524.
005370     05  WK-806-3525-IDX   PIC S9(08) USAGE COMP    VALUE  3525.
005380     05  WK-806-3526-IDX   PIC S9(08) USAGE COMP    VALUE  3526.
005390     05  WK-806-3527-IDX   PIC S9(08) USAGE COMP    VALUE  3527.
005400     05  WK-806-3528-IDX   PIC S9(08) USAGE COMP    VALUE  3528.
005410     05  WK-806-3529-IDX   PIC S9(08) USAGE COMP    VALUE  3529.
005420     05  WK-806-3530-IDX   PIC S9(08) USAGE COMP    VALUE  3530.
005430     05  WK-806-3531-IDX   PIC S9(08) USAGE COMP    VALUE  3531.
005440     05  WK-806-3532-IDX   PIC S9(08) USAGE COMP    VALUE  3532.
005450     05  WK-806-3533-IDX   PIC S9(08) USAGE COMP    VALUE  3533.
005460     05  WK-806-3534-IDX   PIC S9(08) USAGE COMP    VALUE  3534.
005470     05  WK-806-3535-IDX   PIC S9(08) USAGE COMP    VALUE  3535.
005480     05  WK-806-3536-IDX   PIC S9(08) USAGE COMP    VALUE  3536.
005490     05  WK-806-3537-IDX   PIC S9(08) USAGE COMP    VALUE  3537.
005500     05  WK-806-3538-IDX   PIC S9(08) USAGE COMP    VALUE  3538.
005510     05  WK-806-3539-IDX   PIC S9(08) USAGE COMP    VALUE  3539.
005520     05  WK-806-3540-IDX   PIC S9(08) USAGE COMP    VALUE  3540.
005530     05  WK-806-3541-IDX   PIC S9(08) USAGE COMP    VALUE  3541.
005540     05  WK-806-3542-IDX   PIC S9(08) USAGE COMP    VALUE  3542.
005550     05  WK-806-3543-IDX   PIC S9(08) USAGE COMP    VALUE  3543.
005560     05  WK-806-3544-IDX   PIC S9(08) USAGE COMP    VALUE  3544.
005570     05  WK-806-3545-IDX   PIC S9(08) USAGE COMP    VALUE  3545.
005580     05  WK-806-3546-IDX   PIC S9(08) USAGE COMP    VALUE  3546.
005590     05  WK-806-3547-IDX   PIC S9(08) USAGE COMP    VALUE  3547.
005600     05  WK-806-3548-IDX   PIC S9(08) USAGE COMP    VALUE  3548.
005610     05  WK-806-3549-IDX   PIC S9(08) USAGE COMP    VALUE  3549.
005620     05  WK-806-3550-IDX   PIC S9(08) USAGE COMP    VALUE  3550.
005630     05  WK-806-3551-IDX   PIC S9(08) USAGE COMP    VALUE  3551.
005640     05  WK-806-3552-IDX   PIC S9(08) USAGE COMP    VALUE  3552.
005650     05  WK-806-3553-IDX   PIC S9(08) USAGE COMP    VALUE  3553.
005660     05  WK-806-3554-IDX   PIC S9(08) USAGE COMP    VALUE  3554.
005670     05  WK-806-3555-IDX   PIC S9(08) USAGE COMP    VALUE  3555.
005680     05  WK-806-3556-IDX   PIC S9(08) USAGE COMP    VALUE  3556.
005690     05  WK-806-3557-IDX   PIC S9(08) USAGE COMP    VALUE  3557.
005700     05  WK-806-3558-IDX   PIC S9(08) USAGE COMP    VALUE  3558.
005710     05  WK-806-3559-IDX   PIC S9(08) USAGE COMP    VALUE  3559.
005720     05  WK-806-3560-IDX   PIC S9(08) USAGE COMP    VALUE  3560.
005730     05  WK-806-3561-IDX   PIC S9(08) USAGE COMP    VALUE  3561.
005740     05  WK-806-3562-IDX   PIC S9(08) USAGE COMP    VALUE  3562.
005750     05  WK-806-3563-IDX   PIC S9(08) USAGE COMP    VALUE  3563.
005760     05  WK-806-3564-IDX   PIC S9(08) USAGE COMP    VALUE  3564.
005770     05  WK-806-3565-IDX   PIC S9(08) USAGE COMP    VALUE  3565.
005780     05  WK-806-3566-IDX   PIC S9(08) USAGE COMP    VALUE  3566.
005790     05  WK-806-3567-IDX   PIC S9(08) USAGE COMP    VALUE  3567.
005800     05  WK-806-3568-IDX   PIC S9(08) USAGE COMP    VALUE  3568.
005810     05  WK-806-3569-IDX   PIC S9(08) USAGE COMP    VALUE  3569.
005820     05  WK-806-3570-IDX   PIC S9(08) USAGE COMP    VALUE  3570.
005830     05  WK-806-3571-IDX   PIC S9(08) USAGE COMP    VALUE  3571.
005840     05  WK-806-3572-IDX   PIC S9(08) USAGE COMP    VALUE  3572.
005850     05  WK-806-3573-IDX   PIC S9(08) USAGE COMP    VALUE  3573.
005860     05  WK-806-3574-IDX   PIC S9(08) USAGE COMP    VALUE  3574.
005870     05  WK-806-3575-IDX   PIC S9(08) USAGE COMP    VALUE  3575.
005880     05  WK-806-3576-IDX   PIC S9(08) USAGE COMP    VALUE  3576.
005890     05  WK-806-3577-IDX   PIC S9(08) USAGE COMP    VALUE  3577.
005900     05  WK-806-3578-IDX   PIC S9(08) USAGE COMP    VALUE  3578.
005910     05  WK-806-3579-IDX   PIC S9(08) USAGE COMP    VALUE  3579.
005920     05  WK-806-3580-IDX   PIC S9(08) USAGE COMP    VALUE  3580.
005930     05  WK-806-3581-IDX   PIC S9(08) USAGE COMP    VALUE  3581.
005940     05  WK-806-3582-IDX   PIC S9(08) USAGE COMP    VALUE  3582.
005950     05  WK-806-3583-IDX   PIC S9(08) USAGE COMP    VALUE  3583.
005960     05  WK-806-3584-IDX   PIC S9(08) USAGE COMP    VALUE  3584.
005970     05  WK-806-3585-IDX   PIC S9(08) USAGE COMP    VALUE  3585.
005980     05  WK-806-3586-IDX   PIC S9(08) USAGE COMP    VALUE  3586.
005990     05  WK-806-3587-IDX   PIC S9(08) USAGE COMP    VALUE  3587.
006000     05  WK-806-3588-IDX   PIC S9(08) USAGE COMP    VALUE  3588.
006010     05  WK-806-3589-IDX   PIC S9(08) USAGE COMP    VALUE  3589.
006020     05  WK-806-3590-IDX   PIC S9(08) USAGE COMP    VALUE  3590.
006030     05  WK-806-3591-IDX   PIC S9(08) USAGE COMP    VALUE  3591.
006040     05  WK-806-3592-IDX   PIC S9(08) USAGE COMP    VALUE  3592.
006050     05  WK-806-3593-IDX   PIC S9(08) USAGE COMP    VALUE  3593.
006060     05  WK-806-3594-IDX   PIC S9(08) USAGE COMP    VALUE  3594.
006070     05  WK-806-3595-IDX   PIC S9(08) USAGE COMP    VALUE  3595.
006080     05  WK-806-3596-IDX   PIC S9(08) USAGE COMP    VALUE  3596.
006090     05  WK-806-3597-IDX   PIC S9(08) USAGE COMP    VALUE  3597.
006100     05  WK-806-3598-IDX   PIC S9(08) USAGE COMP    VALUE  3598.
006110     05  WK-806-3599-IDX   PIC S9(08) USAGE COMP    VALUE  3599.
006120     05  WK-806-3600-IDX   PIC S9(08) USAGE COMP    VALUE  3600.
006130     05  WK-806-3601-IDX   PIC S9(08) USAGE COMP    VALUE  3601.
006140     05  WK-806-3602-IDX   PIC S9(08) USAGE COMP    VALUE  3602.
006150     05  WK-806-3603-IDX   PIC S9(08) USAGE COMP    VALUE  3603.
006160     05  WK-806-3604-IDX   PIC S9(08) USAGE COMP    VALUE  3604.
006170     05  WK-806-3605-IDX   PIC S9(08) USAGE COMP    VALUE  3605.
006180     05  WK-806-3606-IDX   PIC S9(08) USAGE COMP    VALUE  3606.
006190     05  WK-806-3607-IDX   PIC S9(08) USAGE COMP    VALUE  3607.
006200     05  WK-806-3608-IDX   PIC S9(08) USAGE COMP    VALUE  3608.
006210     05  WK-806-3609-IDX   PIC S9(08) USAGE COMP    VALUE  3609.
006220     05  WK-806-3610-IDX   PIC S9(08) USAGE COMP    VALUE  3610.
006230     05  WK-806-3611-IDX   PIC S9(08) USAGE COMP    VALUE  3611.
006240     05  WK-806-3612-IDX   PIC S9(08) USAGE COMP    VALUE  3612.
006250     05  WK-806-3613-IDX   PIC S9(08) USAGE COMP    VALUE  3613.
006260     05  WK-806-3614-IDX   PIC S9(08) USAGE COMP    VALUE  3614.
006270     05  WK-806-3615-IDX   PIC S9(08) USAGE COMP    VALUE  3615.
006280     05  WK-806-3616-IDX   PIC S9(08) USAGE COMP    VALUE  3616.
006290     05  WK-806-3617-IDX   PIC S9(08) USAGE COMP    VALUE  3617.
006300     05  WK-806-3618-IDX   PIC S9(08) USAGE COMP    VALUE  3618.
006310     05  WK-806-3619-IDX   PIC S9(08) USAGE COMP    VALUE  3619.
006320     05  WK-806-3620-IDX   PIC S9(08) USAGE COMP    VALUE  3620.
006330     05  WK-806-3621-IDX   PIC S9(08) USAGE COMP    VALUE  3621.
006340     05  WK-806-3622-IDX   PIC S9(08) USAGE COMP    VALUE  3622.
006350     05  WK-806-3623-IDX   PIC S9(08) USAGE COMP    VALUE  3623.
006360     05  WK-806-3624-IDX   PIC S9(08) USAGE COMP    VALUE  3624.
006370     05  WK-806-3625-IDX   PIC S9(08) USAGE COMP    VALUE  3625.
006380     05  WK-806-3626-IDX   PIC S9(08) USAGE COMP    VALUE  3626.
006390     05  WK-806-3627-IDX   PIC S9(08) USAGE COMP    VALUE  3627.
006400     05  WK-806-3628-IDX   PIC S9(08) USAGE COMP    VALUE  3628.
006410     05  WK-806-3629-IDX   PIC S9(08) USAGE COMP    VALUE  3629.
006420     05  WK-806-3630-IDX   PIC S9(08) USAGE COMP    VALUE  3630.
006430     05  WK-806-3631-IDX   PIC S9(08) USAGE COMP    VALUE  3631.
006440     05  WK-806-3632-IDX   PIC S9(08) USAGE COMP    VALUE  3632.
006450     05  WK-806-3633-IDX   PIC S9(08) USAGE COMP    VALUE  3633.
006460     05  WK-806-3634-IDX   PIC S9(08) USAGE COMP    VALUE  3634.
006470     05  WK-806-3635-IDX   PIC S9(08) USAGE COMP    VALUE  3635.
006480     05  WK-806-3636-IDX   PIC S9(08) USAGE COMP    VALUE  3636.
006490     05  WK-806-3637-IDX   PIC S9(08) USAGE COMP    VALUE  3637.
006500     05  WK-806-3638-IDX   PIC S9(08) USAGE COMP    VALUE  3638.
006510     05  WK-806-3639-IDX   PIC S9(08) USAGE COMP    VALUE  3639.
006520     05  WK-806-3640-IDX   PIC S9(08) USAGE COMP    VALUE  3640.
006530     05  WK-806-3641-IDX   PIC S9(08) USAGE COMP    VALUE  3641.
006540     05  WK-806-3642-IDX   PIC S9(08) USAGE COMP    VALUE  3642.
006550     05  WK-806-3643-IDX   PIC S9(08) USAGE COMP    VALUE  3643.
006560     05  WK-806-3644-IDX   PIC S9(08) USAGE COMP    VALUE  3644.
006570     05  WK-806-3645-IDX   PIC S9(08) USAGE COMP    VALUE  3645.
006580     05  WK-806-3646-IDX   PIC S9(08) USAGE COMP    VALUE  3646.
006590     05  WK-806-3647-IDX   PIC S9(08) USAGE COMP    VALUE  3647.
006600     05  WK-806-3648-IDX   PIC S9(08) USAGE COMP    VALUE  3648.
006610     05  WK-806-3649-IDX   PIC S9(08) USAGE COMP    VALUE  3649.
006620     05  WK-806-3650-IDX   PIC S9(08) USAGE COMP    VALUE  3650.
006630     05  WK-806-3651-IDX   PIC S9(08) USAGE COMP    VALUE  3651.
006640     05  WK-806-3652-IDX   PIC S9(08) USAGE COMP    VALUE  3652.
006650     05  WK-806-3653-IDX   PIC S9(08) USAGE COMP    VALUE  3653.
006660     05  WK-806-3654-IDX   PIC S9(08) USAGE COMP    VALUE  3654.
006670     05  WK-806-3655-IDX   PIC S9(08) USAGE COMP    VALUE  3655.
006680     05  WK-806-3656-IDX   PIC S9(08) USAGE COMP    VALUE  3656.
006690     05  WK-806-3657-IDX   PIC S9(08) USAGE COMP    VALUE  3657.
006700     05  WK-806-3658-IDX   PIC S9(08) USAGE COMP    VALUE  3658.
006710     05  WK-806-3659-IDX   PIC S9(08) USAGE COMP    VALUE  3659.
006720     05  WK-806-3660-IDX   PIC S9(08) USAGE COMP    VALUE  3660.
006730     05  WK-806-3661-IDX   PIC S9(08) USAGE COMP    VALUE  3661.
006740     05  WK-806-3662-IDX   PIC S9(08) USAGE COMP    VALUE  3662.
006750     05  WK-806-3663-IDX   PIC S9(08) USAGE COMP    VALUE  3663.
006760     05  WK-806-3664-IDX   PIC S9(08) USAGE COMP    VALUE  3664.
006770     05  WK-806-3665-IDX   PIC S9(08) USAGE COMP    VALUE  3665.
006780     05  WK-806-3666-IDX   PIC S9(08) USAGE COMP    VALUE  3666.
006790     05  WK-806-3667-IDX   PIC S9(08) USAGE COMP    VALUE  3667.
006800     05  WK-806-3668-IDX   PIC S9(08) USAGE COMP    VALUE  3668.
006810     05  WK-806-3669-IDX   PIC S9(08) USAGE COMP    VALUE  3669.
006820     05  WK-806-3670-IDX   PIC S9(08) USAGE COMP    VALUE  3670.
006830     05  WK-806-3671-IDX   PIC S9(08) USAGE COMP    VALUE  3671.
006840     05  WK-806-3672-IDX   PIC S9(08) USAGE COMP    VALUE  3672.
006850     05  WK-806-3673-IDX   PIC S9(08) USAGE COMP    VALUE  3673.
006860     05  WK-806-3674-IDX   PIC S9(08) USAGE COMP    VALUE  3674.
006870     05  WK-806-3675-IDX   PIC S9(08) USAGE COMP    VALUE  3675.
006880     05  WK-806-3676-IDX   PIC S9(08) USAGE COMP    VALUE  3676.
006890     05  WK-806-3677-IDX   PIC S9(08) USAGE COMP    VALUE  3677.
006900     05  WK-806-3678-IDX   PIC S9(08) USAGE COMP    VALUE  3678.
006910     05  WK-806-3679-IDX   PIC S9(08) USAGE COMP    VALUE  3679.
006920     05  WK-806-3680-IDX   PIC S9(08) USAGE COMP    VALUE  3680.
006930     05  WK-806-3681-IDX   PIC S9(08) USAGE COMP    VALUE  3681.
006940     05  WK-806-3682-IDX   PIC S9(08) USAGE COMP    VALUE  3682.
006950     05  WK-806-3683-IDX   PIC S9(08) USAGE COMP    VALUE  3683.
006960     05  WK-806-3684-IDX   PIC S9(08) USAGE COMP    VALUE  3684.
006970     05  WK-806-3685-IDX   PIC S9(08) USAGE COMP    VALUE  3685.
006980     05  WK-806-3686-IDX   PIC S9(08) USAGE COMP    VALUE  3686.
006990     05  WK-806-3687-IDX   PIC S9(08) USAGE COMP    VALUE  3687.
007000     05  WK-806-3688-IDX   PIC S9(08) USAGE COMP    VALUE  3688.
007010     05  WK-806-3689-IDX   PIC S9(08) USAGE COMP    VALUE  3689.
007020     05  WK-806-3690-IDX   PIC S9(08) USAGE COMP    VALUE  3690.
007030     05  WK-806-3691-IDX   PIC S9(08) USAGE COMP    VALUE  3691.
007040     05  WK-806-3692-IDX   PIC S9(08) USAGE COMP    VALUE  3692.
007050     05  WK-806-3693-IDX   PIC S9(08) USAGE COMP    VALUE  3693.
007060     05  WK-806-3694-IDX   PIC S9(08) USAGE COMP    VALUE  3694.
007070     05  WK-806-3695-IDX   PIC S9(08) USAGE COMP    VALUE  3695.
007080     05  WK-806-3696-IDX   PIC S9(08) USAGE COMP    VALUE  3696.
007090     05  WK-806-3697-IDX   PIC S9(08) USAGE COMP    VALUE  3697.
007100     05  WK-806-3698-IDX   PIC S9(08) USAGE COMP    VALUE  3698.
007110     05  WK-806-3699-IDX   PIC S9(08) USAGE COMP    VALUE  3699.
007120     05  WK-806-3700-IDX   PIC S9(08) USAGE COMP    VALUE  3700.
007130     05  WK-806-3701-IDX   PIC S9(08) USAGE COMP    VALUE  3701.
007140     05  WK-806-3702-IDX   PIC S9(08) USAGE COMP    VALUE  3702.
007150     05  WK-806-3703-IDX   PIC S9(08) USAGE COMP    VALUE  3703.
007160     05  WK-806-3704-IDX   PIC S9(08) USAGE COMP    VALUE  3704.
007170     05  WK-806-3705-IDX   PIC S9(08) USAGE COMP    VALUE  3705.
007180     05  WK-806-3706-IDX   PIC S9(08) USAGE COMP    VALUE  3706.
007190     05  WK-806-3707-IDX   PIC S9(08) USAGE COMP    VALUE  3707.
007200     05  WK-806-3708-IDX   PIC S9(08) USAGE COMP    VALUE  3708.
007210     05  WK-806-3709-IDX   PIC S9(08) USAGE COMP    VALUE  3709.
007220     05  WK-806-3710-IDX   PIC S9(08) USAGE COMP    VALUE  3710.
007230     05  WK-806-3711-IDX   PIC S9(08) USAGE COMP    VALUE  3711.
007240     05  WK-806-3712-IDX   PIC S9(08) USAGE COMP    VALUE  3712.
007250     05  WK-806-3713-IDX   PIC S9(08) USAGE COMP    VALUE  3713.
007260     05  WK-806-3714-IDX   PIC S9(08) USAGE COMP    VALUE  3714.
007270     05  WK-806-3715-IDX   PIC S9(08) USAGE COMP    VALUE  3715.
007280     05  WK-806-3716-IDX   PIC S9(08) USAGE COMP    VALUE  3716.
007290     05  WK-806-3717-IDX   PIC S9(08) USAGE COMP    VALUE  3717.
007300     05  WK-806-3718-IDX   PIC S9(08) USAGE COMP    VALUE  3718.
007310     05  WK-806-3719-IDX   PIC S9(08) USAGE COMP    VALUE  3719.
007320     05  WK-806-3720-IDX   PIC S9(08) USAGE COMP    VALUE  3720.
007330     05  WK-806-3721-IDX   PIC S9(08) USAGE COMP    VALUE  3721.
007340     05  WK-806-3722-IDX   PIC S9(08) USAGE COMP    VALUE  3722.
007350     05  WK-806-3723-IDX   PIC S9(08) USAGE COMP    VALUE  3723.
007360     05  WK-806-3724-IDX   PIC S9(08) USAGE COMP    VALUE  3724.
007370     05  WK-806-3725-IDX   PIC S9(08) USAGE COMP    VALUE  3725.
007380     05  WK-806-3726-IDX   PIC S9(08) USAGE COMP    VALUE  3726.
007390     05  WK-806-3727-IDX   PIC S9(08) USAGE COMP    VALUE  3727.
007400     05  WK-806-3728-IDX   PIC S9(08) USAGE COMP    VALUE  3728.
007410     05  WK-806-3729-IDX   PIC S9(08) USAGE COMP    VALUE  3729.
007420     05  WK-806-3730-IDX   PIC S9(08) USAGE COMP    VALUE  3730.
007430     05  WK-806-3731-IDX   PIC S9(08) USAGE COMP    VALUE  3731.
007440     05  WK-806-3732-IDX   PIC S9(08) USAGE COMP    VALUE  3732.
007450     05  WK-806-3733-IDX   PIC S9(08) USAGE COMP    VALUE  3733.
007460     05  WK-806-3734-IDX   PIC S9(08) USAGE COMP    VALUE  3734.
007470     05  WK-806-3735-IDX   PIC S9(08) USAGE COMP    VALUE  3735.
007480     05  WK-806-3736-IDX   PIC S9(08) USAGE COMP    VALUE  3736.
007490     05  WK-806-3737-IDX   PIC S9(08) USAGE COMP    VALUE  3737.
007500     05  WK-806-3738-IDX   PIC S9(08) USAGE COMP    VALUE  3738.
007510     05  WK-806-3739-IDX   PIC S9(08) USAGE COMP    VALUE  3739.
007520     05  WK-806-3740-IDX   PIC S9(08) USAGE COMP    VALUE  3740.
007530     05  WK-806-3741-IDX   PIC S9(08) USAGE COMP    VALUE  3741.
007540     05  WK-806-3742-IDX   PIC S9(08) USAGE COMP    VALUE  3742.
007550     05  WK-806-3743-IDX   PIC S9(08) USAGE COMP    VALUE  3743.
007560     05  WK-806-3744-IDX   PIC S9(08) USAGE COMP    VALUE  3744.
007570     05  WK-806-3745-IDX   PIC S9(08) USAGE COMP    VALUE  3745.
007580     05  WK-806-3746-IDX   PIC S9(08) USAGE COMP    VALUE  3746.
007590     05  WK-806-3747-IDX   PIC S9(08) USAGE COMP    VALUE  3747.
007600     05  WK-806-3748-IDX   PIC S9(08) USAGE COMP    VALUE  3748.
007610     05  WK-806-3749-IDX   PIC S9(08) USAGE COMP    VALUE  3749.
007620     05  WK-806-3750-IDX   PIC S9(08) USAGE COMP    VALUE  3750.
007630     05  WK-806-3751-IDX   PIC S9(08) USAGE COMP    VALUE  3751.
007640     05  WK-806-3752-IDX   PIC S9(08) USAGE COMP    VALUE  3752.
007650     05  WK-806-3753-IDX   PIC S9(08) USAGE COMP    VALUE  3753.
007660     05  WK-806-3754-IDX   PIC S9(08) USAGE COMP    VALUE  3754.
007670     05  WK-806-3755-IDX   PIC S9(08) USAGE COMP    VALUE  3755.
007680     05  WK-806-3756-IDX   PIC S9(08) USAGE COMP    VALUE  3756.
007690     05  WK-806-3757-IDX   PIC S9(08) USAGE COMP    VALUE  3757.
007700     05  WK-806-3758-IDX   PIC S9(08) USAGE COMP    VALUE  3758.
007710     05  WK-806-3759-IDX   PIC S9(08) USAGE COMP    VALUE  3759.
007720     05  WK-806-3760-IDX   PIC S9(08) USAGE COMP    VALUE  3760.
007730     05  WK-806-3761-IDX   PIC S9(08) USAGE COMP    VALUE  3761.
007740     05  WK-806-3762-IDX   PIC S9(08) USAGE COMP    VALUE  3762.
007750     05  WK-806-3763-IDX   PIC S9(08) USAGE COMP    VALUE  3763.
007760     05  WK-806-3764-IDX   PIC S9(08) USAGE COMP    VALUE  3764.
007770     05  WK-806-3765-IDX   PIC S9(08) USAGE COMP    VALUE  3765.
007780     05  WK-806-3766-IDX   PIC S9(08) USAGE COMP    VALUE  3766.
007790     05  WK-806-3767-IDX   PIC S9(08) USAGE COMP    VALUE  3767.
007800     05  WK-806-3768-IDX   PIC S9(08) USAGE COMP    VALUE  3768.
007810     05  WK-806-3769-IDX   PIC S9(08) USAGE COMP    VALUE  3769.
007820     05  WK-806-3770-IDX   PIC S9(08) USAGE COMP    VALUE  3770.
007830     05  WK-806-3771-IDX   PIC S9(08) USAGE COMP    VALUE  3771.
007840     05  WK-806-3772-IDX   PIC S9(08) USAGE COMP    VALUE  3772.
007850     05  WK-806-3773-IDX   PIC S9(08) USAGE COMP    VALUE  3773.
007860     05  WK-806-3774-IDX   PIC S9(08) USAGE COMP    VALUE  3774.
007870     05  WK-806-3775-IDX   PIC S9(08) USAGE COMP    VALUE  3775.
007880     05  WK-806-3776-IDX   PIC S9(08) USAGE COMP    VALUE  3776.
007890     05  WK-806-3777-IDX   PIC S9(08) USAGE COMP    VALUE  3777.
007900     05  WK-806-3778-IDX   PIC S9(08) USAGE COMP    VALUE  3778.
007910     05  WK-806-3779-IDX   PIC S9(08) USAGE COMP    VALUE  3779.
007920     05  WK-806-3780-IDX   PIC S9(08) USAGE COMP    VALUE  3780.
007930     05  WK-806-3781-IDX   PIC S9(08) USAGE COMP    VALUE  3781.
007940     05  WK-806-3782-IDX   PIC S9(08) USAGE COMP    VALUE  3782.
007950     05  WK-806-3783-IDX   PIC S9(08) USAGE COMP    VALUE  3783.
007960     05  WK-806-3784-IDX   PIC S9(08) USAGE COMP    VALUE  3784.
007970     05  WK-806-3785-IDX   PIC S9(08) USAGE COMP    VALUE  3785.
007980     05  WK-806-3786-IDX   PIC S9(08) USAGE COMP    VALUE  3786.
007990     05  WK-806-3787-IDX   PIC S9(08) USAGE COMP    VALUE  3787.
008000     05  WK-806-3788-IDX   PIC S9(08) USAGE COMP    VALUE  3788.
008010     05  WK-806-3789-IDX   PIC S9(08) USAGE COMP    VALUE  3789.
008020     05  WK-806-3790-IDX   PIC S9(08) USAGE COMP    VALUE  3790.
008030     05  WK-806-3791-IDX   PIC S9(08) USAGE COMP    VALUE  3791.
008040     05  WK-806-3792-IDX   PIC S9(08) USAGE COMP    VALUE  3792.
008050     05  WK-806-3793-IDX   PIC S9(08) USAGE COMP    VALUE  3793.
008060     05  WK-806-3794-IDX   PIC S9(08) USAGE COMP    VALUE  3794.
008070     05  WK-806-3795-IDX   PIC S9(08) USAGE COMP    VALUE  3795.
008080     05  WK-806-3796-IDX   PIC S9(08) USAGE COMP    VALUE  3796.
008090     05  WK-806-3797-IDX   PIC S9(08) USAGE COMP    VALUE  3797.
008100     05  WK-806-3798-IDX   PIC S9(08) USAGE COMP    VALUE  3798.
008110     05  WK-806-3799-IDX   PIC S9(08) USAGE COMP    VALUE  3799.
008120     05  WK-806-3800-IDX   PIC S9(08) USAGE COMP    VALUE  3800.
008130     05  WK-806-3801-IDX   PIC S9(08) USAGE COMP    VALUE  3801.
008140     05  WK-806-3802-IDX   PIC S9(08) USAGE COMP    VALUE  3802.
008150     05  WK-806-3803-IDX   PIC S9(08) USAGE COMP    VALUE  3803.
008160     05  WK-806-3804-IDX   PIC S9(08) USAGE COMP    VALUE  3804.
008170     05  WK-806-3805-IDX   PIC S9(08) USAGE COMP    VALUE  3805.
008180     05  WK-806-3806-IDX   PIC S9(08) USAGE COMP    VALUE  3806.
008190     05  WK-806-3807-IDX   PIC S9(08) USAGE COMP    VALUE  3807.
008200     05  WK-806-3808-IDX   PIC S9(08) USAGE COMP    VALUE  3808.
008210     05  WK-806-3809-IDX   PIC S9(08) USAGE COMP    VALUE  3809.
008220     05  WK-806-3810-IDX   PIC S9(08) USAGE COMP    VALUE  3810.
008230     05  WK-806-3811-IDX   PIC S9(08) USAGE COMP    VALUE  3811.
008240     05  WK-806-3812-IDX   PIC S9(08) USAGE COMP    VALUE  3812.
008250     05  WK-806-3813-IDX   PIC S9(08) USAGE COMP    VALUE  3813.
008260     05  WK-806-3814-IDX   PIC S9(08) USAGE COMP    VALUE  3814.
008270     05  WK-806-3815-IDX   PIC S9(08) USAGE COMP    VALUE  3815.
008280     05  WK-806-3816-IDX   PIC S9(08) USAGE COMP    VALUE  3816.
008290     05  WK-806-3817-IDX   PIC S9(08) USAGE COMP    VALUE  3817.
008300     05  WK-806-3818-IDX   PIC S9(08) USAGE COMP    VALUE  3818.
008310     05  WK-806-3819-IDX   PIC S9(08) USAGE COMP    VALUE  3819.
008320     05  WK-806-3820-IDX   PIC S9(08) USAGE COMP    VALUE  3820.
008330     05  WK-806-3821-IDX   PIC S9(08) USAGE COMP    VALUE  3821.
008340     05  WK-806-3822-IDX   PIC S9(08) USAGE COMP    VALUE  3822.
008350     05  WK-806-3823-IDX   PIC S9(08) USAGE COMP    VALUE  3823.
008360     05  WK-806-3824-IDX   PIC S9(08) USAGE COMP    VALUE  3824.
008370     05  WK-806-3825-IDX   PIC S9(08) USAGE COMP    VALUE  3825.
008380     05  WK-806-3826-IDX   PIC S9(08) USAGE COMP    VALUE  3826.
008390     05  WK-806-3827-IDX   PIC S9(08) USAGE COMP    VALUE  3827.
008400     05  WK-806-3828-IDX   PIC S9(08) USAGE COMP    VALUE  3828.
008410     05  WK-806-3829-IDX   PIC S9(08) USAGE COMP    VALUE  3829.
008420     05  WK-806-3830-IDX   PIC S9(08) USAGE COMP    VALUE  3830.
008430     05  WK-806-3831-IDX   PIC S9(08) USAGE COMP    VALUE  3831.
008440     05  WK-806-3832-IDX   PIC S9(08) USAGE COMP    VALUE  3832.
008450     05  WK-806-3833-IDX   PIC S9(08) USAGE COMP    VALUE  3833.
008460     05  WK-806-3834-IDX   PIC S9(08) USAGE COMP    VALUE  3834.
008470     05  WK-806-3835-IDX   PIC S9(08) USAGE COMP    VALUE  3835.
008480     05  WK-806-3836-IDX   PIC S9(08) USAGE COMP    VALUE  3836.
008490     05  WK-806-3837-IDX   PIC S9(08) USAGE COMP    VALUE  3837.
008500     05  WK-806-3838-IDX   PIC S9(08) USAGE COMP    VALUE  3838.
008510     05  WK-806-3839-IDX   PIC S9(08) USAGE COMP    VALUE  3839.
008520     05  WK-806-3840-IDX   PIC S9(08) USAGE COMP    VALUE  3840.
008530     05  WK-806-3841-IDX   PIC S9(08) USAGE COMP    VALUE  3841.
008540     05  WK-806-3842-IDX   PIC S9(08) USAGE COMP    VALUE  3842.
008550     05  WK-806-3843-IDX   PIC S9(08) USAGE COMP    VALUE  3843.
008560     05  WK-806-3844-IDX   PIC S9(08) USAGE COMP    VALUE  3844.
008570     05  WK-806-3845-IDX   PIC S9(08) USAGE COMP    VALUE  3845.
008580     05  WK-806-3846-IDX   PIC S9(08) USAGE COMP    VALUE  3846.
008590     05  WK-806-3847-IDX   PIC S9(08) USAGE COMP    VALUE  3847.
008600     05  WK-806-3848-IDX   PIC S9(08) USAGE COMP    VALUE  3848.
008610     05  WK-806-3849-IDX   PIC S9(08) USAGE COMP    VALUE  3849.
008620     05  WK-806-3850-IDX   PIC S9(08) USAGE COMP    VALUE  3850.
008630     05  WK-806-3851-IDX   PIC S9(08) USAGE COMP    VALUE  3851.
008640     05  WK-806-3852-IDX   PIC S9(08) USAGE COMP    VALUE  3852.
008650     05  WK-806-3853-IDX   PIC S9(08) USAGE COMP    VALUE  3853.
008660     05  WK-806-3854-IDX   PIC S9(08) USAGE COMP    VALUE  3854.
008670     05  WK-806-3855-IDX   PIC S9(08) USAGE COMP    VALUE  3855.
008680     05  WK-806-3856-IDX   PIC S9(08) USAGE COMP    VALUE  3856.
008690     05  WK-806-3857-IDX   PIC S9(08) USAGE COMP    VALUE  3857.
008700     05  WK-806-3858-IDX   PIC S9(08) USAGE COMP    VALUE  3858.
008710     05  WK-806-3859-IDX   PIC S9(08) USAGE COMP    VALUE  3859.
008720     05  WK-806-3860-IDX   PIC S9(08) USAGE COMP    VALUE  3860.
008730     05  WK-806-3861-IDX   PIC S9(08) USAGE COMP    VALUE  3861.
008740     05  WK-806-3862-IDX   PIC S9(08) USAGE COMP    VALUE  3862.
008750     05  WK-806-3863-IDX   PIC S9(08) USAGE COMP    VALUE  3863.
008760     05  WK-806-3864-IDX   PIC S9(08) USAGE COMP    VALUE  3864.
008770     05  WK-806-3865-IDX   PIC S9(08) USAGE COMP    VALUE  3865.
008780     05  WK-806-3866-IDX   PIC S9(08) USAGE COMP    VALUE  3866.
008790     05  WK-806-3867-IDX   PIC S9(08) USAGE COMP    VALUE  3867.
008800     05  WK-806-3868-IDX   PIC S9(08) USAGE COMP    VALUE  3868.
008810     05  WK-806-3869-IDX   PIC S9(08) USAGE COMP    VALUE  3869.
008820     05  WK-806-3870-IDX   PIC S9(08) USAGE COMP    VALUE  3870.
008830     05  WK-806-3871-IDX   PIC S9(08) USAGE COMP    VALUE  3871.
008840     05  WK-806-3872-IDX   PIC S9(08) USAGE COMP    VALUE  3872.
008850     05  WK-806-3873-IDX   PIC S9(08) USAGE COMP    VALUE  3873.
008860     05  WK-806-3874-IDX   PIC S9(08) USAGE COMP    VALUE  3874.
008870     05  WK-806-3875-IDX   PIC S9(08) USAGE COMP    VALUE  3875.
008880     05  WK-806-3876-IDX   PIC S9(08) USAGE COMP    VALUE  3876.
008890     05  WK-806-3877-IDX   PIC S9(08) USAGE COMP    VALUE  3877.
008900     05  WK-806-3878-IDX   PIC S9(08) USAGE COMP    VALUE  3878.
008910     05  WK-806-3879-IDX   PIC S9(08) USAGE COMP    VALUE  3879.
008920     05  WK-806-3880-IDX   PIC S9(08) USAGE COMP    VALUE  3880.
008930     05  WK-806-3881-IDX   PIC S9(08) USAGE COMP    VALUE  3881.
008940     05  WK-806-3882-IDX   PIC S9(08) USAGE COMP    VALUE  3882.
008950     05  WK-806-3883-IDX   PIC S9(08) USAGE COMP    VALUE  3883.
008960     05  WK-806-3884-IDX   PIC S9(08) USAGE COMP    VALUE  3884.
008970     05  WK-806-3885-IDX   PIC S9(08) USAGE COMP    VALUE  3885.
008980     05  WK-806-3886-IDX   PIC S9(08) USAGE COMP    VALUE  3886.
008990     05  WK-806-3887-IDX   PIC S9(08) USAGE COMP    VALUE  3887.
009000     05  WK-806-3888-IDX   PIC S9(08) USAGE COMP    VALUE  3888.
009010     05  WK-806-3889-IDX   PIC S9(08) USAGE COMP    VALUE  3889.
009020     05  WK-806-3890-IDX   PIC S9(08) USAGE COMP    VALUE  3890.
009030     05  WK-806-3891-IDX   PIC S9(08) USAGE COMP    VALUE  3891.
009040     05  WK-806-3892-IDX   PIC S9(08) USAGE COMP    VALUE  3892.
009050     05  WK-806-3893-IDX   PIC S9(08) USAGE COMP    VALUE  3893.
009060     05  WK-806-3894-IDX   PIC S9(08) USAGE COMP    VALUE  3894.
009070     05  WK-806-3895-IDX   PIC S9(08) USAGE COMP    VALUE  3895.
009080     05  WK-806-3896-IDX   PIC S9(08) USAGE COMP    VALUE  3896.
009090     05  WK-806-3897-IDX   PIC S9(08) USAGE COMP    VALUE  3897.
009100     05  WK-806-3898-IDX   PIC S9(08) USAGE COMP    VALUE  3898.
009110     05  WK-806-3899-IDX   PIC S9(08) USAGE COMP    VALUE  3899.
009120     05  WK-806-3900-IDX   PIC S9(08) USAGE COMP    VALUE  3900.
009130     05  WK-806-3901-IDX   PIC S9(08) USAGE COMP    VALUE  3901.
009140     05  WK-806-3902-IDX   PIC S9(08) USAGE COMP    VALUE  3902.
009150     05  WK-806-3903-IDX   PIC S9(08) USAGE COMP    VALUE  3903.
009160     05  WK-806-3904-IDX   PIC S9(08) USAGE COMP    VALUE  3904.
009170     05  WK-806-3905-IDX   PIC S9(08) USAGE COMP    VALUE  3905.
009180     05  WK-806-3906-IDX   PIC S9(08) USAGE COMP    VALUE  3906.
009190     05  WK-806-3907-IDX   PIC S9(08) USAGE COMP    VALUE  3907.
009200     05  WK-806-3908-IDX   PIC S9(08) USAGE COMP    VALUE  3908.
009210     05  WK-806-3909-IDX   PIC S9(08) USAGE COMP    VALUE  3909.
009220     05  WK-806-3910-IDX   PIC S9(08) USAGE COMP    VALUE  3910.
009230     05  WK-806-3911-IDX   PIC S9(08) USAGE COMP    VALUE  3911.
009240     05  WK-806-3912-IDX   PIC S9(08) USAGE COMP    VALUE  3912.
009250     05  WK-806-3913-IDX   PIC S9(08) USAGE COMP    VALUE  3913.
009260     05  WK-806-3914-IDX   PIC S9(08) USAGE COMP    VALUE  3914.
009270     05  WK-806-3915-IDX   PIC S9(08) USAGE COMP    VALUE  3915.
009280     05  WK-806-3916-IDX   PIC S9(08) USAGE COMP    VALUE  3916.
009290     05  WK-806-3917-IDX   PIC S9(08) USAGE COMP    VALUE  3917.
009300     05  WK-806-3918-IDX   PIC S9(08) USAGE COMP    VALUE  3918.
009310     05  WK-806-3919-IDX   PIC S9(08) USAGE COMP    VALUE  3919.
009320     05  WK-806-3920-IDX   PIC S9(08) USAGE COMP    VALUE  3920.
009330     05  WK-806-3921-IDX   PIC S9(08) USAGE COMP    VALUE  3921.
009340     05  WK-806-3922-IDX   PIC S9(08) USAGE COMP    VALUE  3922.
009350     05  WK-806-3923-IDX   PIC S9(08) USAGE COMP    VALUE  3923.
009360     05  WK-806-3924-IDX   PIC S9(08) USAGE COMP    VALUE  3924.
009370     05  WK-806-3925-IDX   PIC S9(08) USAGE COMP    VALUE  3925.
009380     05  WK-806-3926-IDX   PIC S9(08) USAGE COMP    VALUE  3926.
009390     05  WK-806-3927-IDX   PIC S9(08) USAGE COMP    VALUE  3927.
009400     05  WK-806-3928-IDX   PIC S9(08) USAGE COMP    VALUE  3928.
009410     05  WK-806-3929-IDX   PIC S9(08) USAGE COMP    VALUE  3929.
009420     05  WK-806-3930-IDX   PIC S9(08) USAGE COMP    VALUE  3930.
009430     05  WK-806-3931-IDX   PIC S9(08) USAGE COMP    VALUE  3931.
009440     05  WK-806-3932-IDX   PIC S9(08) USAGE COMP    VALUE  3932.
009450     05  WK-806-3933-IDX   PIC S9(08) USAGE COMP    VALUE  3933.
009460     05  WK-806-3934-IDX   PIC S9(08) USAGE COMP    VALUE  3934.
009470     05  WK-806-3935-IDX   PIC S9(08) USAGE COMP    VALUE  3935.
009480     05  WK-806-3936-IDX   PIC S9(08) USAGE COMP    VALUE  3936.
009490     05  WK-806-3937-IDX   PIC S9(08) USAGE COMP    VALUE  3937.
009500     05  WK-806-3938-IDX   PIC S9(08) USAGE COMP    VALUE  3938.
009510     05  WK-806-3939-IDX   PIC S9(08) USAGE COMP    VALUE  3939.
009520     05  WK-806-3940-IDX   PIC S9(08) USAGE COMP    VALUE  3940.
009530     05  WK-806-3941-IDX   PIC S9(08) USAGE COMP    VALUE  3941.
009540     05  WK-806-3942-IDX   PIC S9(08) USAGE COMP    VALUE  3942.
009550     05  WK-806-3943-IDX   PIC S9(08) USAGE COMP    VALUE  3943.
009560     05  WK-806-3944-IDX   PIC S9(08) USAGE COMP    VALUE  3944.
009570     05  WK-806-3945-IDX   PIC S9(08) USAGE COMP    VALUE  3945.
009580     05  WK-806-3946-IDX   PIC S9(08) USAGE COMP    VALUE  3946.
009590     05  WK-806-3947-IDX   PIC S9(08) USAGE COMP    VALUE  3947.
009600     05  WK-806-3948-IDX   PIC S9(08) USAGE COMP    VALUE  3948.
009610     05  WK-806-3949-IDX   PIC S9(08) USAGE COMP    VALUE  3949.
009620     05  WK-806-3950-IDX   PIC S9(08) USAGE COMP    VALUE  3950.
009630     05  WK-806-3951-IDX   PIC S9(08) USAGE COMP    VALUE  3951.
009640     05  WK-806-3952-IDX   PIC S9(08) USAGE COMP    VALUE  3952.
009650     05  WK-806-3953-IDX   PIC S9(08) USAGE COMP    VALUE  3953.
009660     05  WK-806-3954-IDX   PIC S9(08) USAGE COMP    VALUE  3954.
009670     05  WK-806-3955-IDX   PIC S9(08) USAGE COMP    VALUE  3955.
009680     05  WK-806-3956-IDX   PIC S9(08) USAGE COMP    VALUE  3956.
009690     05  WK-806-3957-IDX   PIC S9(08) USAGE COMP    VALUE  3957.
009700     05  WK-806-3958-IDX   PIC S9(08) USAGE COMP    VALUE  3958.
009710     05  WK-806-3959-IDX   PIC S9(08) USAGE COMP    VALUE  3959.
009720     05  WK-806-3960-IDX   PIC S9(08) USAGE COMP    VALUE  3960.
009730     05  WK-806-3961-IDX   PIC S9(08) USAGE COMP    VALUE  3961.
009740     05  WK-806-3962-IDX   PIC S9(08) USAGE COMP    VALUE  3962.
009750     05  WK-806-3963-IDX   PIC S9(08) USAGE COMP    VALUE  3963.
009760     05  WK-806-3964-IDX   PIC S9(08) USAGE COMP    VALUE  3964.
009770     05  WK-806-3965-IDX   PIC S9(08) USAGE COMP    VALUE  3965.
009780     05  WK-806-3966-IDX   PIC S9(08) USAGE COMP    VALUE  3966.
009790     05  WK-806-3967-IDX   PIC S9(08) USAGE COMP    VALUE  3967.
009800     05  WK-806-3968-IDX   PIC S9(08) USAGE COMP    VALUE  3968.
009810     05  WK-806-3969-IDX   PIC S9(08) USAGE COMP    VALUE  3969.
009820     05  WK-806-3970-IDX   PIC S9(08) USAGE COMP    VALUE  3970.
009830     05  WK-806-3971-IDX   PIC S9(08) USAGE COMP    VALUE  3971.
009840     05  WK-806-3972-IDX   PIC S9(08) USAGE COMP    VALUE  3972.
009850     05  WK-806-3973-IDX   PIC S9(08) USAGE COMP    VALUE  3973.
009860     05  WK-806-3974-IDX   PIC S9(08) USAGE COMP    VALUE  3974.
009870     05  WK-806-3975-IDX   PIC S9(08) USAGE COMP    VALUE  3975.
009880     05  WK-806-3976-IDX   PIC S9(08) USAGE COMP    VALUE  3976.
009890     05  WK-806-3977-IDX   PIC S9(08) USAGE COMP    VALUE  3977.
009900     05  WK-806-3978-IDX   PIC S9(08) USAGE COMP    VALUE  3978.
009910     05  WK-806-3979-IDX   PIC S9(08) USAGE COMP    VALUE  3979.
009920     05  WK-806-3980-IDX   PIC S9(08) USAGE COMP    VALUE  3980.
009930     05  WK-806-3981-IDX   PIC S9(08) USAGE COMP    VALUE  3981.
009940     05  WK-806-3982-IDX   PIC S9(08) USAGE COMP    VALUE  3982.
009950     05  WK-806-3983-IDX   PIC S9(08) USAGE COMP    VALUE  3983.
009960     05  WK-806-3984-IDX   PIC S9(08) USAGE COMP    VALUE  3984.
009970     05  WK-806-3985-IDX   PIC S9(08) USAGE COMP    VALUE  3985.
009980     05  WK-806-3986-IDX   PIC S9(08) USAGE COMP    VALUE  3986.
009990     05  WK-806-3987-IDX   PIC S9(08) USAGE COMP    VALUE  3987.
010000     05  WK-806-3988-IDX   PIC S9(08) USAGE COMP    VALUE  3988.
010010     05  WK-806-3989-IDX   PIC S9(08) USAGE COMP    VALUE  3989.
010020     05  WK-806-3990-IDX   PIC S9(08) USAGE COMP    VALUE  3990.
010030     05  WK-806-3991-IDX   PIC S9(08) USAGE COMP    VALUE  3991.
010040     05  WK-806-3992-IDX   PIC S9(08) USAGE COMP    VALUE  3992.
010050     05  WK-806-3993-IDX   PIC S9(08) USAGE COMP    VALUE  3993.
010060     05  WK-806-3994-IDX   PIC S9(08) USAGE COMP    VALUE  3994.
010070     05  WK-806-3995-IDX   PIC S9(08) USAGE COMP    VALUE  3995.
010080     05  WK-806-3996-IDX   PIC S9(08) USAGE COMP    VALUE  3996.
010090     05  WK-806-3997-IDX   PIC S9(08) USAGE COMP    VALUE  3997.
010100     05  WK-806-3998-IDX   PIC S9(08) USAGE COMP    VALUE  3998.
010110     05  WK-806-3999-IDX   PIC S9(08) USAGE COMP    VALUE  3999.
010110     05  WK-806-4000-IDX   PIC S9(08) USAGE COMP    VALUE  4000.
000130     05  WK-806-4001-IDX   PIC S9(08) USAGE COMP    VALUE  4001.
000140     05  WK-806-4002-IDX   PIC S9(08) USAGE COMP    VALUE  4002.
000150     05  WK-806-4003-IDX   PIC S9(08) USAGE COMP    VALUE  4003.
000160     05  WK-806-4004-IDX   PIC S9(08) USAGE COMP    VALUE  4004.
000170     05  WK-806-4005-IDX   PIC S9(08) USAGE COMP    VALUE  4005.
000180     05  WK-806-4006-IDX   PIC S9(08) USAGE COMP    VALUE  4006.
000190     05  WK-806-4007-IDX   PIC S9(08) USAGE COMP    VALUE  4007.
000200     05  WK-806-4008-IDX   PIC S9(08) USAGE COMP    VALUE  4008.
000210     05  WK-806-4009-IDX   PIC S9(08) USAGE COMP    VALUE  4009.
000220     05  WK-806-4010-IDX   PIC S9(08) USAGE COMP    VALUE  4010.
000230     05  WK-806-4011-IDX   PIC S9(08) USAGE COMP    VALUE  4011.
000240     05  WK-806-4012-IDX   PIC S9(08) USAGE COMP    VALUE  4012.
000250     05  WK-806-4013-IDX   PIC S9(08) USAGE COMP    VALUE  4013.
000260     05  WK-806-4014-IDX   PIC S9(08) USAGE COMP    VALUE  4014.
000270     05  WK-806-4015-IDX   PIC S9(08) USAGE COMP    VALUE  4015.
000280     05  WK-806-4016-IDX   PIC S9(08) USAGE COMP    VALUE  4016.
000290     05  WK-806-4017-IDX   PIC S9(08) USAGE COMP    VALUE  4017.
000300     05  WK-806-4018-IDX   PIC S9(08) USAGE COMP    VALUE  4018.
000310     05  WK-806-4019-IDX   PIC S9(08) USAGE COMP    VALUE  4019.
000320     05  WK-806-4020-IDX   PIC S9(08) USAGE COMP    VALUE  4020.
000330     05  WK-806-4021-IDX   PIC S9(08) USAGE COMP    VALUE  4021.
000340     05  WK-806-4022-IDX   PIC S9(08) USAGE COMP    VALUE  4022.
000350     05  WK-806-4023-IDX   PIC S9(08) USAGE COMP    VALUE  4023.
000360     05  WK-806-4024-IDX   PIC S9(08) USAGE COMP    VALUE  4024.
000370     05  WK-806-4025-IDX   PIC S9(08) USAGE COMP    VALUE  4025.
000380     05  WK-806-4026-IDX   PIC S9(08) USAGE COMP    VALUE  4026.
000390     05  WK-806-4027-IDX   PIC S9(08) USAGE COMP    VALUE  4027.
000400     05  WK-806-4028-IDX   PIC S9(08) USAGE COMP    VALUE  4028.
000410     05  WK-806-4029-IDX   PIC S9(08) USAGE COMP    VALUE  4029.
000420     05  WK-806-4030-IDX   PIC S9(08) USAGE COMP    VALUE  4030.
000430     05  WK-806-4031-IDX   PIC S9(08) USAGE COMP    VALUE  4031.
000440     05  WK-806-4032-IDX   PIC S9(08) USAGE COMP    VALUE  4032.
000450     05  WK-806-4033-IDX   PIC S9(08) USAGE COMP    VALUE  4033.
000460     05  WK-806-4034-IDX   PIC S9(08) USAGE COMP    VALUE  4034.
000470     05  WK-806-4035-IDX   PIC S9(08) USAGE COMP    VALUE  4035.
000480     05  WK-806-4036-IDX   PIC S9(08) USAGE COMP    VALUE  4036.
000490     05  WK-806-4037-IDX   PIC S9(08) USAGE COMP    VALUE  4037.
000500     05  WK-806-4038-IDX   PIC S9(08) USAGE COMP    VALUE  4038.
000510     05  WK-806-4039-IDX   PIC S9(08) USAGE COMP    VALUE  4039.
000520     05  WK-806-4040-IDX   PIC S9(08) USAGE COMP    VALUE  4040.
000530     05  WK-806-4041-IDX   PIC S9(08) USAGE COMP    VALUE  4041.
000540     05  WK-806-4042-IDX   PIC S9(08) USAGE COMP    VALUE  4042.
000550     05  WK-806-4043-IDX   PIC S9(08) USAGE COMP    VALUE  4043.
000560     05  WK-806-4044-IDX   PIC S9(08) USAGE COMP    VALUE  4044.
000570     05  WK-806-4045-IDX   PIC S9(08) USAGE COMP    VALUE  4045.
000580     05  WK-806-4046-IDX   PIC S9(08) USAGE COMP    VALUE  4046.
000590     05  WK-806-4047-IDX   PIC S9(08) USAGE COMP    VALUE  4047.
000600     05  WK-806-4048-IDX   PIC S9(08) USAGE COMP    VALUE  4048.
000610     05  WK-806-4049-IDX   PIC S9(08) USAGE COMP    VALUE  4049.
000620     05  WK-806-4050-IDX   PIC S9(08) USAGE COMP    VALUE  4050.
000630     05  WK-806-4051-IDX   PIC S9(08) USAGE COMP    VALUE  4051.
000640     05  WK-806-4052-IDX   PIC S9(08) USAGE COMP    VALUE  4052.
000650     05  WK-806-4053-IDX   PIC S9(08) USAGE COMP    VALUE  4053.
000660     05  WK-806-4054-IDX   PIC S9(08) USAGE COMP    VALUE  4054.
000670     05  WK-806-4055-IDX   PIC S9(08) USAGE COMP    VALUE  4055.
000680     05  WK-806-4056-IDX   PIC S9(08) USAGE COMP    VALUE  4056.
000690     05  WK-806-4057-IDX   PIC S9(08) USAGE COMP    VALUE  4057.
000700     05  WK-806-4058-IDX   PIC S9(08) USAGE COMP    VALUE  4058.
000710     05  WK-806-4059-IDX   PIC S9(08) USAGE COMP    VALUE  4059.
000720     05  WK-806-4060-IDX   PIC S9(08) USAGE COMP    VALUE  4060.
000730     05  WK-806-4061-IDX   PIC S9(08) USAGE COMP    VALUE  4061.
000740     05  WK-806-4062-IDX   PIC S9(08) USAGE COMP    VALUE  4062.
000750     05  WK-806-4063-IDX   PIC S9(08) USAGE COMP    VALUE  4063.
000760     05  WK-806-4064-IDX   PIC S9(08) USAGE COMP    VALUE  4064.
000770     05  WK-806-4065-IDX   PIC S9(08) USAGE COMP    VALUE  4065.
000780     05  WK-806-4066-IDX   PIC S9(08) USAGE COMP    VALUE  4066.
000790     05  WK-806-4067-IDX   PIC S9(08) USAGE COMP    VALUE  4067.
000800     05  WK-806-4068-IDX   PIC S9(08) USAGE COMP    VALUE  4068.
000810     05  WK-806-4069-IDX   PIC S9(08) USAGE COMP    VALUE  4069.
000820     05  WK-806-4070-IDX   PIC S9(08) USAGE COMP    VALUE  4070.
000830     05  WK-806-4071-IDX   PIC S9(08) USAGE COMP    VALUE  4071.
000840     05  WK-806-4072-IDX   PIC S9(08) USAGE COMP    VALUE  4072.
000850     05  WK-806-4073-IDX   PIC S9(08) USAGE COMP    VALUE  4073.
000860     05  WK-806-4074-IDX   PIC S9(08) USAGE COMP    VALUE  4074.
000870     05  WK-806-4075-IDX   PIC S9(08) USAGE COMP    VALUE  4075.
000880     05  WK-806-4076-IDX   PIC S9(08) USAGE COMP    VALUE  4076.
000890     05  WK-806-4077-IDX   PIC S9(08) USAGE COMP    VALUE  4077.
000900     05  WK-806-4078-IDX   PIC S9(08) USAGE COMP    VALUE  4078.
000910     05  WK-806-4079-IDX   PIC S9(08) USAGE COMP    VALUE  4079.
000920     05  WK-806-4080-IDX   PIC S9(08) USAGE COMP    VALUE  4080.
000930     05  WK-806-4081-IDX   PIC S9(08) USAGE COMP    VALUE  4081.
000940     05  WK-806-4082-IDX   PIC S9(08) USAGE COMP    VALUE  4082.
000950     05  WK-806-4083-IDX   PIC S9(08) USAGE COMP    VALUE  4083.
000960     05  WK-806-4084-IDX   PIC S9(08) USAGE COMP    VALUE  4084.
000970     05  WK-806-4085-IDX   PIC S9(08) USAGE COMP    VALUE  4085.
000980     05  WK-806-4086-IDX   PIC S9(08) USAGE COMP    VALUE  4086.
000990     05  WK-806-4087-IDX   PIC S9(08) USAGE COMP    VALUE  4087.
001000     05  WK-806-4088-IDX   PIC S9(08) USAGE COMP    VALUE  4088.
001010     05  WK-806-4089-IDX   PIC S9(08) USAGE COMP    VALUE  4089.
001020     05  WK-806-4090-IDX   PIC S9(08) USAGE COMP    VALUE  4090.
001030     05  WK-806-4091-IDX   PIC S9(08) USAGE COMP    VALUE  4091.
001040     05  WK-806-4092-IDX   PIC S9(08) USAGE COMP    VALUE  4092.
001050     05  WK-806-4093-IDX   PIC S9(08) USAGE COMP    VALUE  4093.
001060     05  WK-806-4094-IDX   PIC S9(08) USAGE COMP    VALUE  4094.
001070     05  WK-806-4095-IDX   PIC S9(08) USAGE COMP    VALUE  4095.
001080     05  WK-806-4096-IDX   PIC S9(08) USAGE COMP    VALUE  4096.
001090     05  WK-806-4097-IDX   PIC S9(08) USAGE COMP    VALUE  4097.
001100     05  WK-806-4098-IDX   PIC S9(08) USAGE COMP    VALUE  4098.
001110     05  WK-806-4099-IDX   PIC S9(08) USAGE COMP    VALUE  4099.
001120     05  WK-806-4100-IDX   PIC S9(08) USAGE COMP    VALUE  4100.
001130     05  WK-806-4101-IDX   PIC S9(08) USAGE COMP    VALUE  4101.
001140     05  WK-806-4102-IDX   PIC S9(08) USAGE COMP    VALUE  4102.
001150     05  WK-806-4103-IDX   PIC S9(08) USAGE COMP    VALUE  4103.
001160     05  WK-806-4104-IDX   PIC S9(08) USAGE COMP    VALUE  4104.
001170     05  WK-806-4105-IDX   PIC S9(08) USAGE COMP    VALUE  4105.
001180     05  WK-806-4106-IDX   PIC S9(08) USAGE COMP    VALUE  4106.
001190     05  WK-806-4107-IDX   PIC S9(08) USAGE COMP    VALUE  4107.
001200     05  WK-806-4108-IDX   PIC S9(08) USAGE COMP    VALUE  4108.
001210     05  WK-806-4109-IDX   PIC S9(08) USAGE COMP    VALUE  4109.
001220     05  WK-806-4110-IDX   PIC S9(08) USAGE COMP    VALUE  4110.
001230     05  WK-806-4111-IDX   PIC S9(08) USAGE COMP    VALUE  4111.
001240     05  WK-806-4112-IDX   PIC S9(08) USAGE COMP    VALUE  4112.
001250     05  WK-806-4113-IDX   PIC S9(08) USAGE COMP    VALUE  4113.
001260     05  WK-806-4114-IDX   PIC S9(08) USAGE COMP    VALUE  4114.
001270     05  WK-806-4115-IDX   PIC S9(08) USAGE COMP    VALUE  4115.
001280     05  WK-806-4116-IDX   PIC S9(08) USAGE COMP    VALUE  4116.
001290     05  WK-806-4117-IDX   PIC S9(08) USAGE COMP    VALUE  4117.
001300     05  WK-806-4118-IDX   PIC S9(08) USAGE COMP    VALUE  4118.
001310     05  WK-806-4119-IDX   PIC S9(08) USAGE COMP    VALUE  4119.
001320     05  WK-806-4120-IDX   PIC S9(08) USAGE COMP    VALUE  4120.
001330     05  WK-806-4121-IDX   PIC S9(08) USAGE COMP    VALUE  4121.
001340     05  WK-806-4122-IDX   PIC S9(08) USAGE COMP    VALUE  4122.
001350     05  WK-806-4123-IDX   PIC S9(08) USAGE COMP    VALUE  4123.
001360     05  WK-806-4124-IDX   PIC S9(08) USAGE COMP    VALUE  4124.
001370     05  WK-806-4125-IDX   PIC S9(08) USAGE COMP    VALUE  4125.
001380     05  WK-806-4126-IDX   PIC S9(08) USAGE COMP    VALUE  4126.
001390     05  WK-806-4127-IDX   PIC S9(08) USAGE COMP    VALUE  4127.
001400     05  WK-806-4128-IDX   PIC S9(08) USAGE COMP    VALUE  4128.
001410     05  WK-806-4129-IDX   PIC S9(08) USAGE COMP    VALUE  4129.
001420     05  WK-806-4130-IDX   PIC S9(08) USAGE COMP    VALUE  4130.
001430     05  WK-806-4131-IDX   PIC S9(08) USAGE COMP    VALUE  4131.
001440     05  WK-806-4132-IDX   PIC S9(08) USAGE COMP    VALUE  4132.
001450     05  WK-806-4133-IDX   PIC S9(08) USAGE COMP    VALUE  4133.
001460     05  WK-806-4134-IDX   PIC S9(08) USAGE COMP    VALUE  4134.
001470     05  WK-806-4135-IDX   PIC S9(08) USAGE COMP    VALUE  4135.
001480     05  WK-806-4136-IDX   PIC S9(08) USAGE COMP    VALUE  4136.
001490     05  WK-806-4137-IDX   PIC S9(08) USAGE COMP    VALUE  4137.
001500     05  WK-806-4138-IDX   PIC S9(08) USAGE COMP    VALUE  4138.
001510     05  WK-806-4139-IDX   PIC S9(08) USAGE COMP    VALUE  4139.
001520     05  WK-806-4140-IDX   PIC S9(08) USAGE COMP    VALUE  4140.
001530     05  WK-806-4141-IDX   PIC S9(08) USAGE COMP    VALUE  4141.
001540     05  WK-806-4142-IDX   PIC S9(08) USAGE COMP    VALUE  4142.
001550     05  WK-806-4143-IDX   PIC S9(08) USAGE COMP    VALUE  4143.
001560     05  WK-806-4144-IDX   PIC S9(08) USAGE COMP    VALUE  4144.
001570     05  WK-806-4145-IDX   PIC S9(08) USAGE COMP    VALUE  4145.
001580     05  WK-806-4146-IDX   PIC S9(08) USAGE COMP    VALUE  4146.
001590     05  WK-806-4147-IDX   PIC S9(08) USAGE COMP    VALUE  4147.
001600     05  WK-806-4148-IDX   PIC S9(08) USAGE COMP    VALUE  4148.
001610     05  WK-806-4149-IDX   PIC S9(08) USAGE COMP    VALUE  4149.
001620     05  WK-806-4150-IDX   PIC S9(08) USAGE COMP    VALUE  4150.
001630     05  WK-806-4151-IDX   PIC S9(08) USAGE COMP    VALUE  4151.
001640     05  WK-806-4152-IDX   PIC S9(08) USAGE COMP    VALUE  4152.
001650     05  WK-806-4153-IDX   PIC S9(08) USAGE COMP    VALUE  4153.
001660     05  WK-806-4154-IDX   PIC S9(08) USAGE COMP    VALUE  4154.
001670     05  WK-806-4155-IDX   PIC S9(08) USAGE COMP    VALUE  4155.
001680     05  WK-806-4156-IDX   PIC S9(08) USAGE COMP    VALUE  4156.
001690     05  WK-806-4157-IDX   PIC S9(08) USAGE COMP    VALUE  4157.
001700     05  WK-806-4158-IDX   PIC S9(08) USAGE COMP    VALUE  4158.
001710     05  WK-806-4159-IDX   PIC S9(08) USAGE COMP    VALUE  4159.
001720     05  WK-806-4160-IDX   PIC S9(08) USAGE COMP    VALUE  4160.
001730     05  WK-806-4161-IDX   PIC S9(08) USAGE COMP    VALUE  4161.
001740     05  WK-806-4162-IDX   PIC S9(08) USAGE COMP    VALUE  4162.
001750     05  WK-806-4163-IDX   PIC S9(08) USAGE COMP    VALUE  4163.
001760     05  WK-806-4164-IDX   PIC S9(08) USAGE COMP    VALUE  4164.
001770     05  WK-806-4165-IDX   PIC S9(08) USAGE COMP    VALUE  4165.
001780     05  WK-806-4166-IDX   PIC S9(08) USAGE COMP    VALUE  4166.
001790     05  WK-806-4167-IDX   PIC S9(08) USAGE COMP    VALUE  4167.
001800     05  WK-806-4168-IDX   PIC S9(08) USAGE COMP    VALUE  4168.
001810     05  WK-806-4169-IDX   PIC S9(08) USAGE COMP    VALUE  4169.
001820     05  WK-806-4170-IDX   PIC S9(08) USAGE COMP    VALUE  4170.
001830     05  WK-806-4171-IDX   PIC S9(08) USAGE COMP    VALUE  4171.
001840     05  WK-806-4172-IDX   PIC S9(08) USAGE COMP    VALUE  4172.
001850     05  WK-806-4173-IDX   PIC S9(08) USAGE COMP    VALUE  4173.
001860     05  WK-806-4174-IDX   PIC S9(08) USAGE COMP    VALUE  4174.
001870     05  WK-806-4175-IDX   PIC S9(08) USAGE COMP    VALUE  4175.
001880     05  WK-806-4176-IDX   PIC S9(08) USAGE COMP    VALUE  4176.
001890     05  WK-806-4177-IDX   PIC S9(08) USAGE COMP    VALUE  4177.
001900     05  WK-806-4178-IDX   PIC S9(08) USAGE COMP    VALUE  4178.
001910     05  WK-806-4179-IDX   PIC S9(08) USAGE COMP    VALUE  4179.
001920     05  WK-806-4180-IDX   PIC S9(08) USAGE COMP    VALUE  4180.
001930     05  WK-806-4181-IDX   PIC S9(08) USAGE COMP    VALUE  4181.
001940     05  WK-806-4182-IDX   PIC S9(08) USAGE COMP    VALUE  4182.
001950     05  WK-806-4183-IDX   PIC S9(08) USAGE COMP    VALUE  4183.
001960     05  WK-806-4184-IDX   PIC S9(08) USAGE COMP    VALUE  4184.
001970     05  WK-806-4185-IDX   PIC S9(08) USAGE COMP    VALUE  4185.
001980     05  WK-806-4186-IDX   PIC S9(08) USAGE COMP    VALUE  4186.
001990     05  WK-806-4187-IDX   PIC S9(08) USAGE COMP    VALUE  4187.
002000     05  WK-806-4188-IDX   PIC S9(08) USAGE COMP    VALUE  4188.
002010     05  WK-806-4189-IDX   PIC S9(08) USAGE COMP    VALUE  4189.
002020     05  WK-806-4190-IDX   PIC S9(08) USAGE COMP    VALUE  4190.
002030     05  WK-806-4191-IDX   PIC S9(08) USAGE COMP    VALUE  4191.
002040     05  WK-806-4192-IDX   PIC S9(08) USAGE COMP    VALUE  4192.
002050     05  WK-806-4193-IDX   PIC S9(08) USAGE COMP    VALUE  4193.
002060     05  WK-806-4194-IDX   PIC S9(08) USAGE COMP    VALUE  4194.
002070     05  WK-806-4195-IDX   PIC S9(08) USAGE COMP    VALUE  4195.
002080     05  WK-806-4196-IDX   PIC S9(08) USAGE COMP    VALUE  4196.
002090     05  WK-806-4197-IDX   PIC S9(08) USAGE COMP    VALUE  4197.
002100     05  WK-806-4198-IDX   PIC S9(08) USAGE COMP    VALUE  4198.
002110     05  WK-806-4199-IDX   PIC S9(08) USAGE COMP    VALUE  4199.
002120     05  WK-806-4200-IDX   PIC S9(08) USAGE COMP    VALUE  4200.
002130     05  WK-806-4201-IDX   PIC S9(08) USAGE COMP    VALUE  4201.
002140     05  WK-806-4202-IDX   PIC S9(08) USAGE COMP    VALUE  4202.
002150     05  WK-806-4203-IDX   PIC S9(08) USAGE COMP    VALUE  4203.
002160     05  WK-806-4204-IDX   PIC S9(08) USAGE COMP    VALUE  4204.
002170     05  WK-806-4205-IDX   PIC S9(08) USAGE COMP    VALUE  4205.
002180     05  WK-806-4206-IDX   PIC S9(08) USAGE COMP    VALUE  4206.
002190     05  WK-806-4207-IDX   PIC S9(08) USAGE COMP    VALUE  4207.
002200     05  WK-806-4208-IDX   PIC S9(08) USAGE COMP    VALUE  4208.
002210     05  WK-806-4209-IDX   PIC S9(08) USAGE COMP    VALUE  4209.
002220     05  WK-806-4210-IDX   PIC S9(08) USAGE COMP    VALUE  4210.
002230     05  WK-806-4211-IDX   PIC S9(08) USAGE COMP    VALUE  4211.
002240     05  WK-806-4212-IDX   PIC S9(08) USAGE COMP    VALUE  4212.
002250     05  WK-806-4213-IDX   PIC S9(08) USAGE COMP    VALUE  4213.
002260     05  WK-806-4214-IDX   PIC S9(08) USAGE COMP    VALUE  4214.
002270     05  WK-806-4215-IDX   PIC S9(08) USAGE COMP    VALUE  4215.
002280     05  WK-806-4216-IDX   PIC S9(08) USAGE COMP    VALUE  4216.
002290     05  WK-806-4217-IDX   PIC S9(08) USAGE COMP    VALUE  4217.
002300     05  WK-806-4218-IDX   PIC S9(08) USAGE COMP    VALUE  4218.
002310     05  WK-806-4219-IDX   PIC S9(08) USAGE COMP    VALUE  4219.
002320     05  WK-806-4220-IDX   PIC S9(08) USAGE COMP    VALUE  4220.
002330     05  WK-806-4221-IDX   PIC S9(08) USAGE COMP    VALUE  4221.
002340     05  WK-806-4222-IDX   PIC S9(08) USAGE COMP    VALUE  4222.
002350     05  WK-806-4223-IDX   PIC S9(08) USAGE COMP    VALUE  4223.
002360     05  WK-806-4224-IDX   PIC S9(08) USAGE COMP    VALUE  4224.
002370     05  WK-806-4225-IDX   PIC S9(08) USAGE COMP    VALUE  4225.
002380     05  WK-806-4226-IDX   PIC S9(08) USAGE COMP    VALUE  4226.
002390     05  WK-806-4227-IDX   PIC S9(08) USAGE COMP    VALUE  4227.
002400     05  WK-806-4228-IDX   PIC S9(08) USAGE COMP    VALUE  4228.
002410     05  WK-806-4229-IDX   PIC S9(08) USAGE COMP    VALUE  4229.
002420     05  WK-806-4230-IDX   PIC S9(08) USAGE COMP    VALUE  4230.
002430     05  WK-806-4231-IDX   PIC S9(08) USAGE COMP    VALUE  4231.
002440     05  WK-806-4232-IDX   PIC S9(08) USAGE COMP    VALUE  4232.
002450     05  WK-806-4233-IDX   PIC S9(08) USAGE COMP    VALUE  4233.
002460     05  WK-806-4234-IDX   PIC S9(08) USAGE COMP    VALUE  4234.
002470     05  WK-806-4235-IDX   PIC S9(08) USAGE COMP    VALUE  4235.
002480     05  WK-806-4236-IDX   PIC S9(08) USAGE COMP    VALUE  4236.
002490     05  WK-806-4237-IDX   PIC S9(08) USAGE COMP    VALUE  4237.
002500     05  WK-806-4238-IDX   PIC S9(08) USAGE COMP    VALUE  4238.
002510     05  WK-806-4239-IDX   PIC S9(08) USAGE COMP    VALUE  4239.
002520     05  WK-806-4240-IDX   PIC S9(08) USAGE COMP    VALUE  4240.
002530     05  WK-806-4241-IDX   PIC S9(08) USAGE COMP    VALUE  4241.
002540     05  WK-806-4242-IDX   PIC S9(08) USAGE COMP    VALUE  4242.
002550     05  WK-806-4243-IDX   PIC S9(08) USAGE COMP    VALUE  4243.
002560     05  WK-806-4244-IDX   PIC S9(08) USAGE COMP    VALUE  4244.
002570     05  WK-806-4245-IDX   PIC S9(08) USAGE COMP    VALUE  4245.
002580     05  WK-806-4246-IDX   PIC S9(08) USAGE COMP    VALUE  4246.
002590     05  WK-806-4247-IDX   PIC S9(08) USAGE COMP    VALUE  4247.
002600     05  WK-806-4248-IDX   PIC S9(08) USAGE COMP    VALUE  4248.
002610     05  WK-806-4249-IDX   PIC S9(08) USAGE COMP    VALUE  4249.
002620     05  WK-806-4250-IDX   PIC S9(08) USAGE COMP    VALUE  4250.
002630     05  WK-806-4251-IDX   PIC S9(08) USAGE COMP    VALUE  4251.
002640     05  WK-806-4252-IDX   PIC S9(08) USAGE COMP    VALUE  4252.
002650     05  WK-806-4253-IDX   PIC S9(08) USAGE COMP    VALUE  4253.
002660     05  WK-806-4254-IDX   PIC S9(08) USAGE COMP    VALUE  4254.
002670     05  WK-806-4255-IDX   PIC S9(08) USAGE COMP    VALUE  4255.
002680     05  WK-806-4256-IDX   PIC S9(08) USAGE COMP    VALUE  4256.
002690     05  WK-806-4257-IDX   PIC S9(08) USAGE COMP    VALUE  4257.
002700     05  WK-806-4258-IDX   PIC S9(08) USAGE COMP    VALUE  4258.
002710     05  WK-806-4259-IDX   PIC S9(08) USAGE COMP    VALUE  4259.
002720     05  WK-806-4260-IDX   PIC S9(08) USAGE COMP    VALUE  4260.
002730     05  WK-806-4261-IDX   PIC S9(08) USAGE COMP    VALUE  4261.
002740     05  WK-806-4262-IDX   PIC S9(08) USAGE COMP    VALUE  4262.
002750     05  WK-806-4263-IDX   PIC S9(08) USAGE COMP    VALUE  4263.
002760     05  WK-806-4264-IDX   PIC S9(08) USAGE COMP    VALUE  4264.
002770     05  WK-806-4265-IDX   PIC S9(08) USAGE COMP    VALUE  4265.
002780     05  WK-806-4266-IDX   PIC S9(08) USAGE COMP    VALUE  4266.
002790     05  WK-806-4267-IDX   PIC S9(08) USAGE COMP    VALUE  4267.
002800     05  WK-806-4268-IDX   PIC S9(08) USAGE COMP    VALUE  4268.
002810     05  WK-806-4269-IDX   PIC S9(08) USAGE COMP    VALUE  4269.
002820     05  WK-806-4270-IDX   PIC S9(08) USAGE COMP    VALUE  4270.
002830     05  WK-806-4271-IDX   PIC S9(08) USAGE COMP    VALUE  4271.
002840     05  WK-806-4272-IDX   PIC S9(08) USAGE COMP    VALUE  4272.
002850     05  WK-806-4273-IDX   PIC S9(08) USAGE COMP    VALUE  4273.
002860     05  WK-806-4274-IDX   PIC S9(08) USAGE COMP    VALUE  4274.
002870     05  WK-806-4275-IDX   PIC S9(08) USAGE COMP    VALUE  4275.
002880     05  WK-806-4276-IDX   PIC S9(08) USAGE COMP    VALUE  4276.
002890     05  WK-806-4277-IDX   PIC S9(08) USAGE COMP    VALUE  4277.
002900     05  WK-806-4278-IDX   PIC S9(08) USAGE COMP    VALUE  4278.
002910     05  WK-806-4279-IDX   PIC S9(08) USAGE COMP    VALUE  4279.
002920     05  WK-806-4280-IDX   PIC S9(08) USAGE COMP    VALUE  4280.
002930     05  WK-806-4281-IDX   PIC S9(08) USAGE COMP    VALUE  4281.
002940     05  WK-806-4282-IDX   PIC S9(08) USAGE COMP    VALUE  4282.
002950     05  WK-806-4283-IDX   PIC S9(08) USAGE COMP    VALUE  4283.
002960     05  WK-806-4284-IDX   PIC S9(08) USAGE COMP    VALUE  4284.
002970     05  WK-806-4285-IDX   PIC S9(08) USAGE COMP    VALUE  4285.
002980     05  WK-806-4286-IDX   PIC S9(08) USAGE COMP    VALUE  4286.
002990     05  WK-806-4287-IDX   PIC S9(08) USAGE COMP    VALUE  4287.
003000     05  WK-806-4288-IDX   PIC S9(08) USAGE COMP    VALUE  4288.
003010     05  WK-806-4289-IDX   PIC S9(08) USAGE COMP    VALUE  4289.
003020     05  WK-806-4290-IDX   PIC S9(08) USAGE COMP    VALUE  4290.
003030     05  WK-806-4291-IDX   PIC S9(08) USAGE COMP    VALUE  4291.
003040     05  WK-806-4292-IDX   PIC S9(08) USAGE COMP    VALUE  4292.
003050     05  WK-806-4293-IDX   PIC S9(08) USAGE COMP    VALUE  4293.
003060     05  WK-806-4294-IDX   PIC S9(08) USAGE COMP    VALUE  4294.
003070     05  WK-806-4295-IDX   PIC S9(08) USAGE COMP    VALUE  4295.
003080     05  WK-806-4296-IDX   PIC S9(08) USAGE COMP    VALUE  4296.
003090     05  WK-806-4297-IDX   PIC S9(08) USAGE COMP    VALUE  4297.
003100     05  WK-806-4298-IDX   PIC S9(08) USAGE COMP    VALUE  4298.
003110     05  WK-806-4299-IDX   PIC S9(08) USAGE COMP    VALUE  4299.
003120     05  WK-806-4300-IDX   PIC S9(08) USAGE COMP    VALUE  4300.
003130     05  WK-806-4301-IDX   PIC S9(08) USAGE COMP    VALUE  4301.
003140     05  WK-806-4302-IDX   PIC S9(08) USAGE COMP    VALUE  4302.
003150     05  WK-806-4303-IDX   PIC S9(08) USAGE COMP    VALUE  4303.
003160     05  WK-806-4304-IDX   PIC S9(08) USAGE COMP    VALUE  4304.
003170     05  WK-806-4305-IDX   PIC S9(08) USAGE COMP    VALUE  4305.
003180     05  WK-806-4306-IDX   PIC S9(08) USAGE COMP    VALUE  4306.
003190     05  WK-806-4307-IDX   PIC S9(08) USAGE COMP    VALUE  4307.
003200     05  WK-806-4308-IDX   PIC S9(08) USAGE COMP    VALUE  4308.
003210     05  WK-806-4309-IDX   PIC S9(08) USAGE COMP    VALUE  4309.
003220     05  WK-806-4310-IDX   PIC S9(08) USAGE COMP    VALUE  4310.
003230     05  WK-806-4311-IDX   PIC S9(08) USAGE COMP    VALUE  4311.
003240     05  WK-806-4312-IDX   PIC S9(08) USAGE COMP    VALUE  4312.
003250     05  WK-806-4313-IDX   PIC S9(08) USAGE COMP    VALUE  4313.
003260     05  WK-806-4314-IDX   PIC S9(08) USAGE COMP    VALUE  4314.
003270     05  WK-806-4315-IDX   PIC S9(08) USAGE COMP    VALUE  4315.
003280     05  WK-806-4316-IDX   PIC S9(08) USAGE COMP    VALUE  4316.
003290     05  WK-806-4317-IDX   PIC S9(08) USAGE COMP    VALUE  4317.
003300     05  WK-806-4318-IDX   PIC S9(08) USAGE COMP    VALUE  4318.
003310     05  WK-806-4319-IDX   PIC S9(08) USAGE COMP    VALUE  4319.
003320     05  WK-806-4320-IDX   PIC S9(08) USAGE COMP    VALUE  4320.
003330     05  WK-806-4321-IDX   PIC S9(08) USAGE COMP    VALUE  4321.
003340     05  WK-806-4322-IDX   PIC S9(08) USAGE COMP    VALUE  4322.
003350     05  WK-806-4323-IDX   PIC S9(08) USAGE COMP    VALUE  4323.
003360     05  WK-806-4324-IDX   PIC S9(08) USAGE COMP    VALUE  4324.
003370     05  WK-806-4325-IDX   PIC S9(08) USAGE COMP    VALUE  4325.
003380     05  WK-806-4326-IDX   PIC S9(08) USAGE COMP    VALUE  4326.
003390     05  WK-806-4327-IDX   PIC S9(08) USAGE COMP    VALUE  4327.
003400     05  WK-806-4328-IDX   PIC S9(08) USAGE COMP    VALUE  4328.
003410     05  WK-806-4329-IDX   PIC S9(08) USAGE COMP    VALUE  4329.
003420     05  WK-806-4330-IDX   PIC S9(08) USAGE COMP    VALUE  4330.
003430     05  WK-806-4331-IDX   PIC S9(08) USAGE COMP    VALUE  4331.
003440     05  WK-806-4332-IDX   PIC S9(08) USAGE COMP    VALUE  4332.
003450     05  WK-806-4333-IDX   PIC S9(08) USAGE COMP    VALUE  4333.
003460     05  WK-806-4334-IDX   PIC S9(08) USAGE COMP    VALUE  4334.
003470     05  WK-806-4335-IDX   PIC S9(08) USAGE COMP    VALUE  4335.
003480     05  WK-806-4336-IDX   PIC S9(08) USAGE COMP    VALUE  4336.
003490     05  WK-806-4337-IDX   PIC S9(08) USAGE COMP    VALUE  4337.
003500     05  WK-806-4338-IDX   PIC S9(08) USAGE COMP    VALUE  4338.
003510     05  WK-806-4339-IDX   PIC S9(08) USAGE COMP    VALUE  4339.
003520     05  WK-806-4340-IDX   PIC S9(08) USAGE COMP    VALUE  4340.
003530     05  WK-806-4341-IDX   PIC S9(08) USAGE COMP    VALUE  4341.
003540     05  WK-806-4342-IDX   PIC S9(08) USAGE COMP    VALUE  4342.
003550     05  WK-806-4343-IDX   PIC S9(08) USAGE COMP    VALUE  4343.
003560     05  WK-806-4344-IDX   PIC S9(08) USAGE COMP    VALUE  4344.
003570     05  WK-806-4345-IDX   PIC S9(08) USAGE COMP    VALUE  4345.
003580     05  WK-806-4346-IDX   PIC S9(08) USAGE COMP    VALUE  4346.
003590     05  WK-806-4347-IDX   PIC S9(08) USAGE COMP    VALUE  4347.
003600     05  WK-806-4348-IDX   PIC S9(08) USAGE COMP    VALUE  4348.
003610     05  WK-806-4349-IDX   PIC S9(08) USAGE COMP    VALUE  4349.
003620     05  WK-806-4350-IDX   PIC S9(08) USAGE COMP    VALUE  4350.
003630     05  WK-806-4351-IDX   PIC S9(08) USAGE COMP    VALUE  4351.
003640     05  WK-806-4352-IDX   PIC S9(08) USAGE COMP    VALUE  4352.
003650     05  WK-806-4353-IDX   PIC S9(08) USAGE COMP    VALUE  4353.
003660     05  WK-806-4354-IDX   PIC S9(08) USAGE COMP    VALUE  4354.
003670     05  WK-806-4355-IDX   PIC S9(08) USAGE COMP    VALUE  4355.
003680     05  WK-806-4356-IDX   PIC S9(08) USAGE COMP    VALUE  4356.
003690     05  WK-806-4357-IDX   PIC S9(08) USAGE COMP    VALUE  4357.
003700     05  WK-806-4358-IDX   PIC S9(08) USAGE COMP    VALUE  4358.
003710     05  WK-806-4359-IDX   PIC S9(08) USAGE COMP    VALUE  4359.
003720     05  WK-806-4360-IDX   PIC S9(08) USAGE COMP    VALUE  4360.
003730     05  WK-806-4361-IDX   PIC S9(08) USAGE COMP    VALUE  4361.
003740     05  WK-806-4362-IDX   PIC S9(08) USAGE COMP    VALUE  4362.
003750     05  WK-806-4363-IDX   PIC S9(08) USAGE COMP    VALUE  4363.
003760     05  WK-806-4364-IDX   PIC S9(08) USAGE COMP    VALUE  4364.
003770     05  WK-806-4365-IDX   PIC S9(08) USAGE COMP    VALUE  4365.
003780     05  WK-806-4366-IDX   PIC S9(08) USAGE COMP    VALUE  4366.
003790     05  WK-806-4367-IDX   PIC S9(08) USAGE COMP    VALUE  4367.
003800     05  WK-806-4368-IDX   PIC S9(08) USAGE COMP    VALUE  4368.
003810     05  WK-806-4369-IDX   PIC S9(08) USAGE COMP    VALUE  4369.
003820     05  WK-806-4370-IDX   PIC S9(08) USAGE COMP    VALUE  4370.
003830     05  WK-806-4371-IDX   PIC S9(08) USAGE COMP    VALUE  4371.
003840     05  WK-806-4372-IDX   PIC S9(08) USAGE COMP    VALUE  4372.
003850     05  WK-806-4373-IDX   PIC S9(08) USAGE COMP    VALUE  4373.
003860     05  WK-806-4374-IDX   PIC S9(08) USAGE COMP    VALUE  4374.
003870     05  WK-806-4375-IDX   PIC S9(08) USAGE COMP    VALUE  4375.
003880     05  WK-806-4376-IDX   PIC S9(08) USAGE COMP    VALUE  4376.
003890     05  WK-806-4377-IDX   PIC S9(08) USAGE COMP    VALUE  4377.
003900     05  WK-806-4378-IDX   PIC S9(08) USAGE COMP    VALUE  4378.
003910     05  WK-806-4379-IDX   PIC S9(08) USAGE COMP    VALUE  4379.
003920     05  WK-806-4380-IDX   PIC S9(08) USAGE COMP    VALUE  4380.
003930     05  WK-806-4381-IDX   PIC S9(08) USAGE COMP    VALUE  4381.
003940     05  WK-806-4382-IDX   PIC S9(08) USAGE COMP    VALUE  4382.
003950     05  WK-806-4383-IDX   PIC S9(08) USAGE COMP    VALUE  4383.
003960     05  WK-806-4384-IDX   PIC S9(08) USAGE COMP    VALUE  4384.
003970     05  WK-806-4385-IDX   PIC S9(08) USAGE COMP    VALUE  4385.
003980     05  WK-806-4386-IDX   PIC S9(08) USAGE COMP    VALUE  4386.
003990     05  WK-806-4387-IDX   PIC S9(08) USAGE COMP    VALUE  4387.
004000     05  WK-806-4388-IDX   PIC S9(08) USAGE COMP    VALUE  4388.
004010     05  WK-806-4389-IDX   PIC S9(08) USAGE COMP    VALUE  4389.
004020     05  WK-806-4390-IDX   PIC S9(08) USAGE COMP    VALUE  4390.
004030     05  WK-806-4391-IDX   PIC S9(08) USAGE COMP    VALUE  4391.
004040     05  WK-806-4392-IDX   PIC S9(08) USAGE COMP    VALUE  4392.
004050     05  WK-806-4393-IDX   PIC S9(08) USAGE COMP    VALUE  4393.
004060     05  WK-806-4394-IDX   PIC S9(08) USAGE COMP    VALUE  4394.
004070     05  WK-806-4395-IDX   PIC S9(08) USAGE COMP    VALUE  4395.
004080     05  WK-806-4396-IDX   PIC S9(08) USAGE COMP    VALUE  4396.
004090     05  WK-806-4397-IDX   PIC S9(08) USAGE COMP    VALUE  4397.
004100     05  WK-806-4398-IDX   PIC S9(08) USAGE COMP    VALUE  4398.
004110     05  WK-806-4399-IDX   PIC S9(08) USAGE COMP    VALUE  4399.
004120     05  WK-806-4400-IDX   PIC S9(08) USAGE COMP    VALUE  4400.
004130     05  WK-806-4401-IDX   PIC S9(08) USAGE COMP    VALUE  4401.
004140     05  WK-806-4402-IDX   PIC S9(08) USAGE COMP    VALUE  4402.
004150     05  WK-806-4403-IDX   PIC S9(08) USAGE COMP    VALUE  4403.
004160     05  WK-806-4404-IDX   PIC S9(08) USAGE COMP    VALUE  4404.
004170     05  WK-806-4405-IDX   PIC S9(08) USAGE COMP    VALUE  4405.
004180     05  WK-806-4406-IDX   PIC S9(08) USAGE COMP    VALUE  4406.
004190     05  WK-806-4407-IDX   PIC S9(08) USAGE COMP    VALUE  4407.
004200     05  WK-806-4408-IDX   PIC S9(08) USAGE COMP    VALUE  4408.
004210     05  WK-806-4409-IDX   PIC S9(08) USAGE COMP    VALUE  4409.
004220     05  WK-806-4410-IDX   PIC S9(08) USAGE COMP    VALUE  4410.
004230     05  WK-806-4411-IDX   PIC S9(08) USAGE COMP    VALUE  4411.
004240     05  WK-806-4412-IDX   PIC S9(08) USAGE COMP    VALUE  4412.
004250     05  WK-806-4413-IDX   PIC S9(08) USAGE COMP    VALUE  4413.
004260     05  WK-806-4414-IDX   PIC S9(08) USAGE COMP    VALUE  4414.
004270     05  WK-806-4415-IDX   PIC S9(08) USAGE COMP    VALUE  4415.
004280     05  WK-806-4416-IDX   PIC S9(08) USAGE COMP    VALUE  4416.
004290     05  WK-806-4417-IDX   PIC S9(08) USAGE COMP    VALUE  4417.
004300     05  WK-806-4418-IDX   PIC S9(08) USAGE COMP    VALUE  4418.
004310     05  WK-806-4419-IDX   PIC S9(08) USAGE COMP    VALUE  4419.
004320     05  WK-806-4420-IDX   PIC S9(08) USAGE COMP    VALUE  4420.
004330     05  WK-806-4421-IDX   PIC S9(08) USAGE COMP    VALUE  4421.
004340     05  WK-806-4422-IDX   PIC S9(08) USAGE COMP    VALUE  4422.
004350     05  WK-806-4423-IDX   PIC S9(08) USAGE COMP    VALUE  4423.
004360     05  WK-806-4424-IDX   PIC S9(08) USAGE COMP    VALUE  4424.
004370     05  WK-806-4425-IDX   PIC S9(08) USAGE COMP    VALUE  4425.
004380     05  WK-806-4426-IDX   PIC S9(08) USAGE COMP    VALUE  4426.
004390     05  WK-806-4427-IDX   PIC S9(08) USAGE COMP    VALUE  4427.
004400     05  WK-806-4428-IDX   PIC S9(08) USAGE COMP    VALUE  4428.
004410     05  WK-806-4429-IDX   PIC S9(08) USAGE COMP    VALUE  4429.
004420     05  WK-806-4430-IDX   PIC S9(08) USAGE COMP    VALUE  4430.
004430     05  WK-806-4431-IDX   PIC S9(08) USAGE COMP    VALUE  4431.
004440     05  WK-806-4432-IDX   PIC S9(08) USAGE COMP    VALUE  4432.
004450     05  WK-806-4433-IDX   PIC S9(08) USAGE COMP    VALUE  4433.
004460     05  WK-806-4434-IDX   PIC S9(08) USAGE COMP    VALUE  4434.
004470     05  WK-806-4435-IDX   PIC S9(08) USAGE COMP    VALUE  4435.
004480     05  WK-806-4436-IDX   PIC S9(08) USAGE COMP    VALUE  4436.
004490     05  WK-806-4437-IDX   PIC S9(08) USAGE COMP    VALUE  4437.
004500     05  WK-806-4438-IDX   PIC S9(08) USAGE COMP    VALUE  4438.
004510     05  WK-806-4439-IDX   PIC S9(08) USAGE COMP    VALUE  4439.
004520     05  WK-806-4440-IDX   PIC S9(08) USAGE COMP    VALUE  4440.
004530     05  WK-806-4441-IDX   PIC S9(08) USAGE COMP    VALUE  4441.
004540     05  WK-806-4442-IDX   PIC S9(08) USAGE COMP    VALUE  4442.
004550     05  WK-806-4443-IDX   PIC S9(08) USAGE COMP    VALUE  4443.
004560     05  WK-806-4444-IDX   PIC S9(08) USAGE COMP    VALUE  4444.
004570     05  WK-806-4445-IDX   PIC S9(08) USAGE COMP    VALUE  4445.
004580     05  WK-806-4446-IDX   PIC S9(08) USAGE COMP    VALUE  4446.
004590     05  WK-806-4447-IDX   PIC S9(08) USAGE COMP    VALUE  4447.
004600     05  WK-806-4448-IDX   PIC S9(08) USAGE COMP    VALUE  4448.
004610     05  WK-806-4449-IDX   PIC S9(08) USAGE COMP    VALUE  4449.
004620     05  WK-806-4450-IDX   PIC S9(08) USAGE COMP    VALUE  4450.
004630     05  WK-806-4451-IDX   PIC S9(08) USAGE COMP    VALUE  4451.
004640     05  WK-806-4452-IDX   PIC S9(08) USAGE COMP    VALUE  4452.
004650     05  WK-806-4453-IDX   PIC S9(08) USAGE COMP    VALUE  4453.
004660     05  WK-806-4454-IDX   PIC S9(08) USAGE COMP    VALUE  4454.
004670     05  WK-806-4455-IDX   PIC S9(08) USAGE COMP    VALUE  4455.
004680     05  WK-806-4456-IDX   PIC S9(08) USAGE COMP    VALUE  4456.
004690     05  WK-806-4457-IDX   PIC S9(08) USAGE COMP    VALUE  4457.
004700     05  WK-806-4458-IDX   PIC S9(08) USAGE COMP    VALUE  4458.
004710     05  WK-806-4459-IDX   PIC S9(08) USAGE COMP    VALUE  4459.
004720     05  WK-806-4460-IDX   PIC S9(08) USAGE COMP    VALUE  4460.
004730     05  WK-806-4461-IDX   PIC S9(08) USAGE COMP    VALUE  4461.
004740     05  WK-806-4462-IDX   PIC S9(08) USAGE COMP    VALUE  4462.
004750     05  WK-806-4463-IDX   PIC S9(08) USAGE COMP    VALUE  4463.
004760     05  WK-806-4464-IDX   PIC S9(08) USAGE COMP    VALUE  4464.
004770     05  WK-806-4465-IDX   PIC S9(08) USAGE COMP    VALUE  4465.
004780     05  WK-806-4466-IDX   PIC S9(08) USAGE COMP    VALUE  4466.
004790     05  WK-806-4467-IDX   PIC S9(08) USAGE COMP    VALUE  4467.
004800     05  WK-806-4468-IDX   PIC S9(08) USAGE COMP    VALUE  4468.
004810     05  WK-806-4469-IDX   PIC S9(08) USAGE COMP    VALUE  4469.
004820     05  WK-806-4470-IDX   PIC S9(08) USAGE COMP    VALUE  4470.
004830     05  WK-806-4471-IDX   PIC S9(08) USAGE COMP    VALUE  4471.
004840     05  WK-806-4472-IDX   PIC S9(08) USAGE COMP    VALUE  4472.
004850     05  WK-806-4473-IDX   PIC S9(08) USAGE COMP    VALUE  4473.
004860     05  WK-806-4474-IDX   PIC S9(08) USAGE COMP    VALUE  4474.
004870     05  WK-806-4475-IDX   PIC S9(08) USAGE COMP    VALUE  4475.
004880     05  WK-806-4476-IDX   PIC S9(08) USAGE COMP    VALUE  4476.
004890     05  WK-806-4477-IDX   PIC S9(08) USAGE COMP    VALUE  4477.
004900     05  WK-806-4478-IDX   PIC S9(08) USAGE COMP    VALUE  4478.
004910     05  WK-806-4479-IDX   PIC S9(08) USAGE COMP    VALUE  4479.
004920     05  WK-806-4480-IDX   PIC S9(08) USAGE COMP    VALUE  4480.
004930     05  WK-806-4481-IDX   PIC S9(08) USAGE COMP    VALUE  4481.
004940     05  WK-806-4482-IDX   PIC S9(08) USAGE COMP    VALUE  4482.
004950     05  WK-806-4483-IDX   PIC S9(08) USAGE COMP    VALUE  4483.
004960     05  WK-806-4484-IDX   PIC S9(08) USAGE COMP    VALUE  4484.
004970     05  WK-806-4485-IDX   PIC S9(08) USAGE COMP    VALUE  4485.
004980     05  WK-806-4486-IDX   PIC S9(08) USAGE COMP    VALUE  4486.
004990     05  WK-806-4487-IDX   PIC S9(08) USAGE COMP    VALUE  4487.
005000     05  WK-806-4488-IDX   PIC S9(08) USAGE COMP    VALUE  4488.
005010     05  WK-806-4489-IDX   PIC S9(08) USAGE COMP    VALUE  4489.
005020     05  WK-806-4490-IDX   PIC S9(08) USAGE COMP    VALUE  4490.
005030     05  WK-806-4491-IDX   PIC S9(08) USAGE COMP    VALUE  4491.
005040     05  WK-806-4492-IDX   PIC S9(08) USAGE COMP    VALUE  4492.
005050     05  WK-806-4493-IDX   PIC S9(08) USAGE COMP    VALUE  4493.
005060     05  WK-806-4494-IDX   PIC S9(08) USAGE COMP    VALUE  4494.
005070     05  WK-806-4495-IDX   PIC S9(08) USAGE COMP    VALUE  4495.
005080     05  WK-806-4496-IDX   PIC S9(08) USAGE COMP    VALUE  4496.
005090     05  WK-806-4497-IDX   PIC S9(08) USAGE COMP    VALUE  4497.
005100     05  WK-806-4498-IDX   PIC S9(08) USAGE COMP    VALUE  4498.
005110     05  WK-806-4499-IDX   PIC S9(08) USAGE COMP    VALUE  4499.
005120     05  WK-806-4500-IDX   PIC S9(08) USAGE COMP    VALUE  4500.
005130     05  WK-806-4501-IDX   PIC S9(08) USAGE COMP    VALUE  4501.
005140     05  WK-806-4502-IDX   PIC S9(08) USAGE COMP    VALUE  4502.
005150     05  WK-806-4503-IDX   PIC S9(08) USAGE COMP    VALUE  4503.
005160     05  WK-806-4504-IDX   PIC S9(08) USAGE COMP    VALUE  4504.
005170     05  WK-806-4505-IDX   PIC S9(08) USAGE COMP    VALUE  4505.
005180     05  WK-806-4506-IDX   PIC S9(08) USAGE COMP    VALUE  4506.
005190     05  WK-806-4507-IDX   PIC S9(08) USAGE COMP    VALUE  4507.
005200     05  WK-806-4508-IDX   PIC S9(08) USAGE COMP    VALUE  4508.
005210     05  WK-806-4509-IDX   PIC S9(08) USAGE COMP    VALUE  4509.
005220     05  WK-806-4510-IDX   PIC S9(08) USAGE COMP    VALUE  4510.
005230     05  WK-806-4511-IDX   PIC S9(08) USAGE COMP    VALUE  4511.
005240     05  WK-806-4512-IDX   PIC S9(08) USAGE COMP    VALUE  4512.
005250     05  WK-806-4513-IDX   PIC S9(08) USAGE COMP    VALUE  4513.
005260     05  WK-806-4514-IDX   PIC S9(08) USAGE COMP    VALUE  4514.
005270     05  WK-806-4515-IDX   PIC S9(08) USAGE COMP    VALUE  4515.
005280     05  WK-806-4516-IDX   PIC S9(08) USAGE COMP    VALUE  4516.
005290     05  WK-806-4517-IDX   PIC S9(08) USAGE COMP    VALUE  4517.
005300     05  WK-806-4518-IDX   PIC S9(08) USAGE COMP    VALUE  4518.
005310     05  WK-806-4519-IDX   PIC S9(08) USAGE COMP    VALUE  4519.
005320     05  WK-806-4520-IDX   PIC S9(08) USAGE COMP    VALUE  4520.
005330     05  WK-806-4521-IDX   PIC S9(08) USAGE COMP    VALUE  4521.
005340     05  WK-806-4522-IDX   PIC S9(08) USAGE COMP    VALUE  4522.
005350     05  WK-806-4523-IDX   PIC S9(08) USAGE COMP    VALUE  4523.
005360     05  WK-806-4524-IDX   PIC S9(08) USAGE COMP    VALUE  4524.
005370     05  WK-806-4525-IDX   PIC S9(08) USAGE COMP    VALUE  4525.
005380     05  WK-806-4526-IDX   PIC S9(08) USAGE COMP    VALUE  4526.
005390     05  WK-806-4527-IDX   PIC S9(08) USAGE COMP    VALUE  4527.
005400     05  WK-806-4528-IDX   PIC S9(08) USAGE COMP    VALUE  4528.
005410     05  WK-806-4529-IDX   PIC S9(08) USAGE COMP    VALUE  4529.
005420     05  WK-806-4530-IDX   PIC S9(08) USAGE COMP    VALUE  4530.
005430     05  WK-806-4531-IDX   PIC S9(08) USAGE COMP    VALUE  4531.
005440     05  WK-806-4532-IDX   PIC S9(08) USAGE COMP    VALUE  4532.
005450     05  WK-806-4533-IDX   PIC S9(08) USAGE COMP    VALUE  4533.
005460     05  WK-806-4534-IDX   PIC S9(08) USAGE COMP    VALUE  4534.
005470     05  WK-806-4535-IDX   PIC S9(08) USAGE COMP    VALUE  4535.
005480     05  WK-806-4536-IDX   PIC S9(08) USAGE COMP    VALUE  4536.
005490     05  WK-806-4537-IDX   PIC S9(08) USAGE COMP    VALUE  4537.
005500     05  WK-806-4538-IDX   PIC S9(08) USAGE COMP    VALUE  4538.
005510     05  WK-806-4539-IDX   PIC S9(08) USAGE COMP    VALUE  4539.
005520     05  WK-806-4540-IDX   PIC S9(08) USAGE COMP    VALUE  4540.
005530     05  WK-806-4541-IDX   PIC S9(08) USAGE COMP    VALUE  4541.
005540     05  WK-806-4542-IDX   PIC S9(08) USAGE COMP    VALUE  4542.
005550     05  WK-806-4543-IDX   PIC S9(08) USAGE COMP    VALUE  4543.
005560     05  WK-806-4544-IDX   PIC S9(08) USAGE COMP    VALUE  4544.
005570     05  WK-806-4545-IDX   PIC S9(08) USAGE COMP    VALUE  4545.
005580     05  WK-806-4546-IDX   PIC S9(08) USAGE COMP    VALUE  4546.
005590     05  WK-806-4547-IDX   PIC S9(08) USAGE COMP    VALUE  4547.
005600     05  WK-806-4548-IDX   PIC S9(08) USAGE COMP    VALUE  4548.
005610     05  WK-806-4549-IDX   PIC S9(08) USAGE COMP    VALUE  4549.
005620     05  WK-806-4550-IDX   PIC S9(08) USAGE COMP    VALUE  4550.
005630     05  WK-806-4551-IDX   PIC S9(08) USAGE COMP    VALUE  4551.
005640     05  WK-806-4552-IDX   PIC S9(08) USAGE COMP    VALUE  4552.
005650     05  WK-806-4553-IDX   PIC S9(08) USAGE COMP    VALUE  4553.
005660     05  WK-806-4554-IDX   PIC S9(08) USAGE COMP    VALUE  4554.
005670     05  WK-806-4555-IDX   PIC S9(08) USAGE COMP    VALUE  4555.
005680     05  WK-806-4556-IDX   PIC S9(08) USAGE COMP    VALUE  4556.
005690     05  WK-806-4557-IDX   PIC S9(08) USAGE COMP    VALUE  4557.
005700     05  WK-806-4558-IDX   PIC S9(08) USAGE COMP    VALUE  4558.
005710     05  WK-806-4559-IDX   PIC S9(08) USAGE COMP    VALUE  4559.
005720     05  WK-806-4560-IDX   PIC S9(08) USAGE COMP    VALUE  4560.
005730     05  WK-806-4561-IDX   PIC S9(08) USAGE COMP    VALUE  4561.
005740     05  WK-806-4562-IDX   PIC S9(08) USAGE COMP    VALUE  4562.
005750     05  WK-806-4563-IDX   PIC S9(08) USAGE COMP    VALUE  4563.
005760     05  WK-806-4564-IDX   PIC S9(08) USAGE COMP    VALUE  4564.
005770     05  WK-806-4565-IDX   PIC S9(08) USAGE COMP    VALUE  4565.
005780     05  WK-806-4566-IDX   PIC S9(08) USAGE COMP    VALUE  4566.
005790     05  WK-806-4567-IDX   PIC S9(08) USAGE COMP    VALUE  4567.
005800     05  WK-806-4568-IDX   PIC S9(08) USAGE COMP    VALUE  4568.
005810     05  WK-806-4569-IDX   PIC S9(08) USAGE COMP    VALUE  4569.
005820     05  WK-806-4570-IDX   PIC S9(08) USAGE COMP    VALUE  4570.
005830     05  WK-806-4571-IDX   PIC S9(08) USAGE COMP    VALUE  4571.
005840     05  WK-806-4572-IDX   PIC S9(08) USAGE COMP    VALUE  4572.
005850     05  WK-806-4573-IDX   PIC S9(08) USAGE COMP    VALUE  4573.
005860     05  WK-806-4574-IDX   PIC S9(08) USAGE COMP    VALUE  4574.
005870     05  WK-806-4575-IDX   PIC S9(08) USAGE COMP    VALUE  4575.
005880     05  WK-806-4576-IDX   PIC S9(08) USAGE COMP    VALUE  4576.
005890     05  WK-806-4577-IDX   PIC S9(08) USAGE COMP    VALUE  4577.
005900     05  WK-806-4578-IDX   PIC S9(08) USAGE COMP    VALUE  4578.
005910     05  WK-806-4579-IDX   PIC S9(08) USAGE COMP    VALUE  4579.
005920     05  WK-806-4580-IDX   PIC S9(08) USAGE COMP    VALUE  4580.
005930     05  WK-806-4581-IDX   PIC S9(08) USAGE COMP    VALUE  4581.
005940     05  WK-806-4582-IDX   PIC S9(08) USAGE COMP    VALUE  4582.
005950     05  WK-806-4583-IDX   PIC S9(08) USAGE COMP    VALUE  4583.
005960     05  WK-806-4584-IDX   PIC S9(08) USAGE COMP    VALUE  4584.
005970     05  WK-806-4585-IDX   PIC S9(08) USAGE COMP    VALUE  4585.
005980     05  WK-806-4586-IDX   PIC S9(08) USAGE COMP    VALUE  4586.
005990     05  WK-806-4587-IDX   PIC S9(08) USAGE COMP    VALUE  4587.
006000     05  WK-806-4588-IDX   PIC S9(08) USAGE COMP    VALUE  4588.
006010     05  WK-806-4589-IDX   PIC S9(08) USAGE COMP    VALUE  4589.
006020     05  WK-806-4590-IDX   PIC S9(08) USAGE COMP    VALUE  4590.
006030     05  WK-806-4591-IDX   PIC S9(08) USAGE COMP    VALUE  4591.
006040     05  WK-806-4592-IDX   PIC S9(08) USAGE COMP    VALUE  4592.
006050     05  WK-806-4593-IDX   PIC S9(08) USAGE COMP    VALUE  4593.
006060     05  WK-806-4594-IDX   PIC S9(08) USAGE COMP    VALUE  4594.
006070     05  WK-806-4595-IDX   PIC S9(08) USAGE COMP    VALUE  4595.
006080     05  WK-806-4596-IDX   PIC S9(08) USAGE COMP    VALUE  4596.
006090     05  WK-806-4597-IDX   PIC S9(08) USAGE COMP    VALUE  4597.
006100     05  WK-806-4598-IDX   PIC S9(08) USAGE COMP    VALUE  4598.
006110     05  WK-806-4599-IDX   PIC S9(08) USAGE COMP    VALUE  4599.
006120     05  WK-806-4600-IDX   PIC S9(08) USAGE COMP    VALUE  4600.
006130     05  WK-806-4601-IDX   PIC S9(08) USAGE COMP    VALUE  4601.
006140     05  WK-806-4602-IDX   PIC S9(08) USAGE COMP    VALUE  4602.
006150     05  WK-806-4603-IDX   PIC S9(08) USAGE COMP    VALUE  4603.
006160     05  WK-806-4604-IDX   PIC S9(08) USAGE COMP    VALUE  4604.
006170     05  WK-806-4605-IDX   PIC S9(08) USAGE COMP    VALUE  4605.
006180     05  WK-806-4606-IDX   PIC S9(08) USAGE COMP    VALUE  4606.
006190     05  WK-806-4607-IDX   PIC S9(08) USAGE COMP    VALUE  4607.
006200     05  WK-806-4608-IDX   PIC S9(08) USAGE COMP    VALUE  4608.
006210     05  WK-806-4609-IDX   PIC S9(08) USAGE COMP    VALUE  4609.
006220     05  WK-806-4610-IDX   PIC S9(08) USAGE COMP    VALUE  4610.
006230     05  WK-806-4611-IDX   PIC S9(08) USAGE COMP    VALUE  4611.
006240     05  WK-806-4612-IDX   PIC S9(08) USAGE COMP    VALUE  4612.
006250     05  WK-806-4613-IDX   PIC S9(08) USAGE COMP    VALUE  4613.
006260     05  WK-806-4614-IDX   PIC S9(08) USAGE COMP    VALUE  4614.
006270     05  WK-806-4615-IDX   PIC S9(08) USAGE COMP    VALUE  4615.
006280     05  WK-806-4616-IDX   PIC S9(08) USAGE COMP    VALUE  4616.
006290     05  WK-806-4617-IDX   PIC S9(08) USAGE COMP    VALUE  4617.
006300     05  WK-806-4618-IDX   PIC S9(08) USAGE COMP    VALUE  4618.
006310     05  WK-806-4619-IDX   PIC S9(08) USAGE COMP    VALUE  4619.
006320     05  WK-806-4620-IDX   PIC S9(08) USAGE COMP    VALUE  4620.
006330     05  WK-806-4621-IDX   PIC S9(08) USAGE COMP    VALUE  4621.
006340     05  WK-806-4622-IDX   PIC S9(08) USAGE COMP    VALUE  4622.
006350     05  WK-806-4623-IDX   PIC S9(08) USAGE COMP    VALUE  4623.
006360     05  WK-806-4624-IDX   PIC S9(08) USAGE COMP    VALUE  4624.
006370     05  WK-806-4625-IDX   PIC S9(08) USAGE COMP    VALUE  4625.
006380     05  WK-806-4626-IDX   PIC S9(08) USAGE COMP    VALUE  4626.
006390     05  WK-806-4627-IDX   PIC S9(08) USAGE COMP    VALUE  4627.
006400     05  WK-806-4628-IDX   PIC S9(08) USAGE COMP    VALUE  4628.
006410     05  WK-806-4629-IDX   PIC S9(08) USAGE COMP    VALUE  4629.
006420     05  WK-806-4630-IDX   PIC S9(08) USAGE COMP    VALUE  4630.
006430     05  WK-806-4631-IDX   PIC S9(08) USAGE COMP    VALUE  4631.
006440     05  WK-806-4632-IDX   PIC S9(08) USAGE COMP    VALUE  4632.
006450     05  WK-806-4633-IDX   PIC S9(08) USAGE COMP    VALUE  4633.
006460     05  WK-806-4634-IDX   PIC S9(08) USAGE COMP    VALUE  4634.
006470     05  WK-806-4635-IDX   PIC S9(08) USAGE COMP    VALUE  4635.
006480     05  WK-806-4636-IDX   PIC S9(08) USAGE COMP    VALUE  4636.
006490     05  WK-806-4637-IDX   PIC S9(08) USAGE COMP    VALUE  4637.
006500     05  WK-806-4638-IDX   PIC S9(08) USAGE COMP    VALUE  4638.
006510     05  WK-806-4639-IDX   PIC S9(08) USAGE COMP    VALUE  4639.
006520     05  WK-806-4640-IDX   PIC S9(08) USAGE COMP    VALUE  4640.
006530     05  WK-806-4641-IDX   PIC S9(08) USAGE COMP    VALUE  4641.
006540     05  WK-806-4642-IDX   PIC S9(08) USAGE COMP    VALUE  4642.
006550     05  WK-806-4643-IDX   PIC S9(08) USAGE COMP    VALUE  4643.
006560     05  WK-806-4644-IDX   PIC S9(08) USAGE COMP    VALUE  4644.
006570     05  WK-806-4645-IDX   PIC S9(08) USAGE COMP    VALUE  4645.
006580     05  WK-806-4646-IDX   PIC S9(08) USAGE COMP    VALUE  4646.
006590     05  WK-806-4647-IDX   PIC S9(08) USAGE COMP    VALUE  4647.
006600     05  WK-806-4648-IDX   PIC S9(08) USAGE COMP    VALUE  4648.
006610     05  WK-806-4649-IDX   PIC S9(08) USAGE COMP    VALUE  4649.
006620     05  WK-806-4650-IDX   PIC S9(08) USAGE COMP    VALUE  4650.
006630     05  WK-806-4651-IDX   PIC S9(08) USAGE COMP    VALUE  4651.
006640     05  WK-806-4652-IDX   PIC S9(08) USAGE COMP    VALUE  4652.
006650     05  WK-806-4653-IDX   PIC S9(08) USAGE COMP    VALUE  4653.
006660     05  WK-806-4654-IDX   PIC S9(08) USAGE COMP    VALUE  4654.
006670     05  WK-806-4655-IDX   PIC S9(08) USAGE COMP    VALUE  4655.
006680     05  WK-806-4656-IDX   PIC S9(08) USAGE COMP    VALUE  4656.
006690     05  WK-806-4657-IDX   PIC S9(08) USAGE COMP    VALUE  4657.
006700     05  WK-806-4658-IDX   PIC S9(08) USAGE COMP    VALUE  4658.
006710     05  WK-806-4659-IDX   PIC S9(08) USAGE COMP    VALUE  4659.
006720     05  WK-806-4660-IDX   PIC S9(08) USAGE COMP    VALUE  4660.
006730     05  WK-806-4661-IDX   PIC S9(08) USAGE COMP    VALUE  4661.
006740     05  WK-806-4662-IDX   PIC S9(08) USAGE COMP    VALUE  4662.
006750     05  WK-806-4663-IDX   PIC S9(08) USAGE COMP    VALUE  4663.
006760     05  WK-806-4664-IDX   PIC S9(08) USAGE COMP    VALUE  4664.
006770     05  WK-806-4665-IDX   PIC S9(08) USAGE COMP    VALUE  4665.
006780     05  WK-806-4666-IDX   PIC S9(08) USAGE COMP    VALUE  4666.
006790     05  WK-806-4667-IDX   PIC S9(08) USAGE COMP    VALUE  4667.
006800     05  WK-806-4668-IDX   PIC S9(08) USAGE COMP    VALUE  4668.
006810     05  WK-806-4669-IDX   PIC S9(08) USAGE COMP    VALUE  4669.
006820     05  WK-806-4670-IDX   PIC S9(08) USAGE COMP    VALUE  4670.
006830     05  WK-806-4671-IDX   PIC S9(08) USAGE COMP    VALUE  4671.
006840     05  WK-806-4672-IDX   PIC S9(08) USAGE COMP    VALUE  4672.
006850     05  WK-806-4673-IDX   PIC S9(08) USAGE COMP    VALUE  4673.
006860     05  WK-806-4674-IDX   PIC S9(08) USAGE COMP    VALUE  4674.
006870     05  WK-806-4675-IDX   PIC S9(08) USAGE COMP    VALUE  4675.
006880     05  WK-806-4676-IDX   PIC S9(08) USAGE COMP    VALUE  4676.
006890     05  WK-806-4677-IDX   PIC S9(08) USAGE COMP    VALUE  4677.
006900     05  WK-806-4678-IDX   PIC S9(08) USAGE COMP    VALUE  4678.
006910     05  WK-806-4679-IDX   PIC S9(08) USAGE COMP    VALUE  4679.
006920     05  WK-806-4680-IDX   PIC S9(08) USAGE COMP    VALUE  4680.
006930     05  WK-806-4681-IDX   PIC S9(08) USAGE COMP    VALUE  4681.
006940     05  WK-806-4682-IDX   PIC S9(08) USAGE COMP    VALUE  4682.
006950     05  WK-806-4683-IDX   PIC S9(08) USAGE COMP    VALUE  4683.
006960     05  WK-806-4684-IDX   PIC S9(08) USAGE COMP    VALUE  4684.
006970     05  WK-806-4685-IDX   PIC S9(08) USAGE COMP    VALUE  4685.
006980     05  WK-806-4686-IDX   PIC S9(08) USAGE COMP    VALUE  4686.
006990     05  WK-806-4687-IDX   PIC S9(08) USAGE COMP    VALUE  4687.
007000     05  WK-806-4688-IDX   PIC S9(08) USAGE COMP    VALUE  4688.
007010     05  WK-806-4689-IDX   PIC S9(08) USAGE COMP    VALUE  4689.
007020     05  WK-806-4690-IDX   PIC S9(08) USAGE COMP    VALUE  4690.
007030     05  WK-806-4691-IDX   PIC S9(08) USAGE COMP    VALUE  4691.
007040     05  WK-806-4692-IDX   PIC S9(08) USAGE COMP    VALUE  4692.
007050     05  WK-806-4693-IDX   PIC S9(08) USAGE COMP    VALUE  4693.
007060     05  WK-806-4694-IDX   PIC S9(08) USAGE COMP    VALUE  4694.
007070     05  WK-806-4695-IDX   PIC S9(08) USAGE COMP    VALUE  4695.
007080     05  WK-806-4696-IDX   PIC S9(08) USAGE COMP    VALUE  4696.
007090     05  WK-806-4697-IDX   PIC S9(08) USAGE COMP    VALUE  4697.
007100     05  WK-806-4698-IDX   PIC S9(08) USAGE COMP    VALUE  4698.
007110     05  WK-806-4699-IDX   PIC S9(08) USAGE COMP    VALUE  4699.
007120     05  WK-806-4700-IDX   PIC S9(08) USAGE COMP    VALUE  4700.
007130     05  WK-806-4701-IDX   PIC S9(08) USAGE COMP    VALUE  4701.
007140     05  WK-806-4702-IDX   PIC S9(08) USAGE COMP    VALUE  4702.
007150     05  WK-806-4703-IDX   PIC S9(08) USAGE COMP    VALUE  4703.
007160     05  WK-806-4704-IDX   PIC S9(08) USAGE COMP    VALUE  4704.
007170     05  WK-806-4705-IDX   PIC S9(08) USAGE COMP    VALUE  4705.
007180     05  WK-806-4706-IDX   PIC S9(08) USAGE COMP    VALUE  4706.
007190     05  WK-806-4707-IDX   PIC S9(08) USAGE COMP    VALUE  4707.
007200     05  WK-806-4708-IDX   PIC S9(08) USAGE COMP    VALUE  4708.
007210     05  WK-806-4709-IDX   PIC S9(08) USAGE COMP    VALUE  4709.
007220     05  WK-806-4710-IDX   PIC S9(08) USAGE COMP    VALUE  4710.
007230     05  WK-806-4711-IDX   PIC S9(08) USAGE COMP    VALUE  4711.
007240     05  WK-806-4712-IDX   PIC S9(08) USAGE COMP    VALUE  4712.
007250     05  WK-806-4713-IDX   PIC S9(08) USAGE COMP    VALUE  4713.
007260     05  WK-806-4714-IDX   PIC S9(08) USAGE COMP    VALUE  4714.
007270     05  WK-806-4715-IDX   PIC S9(08) USAGE COMP    VALUE  4715.
007280     05  WK-806-4716-IDX   PIC S9(08) USAGE COMP    VALUE  4716.
007290     05  WK-806-4717-IDX   PIC S9(08) USAGE COMP    VALUE  4717.
007300     05  WK-806-4718-IDX   PIC S9(08) USAGE COMP    VALUE  4718.
007310     05  WK-806-4719-IDX   PIC S9(08) USAGE COMP    VALUE  4719.
007320     05  WK-806-4720-IDX   PIC S9(08) USAGE COMP    VALUE  4720.
007330     05  WK-806-4721-IDX   PIC S9(08) USAGE COMP    VALUE  4721.
007340     05  WK-806-4722-IDX   PIC S9(08) USAGE COMP    VALUE  4722.
007350     05  WK-806-4723-IDX   PIC S9(08) USAGE COMP    VALUE  4723.
007360     05  WK-806-4724-IDX   PIC S9(08) USAGE COMP    VALUE  4724.
007370     05  WK-806-4725-IDX   PIC S9(08) USAGE COMP    VALUE  4725.
007380     05  WK-806-4726-IDX   PIC S9(08) USAGE COMP    VALUE  4726.
007390     05  WK-806-4727-IDX   PIC S9(08) USAGE COMP    VALUE  4727.
007400     05  WK-806-4728-IDX   PIC S9(08) USAGE COMP    VALUE  4728.
007410     05  WK-806-4729-IDX   PIC S9(08) USAGE COMP    VALUE  4729.
007420     05  WK-806-4730-IDX   PIC S9(08) USAGE COMP    VALUE  4730.
007430     05  WK-806-4731-IDX   PIC S9(08) USAGE COMP    VALUE  4731.
007440     05  WK-806-4732-IDX   PIC S9(08) USAGE COMP    VALUE  4732.
007450     05  WK-806-4733-IDX   PIC S9(08) USAGE COMP    VALUE  4733.
007460     05  WK-806-4734-IDX   PIC S9(08) USAGE COMP    VALUE  4734.
007470     05  WK-806-4735-IDX   PIC S9(08) USAGE COMP    VALUE  4735.
007480     05  WK-806-4736-IDX   PIC S9(08) USAGE COMP    VALUE  4736.
007490     05  WK-806-4737-IDX   PIC S9(08) USAGE COMP    VALUE  4737.
007500     05  WK-806-4738-IDX   PIC S9(08) USAGE COMP    VALUE  4738.
007510     05  WK-806-4739-IDX   PIC S9(08) USAGE COMP    VALUE  4739.
007520     05  WK-806-4740-IDX   PIC S9(08) USAGE COMP    VALUE  4740.
007530     05  WK-806-4741-IDX   PIC S9(08) USAGE COMP    VALUE  4741.
007540     05  WK-806-4742-IDX   PIC S9(08) USAGE COMP    VALUE  4742.
007550     05  WK-806-4743-IDX   PIC S9(08) USAGE COMP    VALUE  4743.
007560     05  WK-806-4744-IDX   PIC S9(08) USAGE COMP    VALUE  4744.
007570     05  WK-806-4745-IDX   PIC S9(08) USAGE COMP    VALUE  4745.
007580     05  WK-806-4746-IDX   PIC S9(08) USAGE COMP    VALUE  4746.
007590     05  WK-806-4747-IDX   PIC S9(08) USAGE COMP    VALUE  4747.
007600     05  WK-806-4748-IDX   PIC S9(08) USAGE COMP    VALUE  4748.
007610     05  WK-806-4749-IDX   PIC S9(08) USAGE COMP    VALUE  4749.
007620     05  WK-806-4750-IDX   PIC S9(08) USAGE COMP    VALUE  4750.
007630     05  WK-806-4751-IDX   PIC S9(08) USAGE COMP    VALUE  4751.
007640     05  WK-806-4752-IDX   PIC S9(08) USAGE COMP    VALUE  4752.
007650     05  WK-806-4753-IDX   PIC S9(08) USAGE COMP    VALUE  4753.
007660     05  WK-806-4754-IDX   PIC S9(08) USAGE COMP    VALUE  4754.
007670     05  WK-806-4755-IDX   PIC S9(08) USAGE COMP    VALUE  4755.
007680     05  WK-806-4756-IDX   PIC S9(08) USAGE COMP    VALUE  4756.
007690     05  WK-806-4757-IDX   PIC S9(08) USAGE COMP    VALUE  4757.
007700     05  WK-806-4758-IDX   PIC S9(08) USAGE COMP    VALUE  4758.
007710     05  WK-806-4759-IDX   PIC S9(08) USAGE COMP    VALUE  4759.
007720     05  WK-806-4760-IDX   PIC S9(08) USAGE COMP    VALUE  4760.
007730     05  WK-806-4761-IDX   PIC S9(08) USAGE COMP    VALUE  4761.
007740     05  WK-806-4762-IDX   PIC S9(08) USAGE COMP    VALUE  4762.
007750     05  WK-806-4763-IDX   PIC S9(08) USAGE COMP    VALUE  4763.
007760     05  WK-806-4764-IDX   PIC S9(08) USAGE COMP    VALUE  4764.
007770     05  WK-806-4765-IDX   PIC S9(08) USAGE COMP    VALUE  4765.
007780     05  WK-806-4766-IDX   PIC S9(08) USAGE COMP    VALUE  4766.
007790     05  WK-806-4767-IDX   PIC S9(08) USAGE COMP    VALUE  4767.
007800     05  WK-806-4768-IDX   PIC S9(08) USAGE COMP    VALUE  4768.
007810     05  WK-806-4769-IDX   PIC S9(08) USAGE COMP    VALUE  4769.
007820     05  WK-806-4770-IDX   PIC S9(08) USAGE COMP    VALUE  4770.
007830     05  WK-806-4771-IDX   PIC S9(08) USAGE COMP    VALUE  4771.
007840     05  WK-806-4772-IDX   PIC S9(08) USAGE COMP    VALUE  4772.
007850     05  WK-806-4773-IDX   PIC S9(08) USAGE COMP    VALUE  4773.
007860     05  WK-806-4774-IDX   PIC S9(08) USAGE COMP    VALUE  4774.
007870     05  WK-806-4775-IDX   PIC S9(08) USAGE COMP    VALUE  4775.
007880     05  WK-806-4776-IDX   PIC S9(08) USAGE COMP    VALUE  4776.
007890     05  WK-806-4777-IDX   PIC S9(08) USAGE COMP    VALUE  4777.
007900     05  WK-806-4778-IDX   PIC S9(08) USAGE COMP    VALUE  4778.
007910     05  WK-806-4779-IDX   PIC S9(08) USAGE COMP    VALUE  4779.
007920     05  WK-806-4780-IDX   PIC S9(08) USAGE COMP    VALUE  4780.
007930     05  WK-806-4781-IDX   PIC S9(08) USAGE COMP    VALUE  4781.
007940     05  WK-806-4782-IDX   PIC S9(08) USAGE COMP    VALUE  4782.
007950     05  WK-806-4783-IDX   PIC S9(08) USAGE COMP    VALUE  4783.
007960     05  WK-806-4784-IDX   PIC S9(08) USAGE COMP    VALUE  4784.
007970     05  WK-806-4785-IDX   PIC S9(08) USAGE COMP    VALUE  4785.
007980     05  WK-806-4786-IDX   PIC S9(08) USAGE COMP    VALUE  4786.
007990     05  WK-806-4787-IDX   PIC S9(08) USAGE COMP    VALUE  4787.
008000     05  WK-806-4788-IDX   PIC S9(08) USAGE COMP    VALUE  4788.
008010     05  WK-806-4789-IDX   PIC S9(08) USAGE COMP    VALUE  4789.
008020     05  WK-806-4790-IDX   PIC S9(08) USAGE COMP    VALUE  4790.
008030     05  WK-806-4791-IDX   PIC S9(08) USAGE COMP    VALUE  4791.
008040     05  WK-806-4792-IDX   PIC S9(08) USAGE COMP    VALUE  4792.
008050     05  WK-806-4793-IDX   PIC S9(08) USAGE COMP    VALUE  4793.
008060     05  WK-806-4794-IDX   PIC S9(08) USAGE COMP    VALUE  4794.
008070     05  WK-806-4795-IDX   PIC S9(08) USAGE COMP    VALUE  4795.
008080     05  WK-806-4796-IDX   PIC S9(08) USAGE COMP    VALUE  4796.
008090     05  WK-806-4797-IDX   PIC S9(08) USAGE COMP    VALUE  4797.
008100     05  WK-806-4798-IDX   PIC S9(08) USAGE COMP    VALUE  4798.
008110     05  WK-806-4799-IDX   PIC S9(08) USAGE COMP    VALUE  4799.
008120     05  WK-806-4800-IDX   PIC S9(08) USAGE COMP    VALUE  4800.
008130     05  WK-806-4801-IDX   PIC S9(08) USAGE COMP    VALUE  4801.
008140     05  WK-806-4802-IDX   PIC S9(08) USAGE COMP    VALUE  4802.
008150     05  WK-806-4803-IDX   PIC S9(08) USAGE COMP    VALUE  4803.
008160     05  WK-806-4804-IDX   PIC S9(08) USAGE COMP    VALUE  4804.
008170     05  WK-806-4805-IDX   PIC S9(08) USAGE COMP    VALUE  4805.
008180     05  WK-806-4806-IDX   PIC S9(08) USAGE COMP    VALUE  4806.
008190     05  WK-806-4807-IDX   PIC S9(08) USAGE COMP    VALUE  4807.
008200     05  WK-806-4808-IDX   PIC S9(08) USAGE COMP    VALUE  4808.
008210     05  WK-806-4809-IDX   PIC S9(08) USAGE COMP    VALUE  4809.
008220     05  WK-806-4810-IDX   PIC S9(08) USAGE COMP    VALUE  4810.
008230     05  WK-806-4811-IDX   PIC S9(08) USAGE COMP    VALUE  4811.
008240     05  WK-806-4812-IDX   PIC S9(08) USAGE COMP    VALUE  4812.
008250     05  WK-806-4813-IDX   PIC S9(08) USAGE COMP    VALUE  4813.
008260     05  WK-806-4814-IDX   PIC S9(08) USAGE COMP    VALUE  4814.
008270     05  WK-806-4815-IDX   PIC S9(08) USAGE COMP    VALUE  4815.
008280     05  WK-806-4816-IDX   PIC S9(08) USAGE COMP    VALUE  4816.
008290     05  WK-806-4817-IDX   PIC S9(08) USAGE COMP    VALUE  4817.
008300     05  WK-806-4818-IDX   PIC S9(08) USAGE COMP    VALUE  4818.
008310     05  WK-806-4819-IDX   PIC S9(08) USAGE COMP    VALUE  4819.
008320     05  WK-806-4820-IDX   PIC S9(08) USAGE COMP    VALUE  4820.
008330     05  WK-806-4821-IDX   PIC S9(08) USAGE COMP    VALUE  4821.
008340     05  WK-806-4822-IDX   PIC S9(08) USAGE COMP    VALUE  4822.
008350     05  WK-806-4823-IDX   PIC S9(08) USAGE COMP    VALUE  4823.
008360     05  WK-806-4824-IDX   PIC S9(08) USAGE COMP    VALUE  4824.
008370     05  WK-806-4825-IDX   PIC S9(08) USAGE COMP    VALUE  4825.
008380     05  WK-806-4826-IDX   PIC S9(08) USAGE COMP    VALUE  4826.
008390     05  WK-806-4827-IDX   PIC S9(08) USAGE COMP    VALUE  4827.
008400     05  WK-806-4828-IDX   PIC S9(08) USAGE COMP    VALUE  4828.
008410     05  WK-806-4829-IDX   PIC S9(08) USAGE COMP    VALUE  4829.
008420     05  WK-806-4830-IDX   PIC S9(08) USAGE COMP    VALUE  4830.
008430     05  WK-806-4831-IDX   PIC S9(08) USAGE COMP    VALUE  4831.
008440     05  WK-806-4832-IDX   PIC S9(08) USAGE COMP    VALUE  4832.
008450     05  WK-806-4833-IDX   PIC S9(08) USAGE COMP    VALUE  4833.
008460     05  WK-806-4834-IDX   PIC S9(08) USAGE COMP    VALUE  4834.
008470     05  WK-806-4835-IDX   PIC S9(08) USAGE COMP    VALUE  4835.
008480     05  WK-806-4836-IDX   PIC S9(08) USAGE COMP    VALUE  4836.
008490     05  WK-806-4837-IDX   PIC S9(08) USAGE COMP    VALUE  4837.
008500     05  WK-806-4838-IDX   PIC S9(08) USAGE COMP    VALUE  4838.
008510     05  WK-806-4839-IDX   PIC S9(08) USAGE COMP    VALUE  4839.
008520     05  WK-806-4840-IDX   PIC S9(08) USAGE COMP    VALUE  4840.
008530     05  WK-806-4841-IDX   PIC S9(08) USAGE COMP    VALUE  4841.
008540     05  WK-806-4842-IDX   PIC S9(08) USAGE COMP    VALUE  4842.
008550     05  WK-806-4843-IDX   PIC S9(08) USAGE COMP    VALUE  4843.
008560     05  WK-806-4844-IDX   PIC S9(08) USAGE COMP    VALUE  4844.
008570     05  WK-806-4845-IDX   PIC S9(08) USAGE COMP    VALUE  4845.
008580     05  WK-806-4846-IDX   PIC S9(08) USAGE COMP    VALUE  4846.
008590     05  WK-806-4847-IDX   PIC S9(08) USAGE COMP    VALUE  4847.
008600     05  WK-806-4848-IDX   PIC S9(08) USAGE COMP    VALUE  4848.
008610     05  WK-806-4849-IDX   PIC S9(08) USAGE COMP    VALUE  4849.
008620     05  WK-806-4850-IDX   PIC S9(08) USAGE COMP    VALUE  4850.
008630     05  WK-806-4851-IDX   PIC S9(08) USAGE COMP    VALUE  4851.
008640     05  WK-806-4852-IDX   PIC S9(08) USAGE COMP    VALUE  4852.
008650     05  WK-806-4853-IDX   PIC S9(08) USAGE COMP    VALUE  4853.
008660     05  WK-806-4854-IDX   PIC S9(08) USAGE COMP    VALUE  4854.
008670     05  WK-806-4855-IDX   PIC S9(08) USAGE COMP    VALUE  4855.
008680     05  WK-806-4856-IDX   PIC S9(08) USAGE COMP    VALUE  4856.
008690     05  WK-806-4857-IDX   PIC S9(08) USAGE COMP    VALUE  4857.
008700     05  WK-806-4858-IDX   PIC S9(08) USAGE COMP    VALUE  4858.
008710     05  WK-806-4859-IDX   PIC S9(08) USAGE COMP    VALUE  4859.
008720     05  WK-806-4860-IDX   PIC S9(08) USAGE COMP    VALUE  4860.
008730     05  WK-806-4861-IDX   PIC S9(08) USAGE COMP    VALUE  4861.
008740     05  WK-806-4862-IDX   PIC S9(08) USAGE COMP    VALUE  4862.
008750     05  WK-806-4863-IDX   PIC S9(08) USAGE COMP    VALUE  4863.
008760     05  WK-806-4864-IDX   PIC S9(08) USAGE COMP    VALUE  4864.
008770     05  WK-806-4865-IDX   PIC S9(08) USAGE COMP    VALUE  4865.
008780     05  WK-806-4866-IDX   PIC S9(08) USAGE COMP    VALUE  4866.
008790     05  WK-806-4867-IDX   PIC S9(08) USAGE COMP    VALUE  4867.
008800     05  WK-806-4868-IDX   PIC S9(08) USAGE COMP    VALUE  4868.
008810     05  WK-806-4869-IDX   PIC S9(08) USAGE COMP    VALUE  4869.
008820     05  WK-806-4870-IDX   PIC S9(08) USAGE COMP    VALUE  4870.
008830     05  WK-806-4871-IDX   PIC S9(08) USAGE COMP    VALUE  4871.
008840     05  WK-806-4872-IDX   PIC S9(08) USAGE COMP    VALUE  4872.
008850     05  WK-806-4873-IDX   PIC S9(08) USAGE COMP    VALUE  4873.
008860     05  WK-806-4874-IDX   PIC S9(08) USAGE COMP    VALUE  4874.
008870     05  WK-806-4875-IDX   PIC S9(08) USAGE COMP    VALUE  4875.
008880     05  WK-806-4876-IDX   PIC S9(08) USAGE COMP    VALUE  4876.
008890     05  WK-806-4877-IDX   PIC S9(08) USAGE COMP    VALUE  4877.
008900     05  WK-806-4878-IDX   PIC S9(08) USAGE COMP    VALUE  4878.
008910     05  WK-806-4879-IDX   PIC S9(08) USAGE COMP    VALUE  4879.
008920     05  WK-806-4880-IDX   PIC S9(08) USAGE COMP    VALUE  4880.
008930     05  WK-806-4881-IDX   PIC S9(08) USAGE COMP    VALUE  4881.
008940     05  WK-806-4882-IDX   PIC S9(08) USAGE COMP    VALUE  4882.
008950     05  WK-806-4883-IDX   PIC S9(08) USAGE COMP    VALUE  4883.
008960     05  WK-806-4884-IDX   PIC S9(08) USAGE COMP    VALUE  4884.
008970     05  WK-806-4885-IDX   PIC S9(08) USAGE COMP    VALUE  4885.
008980     05  WK-806-4886-IDX   PIC S9(08) USAGE COMP    VALUE  4886.
008990     05  WK-806-4887-IDX   PIC S9(08) USAGE COMP    VALUE  4887.
009000     05  WK-806-4888-IDX   PIC S9(08) USAGE COMP    VALUE  4888.
009010     05  WK-806-4889-IDX   PIC S9(08) USAGE COMP    VALUE  4889.
009020     05  WK-806-4890-IDX   PIC S9(08) USAGE COMP    VALUE  4890.
009030     05  WK-806-4891-IDX   PIC S9(08) USAGE COMP    VALUE  4891.
009040     05  WK-806-4892-IDX   PIC S9(08) USAGE COMP    VALUE  4892.
009050     05  WK-806-4893-IDX   PIC S9(08) USAGE COMP    VALUE  4893.
009060     05  WK-806-4894-IDX   PIC S9(08) USAGE COMP    VALUE  4894.
009070     05  WK-806-4895-IDX   PIC S9(08) USAGE COMP    VALUE  4895.
009080     05  WK-806-4896-IDX   PIC S9(08) USAGE COMP    VALUE  4896.
009090     05  WK-806-4897-IDX   PIC S9(08) USAGE COMP    VALUE  4897.
009100     05  WK-806-4898-IDX   PIC S9(08) USAGE COMP    VALUE  4898.
009110     05  WK-806-4899-IDX   PIC S9(08) USAGE COMP    VALUE  4899.
009120     05  WK-806-4900-IDX   PIC S9(08) USAGE COMP    VALUE  4900.
009130     05  WK-806-4901-IDX   PIC S9(08) USAGE COMP    VALUE  4901.
009140     05  WK-806-4902-IDX   PIC S9(08) USAGE COMP    VALUE  4902.
009150     05  WK-806-4903-IDX   PIC S9(08) USAGE COMP    VALUE  4903.
009160     05  WK-806-4904-IDX   PIC S9(08) USAGE COMP    VALUE  4904.
009170     05  WK-806-4905-IDX   PIC S9(08) USAGE COMP    VALUE  4905.
009180     05  WK-806-4906-IDX   PIC S9(08) USAGE COMP    VALUE  4906.
009190     05  WK-806-4907-IDX   PIC S9(08) USAGE COMP    VALUE  4907.
009200     05  WK-806-4908-IDX   PIC S9(08) USAGE COMP    VALUE  4908.
009210     05  WK-806-4909-IDX   PIC S9(08) USAGE COMP    VALUE  4909.
009220     05  WK-806-4910-IDX   PIC S9(08) USAGE COMP    VALUE  4910.
009230     05  WK-806-4911-IDX   PIC S9(08) USAGE COMP    VALUE  4911.
009240     05  WK-806-4912-IDX   PIC S9(08) USAGE COMP    VALUE  4912.
009250     05  WK-806-4913-IDX   PIC S9(08) USAGE COMP    VALUE  4913.
009260     05  WK-806-4914-IDX   PIC S9(08) USAGE COMP    VALUE  4914.
009270     05  WK-806-4915-IDX   PIC S9(08) USAGE COMP    VALUE  4915.
009280     05  WK-806-4916-IDX   PIC S9(08) USAGE COMP    VALUE  4916.
009290     05  WK-806-4917-IDX   PIC S9(08) USAGE COMP    VALUE  4917.
009300     05  WK-806-4918-IDX   PIC S9(08) USAGE COMP    VALUE  4918.
009310     05  WK-806-4919-IDX   PIC S9(08) USAGE COMP    VALUE  4919.
009320     05  WK-806-4920-IDX   PIC S9(08) USAGE COMP    VALUE  4920.
009330     05  WK-806-4921-IDX   PIC S9(08) USAGE COMP    VALUE  4921.
009340     05  WK-806-4922-IDX   PIC S9(08) USAGE COMP    VALUE  4922.
009350     05  WK-806-4923-IDX   PIC S9(08) USAGE COMP    VALUE  4923.
009360     05  WK-806-4924-IDX   PIC S9(08) USAGE COMP    VALUE  4924.
009370     05  WK-806-4925-IDX   PIC S9(08) USAGE COMP    VALUE  4925.
009380     05  WK-806-4926-IDX   PIC S9(08) USAGE COMP    VALUE  4926.
009390     05  WK-806-4927-IDX   PIC S9(08) USAGE COMP    VALUE  4927.
009400     05  WK-806-4928-IDX   PIC S9(08) USAGE COMP    VALUE  4928.
009410     05  WK-806-4929-IDX   PIC S9(08) USAGE COMP    VALUE  4929.
009420     05  WK-806-4930-IDX   PIC S9(08) USAGE COMP    VALUE  4930.
009430     05  WK-806-4931-IDX   PIC S9(08) USAGE COMP    VALUE  4931.
009440     05  WK-806-4932-IDX   PIC S9(08) USAGE COMP    VALUE  4932.
009450     05  WK-806-4933-IDX   PIC S9(08) USAGE COMP    VALUE  4933.
009460     05  WK-806-4934-IDX   PIC S9(08) USAGE COMP    VALUE  4934.
009470     05  WK-806-4935-IDX   PIC S9(08) USAGE COMP    VALUE  4935.
009480     05  WK-806-4936-IDX   PIC S9(08) USAGE COMP    VALUE  4936.
009490     05  WK-806-4937-IDX   PIC S9(08) USAGE COMP    VALUE  4937.
009500     05  WK-806-4938-IDX   PIC S9(08) USAGE COMP    VALUE  4938.
009510     05  WK-806-4939-IDX   PIC S9(08) USAGE COMP    VALUE  4939.
009520     05  WK-806-4940-IDX   PIC S9(08) USAGE COMP    VALUE  4940.
009530     05  WK-806-4941-IDX   PIC S9(08) USAGE COMP    VALUE  4941.
009540     05  WK-806-4942-IDX   PIC S9(08) USAGE COMP    VALUE  4942.
009550     05  WK-806-4943-IDX   PIC S9(08) USAGE COMP    VALUE  4943.
009560     05  WK-806-4944-IDX   PIC S9(08) USAGE COMP    VALUE  4944.
009570     05  WK-806-4945-IDX   PIC S9(08) USAGE COMP    VALUE  4945.
009580     05  WK-806-4946-IDX   PIC S9(08) USAGE COMP    VALUE  4946.
009590     05  WK-806-4947-IDX   PIC S9(08) USAGE COMP    VALUE  4947.
009600     05  WK-806-4948-IDX   PIC S9(08) USAGE COMP    VALUE  4948.
009610     05  WK-806-4949-IDX   PIC S9(08) USAGE COMP    VALUE  4949.
009620     05  WK-806-4950-IDX   PIC S9(08) USAGE COMP    VALUE  4950.
009630     05  WK-806-4951-IDX   PIC S9(08) USAGE COMP    VALUE  4951.
009640     05  WK-806-4952-IDX   PIC S9(08) USAGE COMP    VALUE  4952.
009650     05  WK-806-4953-IDX   PIC S9(08) USAGE COMP    VALUE  4953.
009660     05  WK-806-4954-IDX   PIC S9(08) USAGE COMP    VALUE  4954.
009670     05  WK-806-4955-IDX   PIC S9(08) USAGE COMP    VALUE  4955.
009680     05  WK-806-4956-IDX   PIC S9(08) USAGE COMP    VALUE  4956.
009690     05  WK-806-4957-IDX   PIC S9(08) USAGE COMP    VALUE  4957.
009700     05  WK-806-4958-IDX   PIC S9(08) USAGE COMP    VALUE  4958.
009710     05  WK-806-4959-IDX   PIC S9(08) USAGE COMP    VALUE  4959.
009720     05  WK-806-4960-IDX   PIC S9(08) USAGE COMP    VALUE  4960.
009730     05  WK-806-4961-IDX   PIC S9(08) USAGE COMP    VALUE  4961.
009740     05  WK-806-4962-IDX   PIC S9(08) USAGE COMP    VALUE  4962.
009750     05  WK-806-4963-IDX   PIC S9(08) USAGE COMP    VALUE  4963.
009760     05  WK-806-4964-IDX   PIC S9(08) USAGE COMP    VALUE  4964.
009770     05  WK-806-4965-IDX   PIC S9(08) USAGE COMP    VALUE  4965.
009780     05  WK-806-4966-IDX   PIC S9(08) USAGE COMP    VALUE  4966.
009790     05  WK-806-4967-IDX   PIC S9(08) USAGE COMP    VALUE  4967.
009800     05  WK-806-4968-IDX   PIC S9(08) USAGE COMP    VALUE  4968.
009810     05  WK-806-4969-IDX   PIC S9(08) USAGE COMP    VALUE  4969.
009820     05  WK-806-4970-IDX   PIC S9(08) USAGE COMP    VALUE  4970.
009830     05  WK-806-4971-IDX   PIC S9(08) USAGE COMP    VALUE  4971.
009840     05  WK-806-4972-IDX   PIC S9(08) USAGE COMP    VALUE  4972.
009850     05  WK-806-4973-IDX   PIC S9(08) USAGE COMP    VALUE  4973.
009860     05  WK-806-4974-IDX   PIC S9(08) USAGE COMP    VALUE  4974.
009870     05  WK-806-4975-IDX   PIC S9(08) USAGE COMP    VALUE  4975.
009880     05  WK-806-4976-IDX   PIC S9(08) USAGE COMP    VALUE  4976.
009890     05  WK-806-4977-IDX   PIC S9(08) USAGE COMP    VALUE  4977.
009900     05  WK-806-4978-IDX   PIC S9(08) USAGE COMP    VALUE  4978.
009910     05  WK-806-4979-IDX   PIC S9(08) USAGE COMP    VALUE  4979.
009920     05  WK-806-4980-IDX   PIC S9(08) USAGE COMP    VALUE  4980.
009930     05  WK-806-4981-IDX   PIC S9(08) USAGE COMP    VALUE  4981.
009940     05  WK-806-4982-IDX   PIC S9(08) USAGE COMP    VALUE  4982.
009950     05  WK-806-4983-IDX   PIC S9(08) USAGE COMP    VALUE  4983.
009960     05  WK-806-4984-IDX   PIC S9(08) USAGE COMP    VALUE  4984.
009970     05  WK-806-4985-IDX   PIC S9(08) USAGE COMP    VALUE  4985.
009980     05  WK-806-4986-IDX   PIC S9(08) USAGE COMP    VALUE  4986.
009990     05  WK-806-4987-IDX   PIC S9(08) USAGE COMP    VALUE  4987.
010000     05  WK-806-4988-IDX   PIC S9(08) USAGE COMP    VALUE  4988.
010010     05  WK-806-4989-IDX   PIC S9(08) USAGE COMP    VALUE  4989.
010020     05  WK-806-4990-IDX   PIC S9(08) USAGE COMP    VALUE  4990.
010030     05  WK-806-4991-IDX   PIC S9(08) USAGE COMP    VALUE  4991.
010040     05  WK-806-4992-IDX   PIC S9(08) USAGE COMP    VALUE  4992.
010050     05  WK-806-4993-IDX   PIC S9(08) USAGE COMP    VALUE  4993.
010060     05  WK-806-4994-IDX   PIC S9(08) USAGE COMP    VALUE  4994.
010070     05  WK-806-4995-IDX   PIC S9(08) USAGE COMP    VALUE  4995.
010080     05  WK-806-4996-IDX   PIC S9(08) USAGE COMP    VALUE  4996.
010090     05  WK-806-4997-IDX   PIC S9(08) USAGE COMP    VALUE  4997.
010100     05  WK-806-4998-IDX   PIC S9(08) USAGE COMP    VALUE  4998.
010110     05  WK-806-4999-IDX   PIC S9(08) USAGE COMP    VALUE  4999.
010110     05  WK-806-5000-IDX   PIC S9(08) USAGE COMP    VALUE  5000.
000130     05  WK-806-5001-IDX   PIC S9(08) USAGE COMP    VALUE  5001.
000140     05  WK-806-5002-IDX   PIC S9(08) USAGE COMP    VALUE  5002.
000150     05  WK-806-5003-IDX   PIC S9(08) USAGE COMP    VALUE  5003.
000160     05  WK-806-5004-IDX   PIC S9(08) USAGE COMP    VALUE  5004.
000170     05  WK-806-5005-IDX   PIC S9(08) USAGE COMP    VALUE  5005.
000180     05  WK-806-5006-IDX   PIC S9(08) USAGE COMP    VALUE  5006.
000190     05  WK-806-5007-IDX   PIC S9(08) USAGE COMP    VALUE  5007.
000200     05  WK-806-5008-IDX   PIC S9(08) USAGE COMP    VALUE  5008.
000210     05  WK-806-5009-IDX   PIC S9(08) USAGE COMP    VALUE  5009.
000220     05  WK-806-5010-IDX   PIC S9(08) USAGE COMP    VALUE  5010.
000230     05  WK-806-5011-IDX   PIC S9(08) USAGE COMP    VALUE  5011.
000240     05  WK-806-5012-IDX   PIC S9(08) USAGE COMP    VALUE  5012.
000250     05  WK-806-5013-IDX   PIC S9(08) USAGE COMP    VALUE  5013.
000260     05  WK-806-5014-IDX   PIC S9(08) USAGE COMP    VALUE  5014.
000270     05  WK-806-5015-IDX   PIC S9(08) USAGE COMP    VALUE  5015.
000280     05  WK-806-5016-IDX   PIC S9(08) USAGE COMP    VALUE  5016.
000290     05  WK-806-5017-IDX   PIC S9(08) USAGE COMP    VALUE  5017.
000300     05  WK-806-5018-IDX   PIC S9(08) USAGE COMP    VALUE  5018.
000310     05  WK-806-5019-IDX   PIC S9(08) USAGE COMP    VALUE  5019.
000320     05  WK-806-5020-IDX   PIC S9(08) USAGE COMP    VALUE  5020.
000330     05  WK-806-5021-IDX   PIC S9(08) USAGE COMP    VALUE  5021.
000340     05  WK-806-5022-IDX   PIC S9(08) USAGE COMP    VALUE  5022.
000350     05  WK-806-5023-IDX   PIC S9(08) USAGE COMP    VALUE  5023.
000360     05  WK-806-5024-IDX   PIC S9(08) USAGE COMP    VALUE  5024.
000370     05  WK-806-5025-IDX   PIC S9(08) USAGE COMP    VALUE  5025.
000380     05  WK-806-5026-IDX   PIC S9(08) USAGE COMP    VALUE  5026.
000390     05  WK-806-5027-IDX   PIC S9(08) USAGE COMP    VALUE  5027.
000400     05  WK-806-5028-IDX   PIC S9(08) USAGE COMP    VALUE  5028.
000410     05  WK-806-5029-IDX   PIC S9(08) USAGE COMP    VALUE  5029.
000420     05  WK-806-5030-IDX   PIC S9(08) USAGE COMP    VALUE  5030.
000430     05  WK-806-5031-IDX   PIC S9(08) USAGE COMP    VALUE  5031.
000440     05  WK-806-5032-IDX   PIC S9(08) USAGE COMP    VALUE  5032.
000450     05  WK-806-5033-IDX   PIC S9(08) USAGE COMP    VALUE  5033.
000460     05  WK-806-5034-IDX   PIC S9(08) USAGE COMP    VALUE  5034.
000470     05  WK-806-5035-IDX   PIC S9(08) USAGE COMP    VALUE  5035.
000480     05  WK-806-5036-IDX   PIC S9(08) USAGE COMP    VALUE  5036.
000490     05  WK-806-5037-IDX   PIC S9(08) USAGE COMP    VALUE  5037.
000500     05  WK-806-5038-IDX   PIC S9(08) USAGE COMP    VALUE  5038.
000510     05  WK-806-5039-IDX   PIC S9(08) USAGE COMP    VALUE  5039.
000520     05  WK-806-5040-IDX   PIC S9(08) USAGE COMP    VALUE  5040.
000530     05  WK-806-5041-IDX   PIC S9(08) USAGE COMP    VALUE  5041.
000540     05  WK-806-5042-IDX   PIC S9(08) USAGE COMP    VALUE  5042.
000550     05  WK-806-5043-IDX   PIC S9(08) USAGE COMP    VALUE  5043.
000560     05  WK-806-5044-IDX   PIC S9(08) USAGE COMP    VALUE  5044.
000570     05  WK-806-5045-IDX   PIC S9(08) USAGE COMP    VALUE  5045.
000580     05  WK-806-5046-IDX   PIC S9(08) USAGE COMP    VALUE  5046.
000590     05  WK-806-5047-IDX   PIC S9(08) USAGE COMP    VALUE  5047.
000600     05  WK-806-5048-IDX   PIC S9(08) USAGE COMP    VALUE  5048.
000610     05  WK-806-5049-IDX   PIC S9(08) USAGE COMP    VALUE  5049.
000620     05  WK-806-5050-IDX   PIC S9(08) USAGE COMP    VALUE  5050.
000630     05  WK-806-5051-IDX   PIC S9(08) USAGE COMP    VALUE  5051.
000640     05  WK-806-5052-IDX   PIC S9(08) USAGE COMP    VALUE  5052.
000650     05  WK-806-5053-IDX   PIC S9(08) USAGE COMP    VALUE  5053.
000660     05  WK-806-5054-IDX   PIC S9(08) USAGE COMP    VALUE  5054.
000670     05  WK-806-5055-IDX   PIC S9(08) USAGE COMP    VALUE  5055.
000680     05  WK-806-5056-IDX   PIC S9(08) USAGE COMP    VALUE  5056.
000690     05  WK-806-5057-IDX   PIC S9(08) USAGE COMP    VALUE  5057.
000700     05  WK-806-5058-IDX   PIC S9(08) USAGE COMP    VALUE  5058.
000710     05  WK-806-5059-IDX   PIC S9(08) USAGE COMP    VALUE  5059.
000720     05  WK-806-5060-IDX   PIC S9(08) USAGE COMP    VALUE  5060.
000730     05  WK-806-5061-IDX   PIC S9(08) USAGE COMP    VALUE  5061.
000740     05  WK-806-5062-IDX   PIC S9(08) USAGE COMP    VALUE  5062.
000750     05  WK-806-5063-IDX   PIC S9(08) USAGE COMP    VALUE  5063.
000760     05  WK-806-5064-IDX   PIC S9(08) USAGE COMP    VALUE  5064.
000770     05  WK-806-5065-IDX   PIC S9(08) USAGE COMP    VALUE  5065.
000780     05  WK-806-5066-IDX   PIC S9(08) USAGE COMP    VALUE  5066.
000790     05  WK-806-5067-IDX   PIC S9(08) USAGE COMP    VALUE  5067.
000800     05  WK-806-5068-IDX   PIC S9(08) USAGE COMP    VALUE  5068.
000810     05  WK-806-5069-IDX   PIC S9(08) USAGE COMP    VALUE  5069.
000820     05  WK-806-5070-IDX   PIC S9(08) USAGE COMP    VALUE  5070.
000830     05  WK-806-5071-IDX   PIC S9(08) USAGE COMP    VALUE  5071.
000840     05  WK-806-5072-IDX   PIC S9(08) USAGE COMP    VALUE  5072.
000850     05  WK-806-5073-IDX   PIC S9(08) USAGE COMP    VALUE  5073.
000860     05  WK-806-5074-IDX   PIC S9(08) USAGE COMP    VALUE  5074.
000870     05  WK-806-5075-IDX   PIC S9(08) USAGE COMP    VALUE  5075.
000880     05  WK-806-5076-IDX   PIC S9(08) USAGE COMP    VALUE  5076.
000890     05  WK-806-5077-IDX   PIC S9(08) USAGE COMP    VALUE  5077.
000900     05  WK-806-5078-IDX   PIC S9(08) USAGE COMP    VALUE  5078.
000910     05  WK-806-5079-IDX   PIC S9(08) USAGE COMP    VALUE  5079.
000920     05  WK-806-5080-IDX   PIC S9(08) USAGE COMP    VALUE  5080.
000930     05  WK-806-5081-IDX   PIC S9(08) USAGE COMP    VALUE  5081.
000940     05  WK-806-5082-IDX   PIC S9(08) USAGE COMP    VALUE  5082.
000950     05  WK-806-5083-IDX   PIC S9(08) USAGE COMP    VALUE  5083.
000960     05  WK-806-5084-IDX   PIC S9(08) USAGE COMP    VALUE  5084.
000970     05  WK-806-5085-IDX   PIC S9(08) USAGE COMP    VALUE  5085.
000980     05  WK-806-5086-IDX   PIC S9(08) USAGE COMP    VALUE  5086.
000990     05  WK-806-5087-IDX   PIC S9(08) USAGE COMP    VALUE  5087.
001000     05  WK-806-5088-IDX   PIC S9(08) USAGE COMP    VALUE  5088.
001010     05  WK-806-5089-IDX   PIC S9(08) USAGE COMP    VALUE  5089.
001020     05  WK-806-5090-IDX   PIC S9(08) USAGE COMP    VALUE  5090.
001030     05  WK-806-5091-IDX   PIC S9(08) USAGE COMP    VALUE  5091.
001040     05  WK-806-5092-IDX   PIC S9(08) USAGE COMP    VALUE  5092.
001050     05  WK-806-5093-IDX   PIC S9(08) USAGE COMP    VALUE  5093.
001060     05  WK-806-5094-IDX   PIC S9(08) USAGE COMP    VALUE  5094.
001070     05  WK-806-5095-IDX   PIC S9(08) USAGE COMP    VALUE  5095.
001080     05  WK-806-5096-IDX   PIC S9(08) USAGE COMP    VALUE  5096.
001090     05  WK-806-5097-IDX   PIC S9(08) USAGE COMP    VALUE  5097.
001100     05  WK-806-5098-IDX   PIC S9(08) USAGE COMP    VALUE  5098.
001110     05  WK-806-5099-IDX   PIC S9(08) USAGE COMP    VALUE  5099.
001120     05  WK-806-5100-IDX   PIC S9(08) USAGE COMP    VALUE  5100.
001130     05  WK-806-5101-IDX   PIC S9(08) USAGE COMP    VALUE  5101.
001140     05  WK-806-5102-IDX   PIC S9(08) USAGE COMP    VALUE  5102.
001150     05  WK-806-5103-IDX   PIC S9(08) USAGE COMP    VALUE  5103.
001160     05  WK-806-5104-IDX   PIC S9(08) USAGE COMP    VALUE  5104.
001170     05  WK-806-5105-IDX   PIC S9(08) USAGE COMP    VALUE  5105.
001180     05  WK-806-5106-IDX   PIC S9(08) USAGE COMP    VALUE  5106.
001190     05  WK-806-5107-IDX   PIC S9(08) USAGE COMP    VALUE  5107.
001200     05  WK-806-5108-IDX   PIC S9(08) USAGE COMP    VALUE  5108.
001210     05  WK-806-5109-IDX   PIC S9(08) USAGE COMP    VALUE  5109.
001220     05  WK-806-5110-IDX   PIC S9(08) USAGE COMP    VALUE  5110.
001230     05  WK-806-5111-IDX   PIC S9(08) USAGE COMP    VALUE  5111.
001240     05  WK-806-5112-IDX   PIC S9(08) USAGE COMP    VALUE  5112.
001250     05  WK-806-5113-IDX   PIC S9(08) USAGE COMP    VALUE  5113.
001260     05  WK-806-5114-IDX   PIC S9(08) USAGE COMP    VALUE  5114.
001270     05  WK-806-5115-IDX   PIC S9(08) USAGE COMP    VALUE  5115.
001280     05  WK-806-5116-IDX   PIC S9(08) USAGE COMP    VALUE  5116.
001290     05  WK-806-5117-IDX   PIC S9(08) USAGE COMP    VALUE  5117.
001300     05  WK-806-5118-IDX   PIC S9(08) USAGE COMP    VALUE  5118.
001310     05  WK-806-5119-IDX   PIC S9(08) USAGE COMP    VALUE  5119.
001320     05  WK-806-5120-IDX   PIC S9(08) USAGE COMP    VALUE  5120.
001330     05  WK-806-5121-IDX   PIC S9(08) USAGE COMP    VALUE  5121.
001340     05  WK-806-5122-IDX   PIC S9(08) USAGE COMP    VALUE  5122.
001350     05  WK-806-5123-IDX   PIC S9(08) USAGE COMP    VALUE  5123.
001360     05  WK-806-5124-IDX   PIC S9(08) USAGE COMP    VALUE  5124.
001370     05  WK-806-5125-IDX   PIC S9(08) USAGE COMP    VALUE  5125.
001380     05  WK-806-5126-IDX   PIC S9(08) USAGE COMP    VALUE  5126.
001390     05  WK-806-5127-IDX   PIC S9(08) USAGE COMP    VALUE  5127.
001400     05  WK-806-5128-IDX   PIC S9(08) USAGE COMP    VALUE  5128.
001410     05  WK-806-5129-IDX   PIC S9(08) USAGE COMP    VALUE  5129.
001420     05  WK-806-5130-IDX   PIC S9(08) USAGE COMP    VALUE  5130.
001430     05  WK-806-5131-IDX   PIC S9(08) USAGE COMP    VALUE  5131.
001440     05  WK-806-5132-IDX   PIC S9(08) USAGE COMP    VALUE  5132.
001450     05  WK-806-5133-IDX   PIC S9(08) USAGE COMP    VALUE  5133.
001460     05  WK-806-5134-IDX   PIC S9(08) USAGE COMP    VALUE  5134.
001470     05  WK-806-5135-IDX   PIC S9(08) USAGE COMP    VALUE  5135.
001480     05  WK-806-5136-IDX   PIC S9(08) USAGE COMP    VALUE  5136.
001490     05  WK-806-5137-IDX   PIC S9(08) USAGE COMP    VALUE  5137.
001500     05  WK-806-5138-IDX   PIC S9(08) USAGE COMP    VALUE  5138.
001510     05  WK-806-5139-IDX   PIC S9(08) USAGE COMP    VALUE  5139.
001520     05  WK-806-5140-IDX   PIC S9(08) USAGE COMP    VALUE  5140.
001530     05  WK-806-5141-IDX   PIC S9(08) USAGE COMP    VALUE  5141.
001540     05  WK-806-5142-IDX   PIC S9(08) USAGE COMP    VALUE  5142.
001550     05  WK-806-5143-IDX   PIC S9(08) USAGE COMP    VALUE  5143.
001560     05  WK-806-5144-IDX   PIC S9(08) USAGE COMP    VALUE  5144.
001570     05  WK-806-5145-IDX   PIC S9(08) USAGE COMP    VALUE  5145.
001580     05  WK-806-5146-IDX   PIC S9(08) USAGE COMP    VALUE  5146.
001590     05  WK-806-5147-IDX   PIC S9(08) USAGE COMP    VALUE  5147.
001600     05  WK-806-5148-IDX   PIC S9(08) USAGE COMP    VALUE  5148.
001610     05  WK-806-5149-IDX   PIC S9(08) USAGE COMP    VALUE  5149.
001620     05  WK-806-5150-IDX   PIC S9(08) USAGE COMP    VALUE  5150.
001630     05  WK-806-5151-IDX   PIC S9(08) USAGE COMP    VALUE  5151.
001640     05  WK-806-5152-IDX   PIC S9(08) USAGE COMP    VALUE  5152.
001650     05  WK-806-5153-IDX   PIC S9(08) USAGE COMP    VALUE  5153.
001660     05  WK-806-5154-IDX   PIC S9(08) USAGE COMP    VALUE  5154.
001670     05  WK-806-5155-IDX   PIC S9(08) USAGE COMP    VALUE  5155.
001680     05  WK-806-5156-IDX   PIC S9(08) USAGE COMP    VALUE  5156.
001690     05  WK-806-5157-IDX   PIC S9(08) USAGE COMP    VALUE  5157.
001700     05  WK-806-5158-IDX   PIC S9(08) USAGE COMP    VALUE  5158.
001710     05  WK-806-5159-IDX   PIC S9(08) USAGE COMP    VALUE  5159.
001720     05  WK-806-5160-IDX   PIC S9(08) USAGE COMP    VALUE  5160.
001730     05  WK-806-5161-IDX   PIC S9(08) USAGE COMP    VALUE  5161.
001740     05  WK-806-5162-IDX   PIC S9(08) USAGE COMP    VALUE  5162.
001750     05  WK-806-5163-IDX   PIC S9(08) USAGE COMP    VALUE  5163.
001760     05  WK-806-5164-IDX   PIC S9(08) USAGE COMP    VALUE  5164.
001770     05  WK-806-5165-IDX   PIC S9(08) USAGE COMP    VALUE  5165.
001780     05  WK-806-5166-IDX   PIC S9(08) USAGE COMP    VALUE  5166.
001790     05  WK-806-5167-IDX   PIC S9(08) USAGE COMP    VALUE  5167.
001800     05  WK-806-5168-IDX   PIC S9(08) USAGE COMP    VALUE  5168.
001810     05  WK-806-5169-IDX   PIC S9(08) USAGE COMP    VALUE  5169.
001820     05  WK-806-5170-IDX   PIC S9(08) USAGE COMP    VALUE  5170.
001830     05  WK-806-5171-IDX   PIC S9(08) USAGE COMP    VALUE  5171.
001840     05  WK-806-5172-IDX   PIC S9(08) USAGE COMP    VALUE  5172.
001850     05  WK-806-5173-IDX   PIC S9(08) USAGE COMP    VALUE  5173.
001860     05  WK-806-5174-IDX   PIC S9(08) USAGE COMP    VALUE  5174.
001870     05  WK-806-5175-IDX   PIC S9(08) USAGE COMP    VALUE  5175.
001880     05  WK-806-5176-IDX   PIC S9(08) USAGE COMP    VALUE  5176.
001890     05  WK-806-5177-IDX   PIC S9(08) USAGE COMP    VALUE  5177.
001900     05  WK-806-5178-IDX   PIC S9(08) USAGE COMP    VALUE  5178.
001910     05  WK-806-5179-IDX   PIC S9(08) USAGE COMP    VALUE  5179.
001920     05  WK-806-5180-IDX   PIC S9(08) USAGE COMP    VALUE  5180.
001930     05  WK-806-5181-IDX   PIC S9(08) USAGE COMP    VALUE  5181.
001940     05  WK-806-5182-IDX   PIC S9(08) USAGE COMP    VALUE  5182.
001950     05  WK-806-5183-IDX   PIC S9(08) USAGE COMP    VALUE  5183.
001960     05  WK-806-5184-IDX   PIC S9(08) USAGE COMP    VALUE  5184.
001970     05  WK-806-5185-IDX   PIC S9(08) USAGE COMP    VALUE  5185.
001980     05  WK-806-5186-IDX   PIC S9(08) USAGE COMP    VALUE  5186.
001990     05  WK-806-5187-IDX   PIC S9(08) USAGE COMP    VALUE  5187.
002000     05  WK-806-5188-IDX   PIC S9(08) USAGE COMP    VALUE  5188.
002010     05  WK-806-5189-IDX   PIC S9(08) USAGE COMP    VALUE  5189.
002020     05  WK-806-5190-IDX   PIC S9(08) USAGE COMP    VALUE  5190.
002030     05  WK-806-5191-IDX   PIC S9(08) USAGE COMP    VALUE  5191.
002040     05  WK-806-5192-IDX   PIC S9(08) USAGE COMP    VALUE  5192.
002050     05  WK-806-5193-IDX   PIC S9(08) USAGE COMP    VALUE  5193.
002060     05  WK-806-5194-IDX   PIC S9(08) USAGE COMP    VALUE  5194.
002070     05  WK-806-5195-IDX   PIC S9(08) USAGE COMP    VALUE  5195.
002080     05  WK-806-5196-IDX   PIC S9(08) USAGE COMP    VALUE  5196.
002090     05  WK-806-5197-IDX   PIC S9(08) USAGE COMP    VALUE  5197.
002100     05  WK-806-5198-IDX   PIC S9(08) USAGE COMP    VALUE  5198.
002110     05  WK-806-5199-IDX   PIC S9(08) USAGE COMP    VALUE  5199.
002120     05  WK-806-5200-IDX   PIC S9(08) USAGE COMP    VALUE  5200.
002130     05  WK-806-5201-IDX   PIC S9(08) USAGE COMP    VALUE  5201.
002140     05  WK-806-5202-IDX   PIC S9(08) USAGE COMP    VALUE  5202.
002150     05  WK-806-5203-IDX   PIC S9(08) USAGE COMP    VALUE  5203.
002160     05  WK-806-5204-IDX   PIC S9(08) USAGE COMP    VALUE  5204.
002170     05  WK-806-5205-IDX   PIC S9(08) USAGE COMP    VALUE  5205.
002180     05  WK-806-5206-IDX   PIC S9(08) USAGE COMP    VALUE  5206.
002190     05  WK-806-5207-IDX   PIC S9(08) USAGE COMP    VALUE  5207.
002200     05  WK-806-5208-IDX   PIC S9(08) USAGE COMP    VALUE  5208.
002210     05  WK-806-5209-IDX   PIC S9(08) USAGE COMP    VALUE  5209.
002220     05  WK-806-5210-IDX   PIC S9(08) USAGE COMP    VALUE  5210.
002230     05  WK-806-5211-IDX   PIC S9(08) USAGE COMP    VALUE  5211.
002240     05  WK-806-5212-IDX   PIC S9(08) USAGE COMP    VALUE  5212.
002250     05  WK-806-5213-IDX   PIC S9(08) USAGE COMP    VALUE  5213.
002260     05  WK-806-5214-IDX   PIC S9(08) USAGE COMP    VALUE  5214.
002270     05  WK-806-5215-IDX   PIC S9(08) USAGE COMP    VALUE  5215.
002280     05  WK-806-5216-IDX   PIC S9(08) USAGE COMP    VALUE  5216.
002290     05  WK-806-5217-IDX   PIC S9(08) USAGE COMP    VALUE  5217.
002300     05  WK-806-5218-IDX   PIC S9(08) USAGE COMP    VALUE  5218.
002310     05  WK-806-5219-IDX   PIC S9(08) USAGE COMP    VALUE  5219.
002320     05  WK-806-5220-IDX   PIC S9(08) USAGE COMP    VALUE  5220.
002330     05  WK-806-5221-IDX   PIC S9(08) USAGE COMP    VALUE  5221.
002340     05  WK-806-5222-IDX   PIC S9(08) USAGE COMP    VALUE  5222.
002350     05  WK-806-5223-IDX   PIC S9(08) USAGE COMP    VALUE  5223.
002360     05  WK-806-5224-IDX   PIC S9(08) USAGE COMP    VALUE  5224.
002370     05  WK-806-5225-IDX   PIC S9(08) USAGE COMP    VALUE  5225.
002380     05  WK-806-5226-IDX   PIC S9(08) USAGE COMP    VALUE  5226.
002390     05  WK-806-5227-IDX   PIC S9(08) USAGE COMP    VALUE  5227.
002400     05  WK-806-5228-IDX   PIC S9(08) USAGE COMP    VALUE  5228.
002410     05  WK-806-5229-IDX   PIC S9(08) USAGE COMP    VALUE  5229.
002420     05  WK-806-5230-IDX   PIC S9(08) USAGE COMP    VALUE  5230.
002430     05  WK-806-5231-IDX   PIC S9(08) USAGE COMP    VALUE  5231.
002440     05  WK-806-5232-IDX   PIC S9(08) USAGE COMP    VALUE  5232.
002450     05  WK-806-5233-IDX   PIC S9(08) USAGE COMP    VALUE  5233.
002460     05  WK-806-5234-IDX   PIC S9(08) USAGE COMP    VALUE  5234.
002470     05  WK-806-5235-IDX   PIC S9(08) USAGE COMP    VALUE  5235.
002480     05  WK-806-5236-IDX   PIC S9(08) USAGE COMP    VALUE  5236.
002490     05  WK-806-5237-IDX   PIC S9(08) USAGE COMP    VALUE  5237.
002500     05  WK-806-5238-IDX   PIC S9(08) USAGE COMP    VALUE  5238.
002510     05  WK-806-5239-IDX   PIC S9(08) USAGE COMP    VALUE  5239.
002520     05  WK-806-5240-IDX   PIC S9(08) USAGE COMP    VALUE  5240.
002530     05  WK-806-5241-IDX   PIC S9(08) USAGE COMP    VALUE  5241.
002540     05  WK-806-5242-IDX   PIC S9(08) USAGE COMP    VALUE  5242.
002550     05  WK-806-5243-IDX   PIC S9(08) USAGE COMP    VALUE  5243.
002560     05  WK-806-5244-IDX   PIC S9(08) USAGE COMP    VALUE  5244.
002570     05  WK-806-5245-IDX   PIC S9(08) USAGE COMP    VALUE  5245.
002580     05  WK-806-5246-IDX   PIC S9(08) USAGE COMP    VALUE  5246.
002590     05  WK-806-5247-IDX   PIC S9(08) USAGE COMP    VALUE  5247.
002600     05  WK-806-5248-IDX   PIC S9(08) USAGE COMP    VALUE  5248.
002610     05  WK-806-5249-IDX   PIC S9(08) USAGE COMP    VALUE  5249.
002620     05  WK-806-5250-IDX   PIC S9(08) USAGE COMP    VALUE  5250.
002630     05  WK-806-5251-IDX   PIC S9(08) USAGE COMP    VALUE  5251.
002640     05  WK-806-5252-IDX   PIC S9(08) USAGE COMP    VALUE  5252.
002650     05  WK-806-5253-IDX   PIC S9(08) USAGE COMP    VALUE  5253.
002660     05  WK-806-5254-IDX   PIC S9(08) USAGE COMP    VALUE  5254.
002670     05  WK-806-5255-IDX   PIC S9(08) USAGE COMP    VALUE  5255.
002680     05  WK-806-5256-IDX   PIC S9(08) USAGE COMP    VALUE  5256.
002690     05  WK-806-5257-IDX   PIC S9(08) USAGE COMP    VALUE  5257.
002700     05  WK-806-5258-IDX   PIC S9(08) USAGE COMP    VALUE  5258.
002710     05  WK-806-5259-IDX   PIC S9(08) USAGE COMP    VALUE  5259.
002720     05  WK-806-5260-IDX   PIC S9(08) USAGE COMP    VALUE  5260.
002730     05  WK-806-5261-IDX   PIC S9(08) USAGE COMP    VALUE  5261.
002740     05  WK-806-5262-IDX   PIC S9(08) USAGE COMP    VALUE  5262.
002750     05  WK-806-5263-IDX   PIC S9(08) USAGE COMP    VALUE  5263.
002760     05  WK-806-5264-IDX   PIC S9(08) USAGE COMP    VALUE  5264.
002770     05  WK-806-5265-IDX   PIC S9(08) USAGE COMP    VALUE  5265.
002780     05  WK-806-5266-IDX   PIC S9(08) USAGE COMP    VALUE  5266.
002790     05  WK-806-5267-IDX   PIC S9(08) USAGE COMP    VALUE  5267.
002800     05  WK-806-5268-IDX   PIC S9(08) USAGE COMP    VALUE  5268.
002810     05  WK-806-5269-IDX   PIC S9(08) USAGE COMP    VALUE  5269.
002820     05  WK-806-5270-IDX   PIC S9(08) USAGE COMP    VALUE  5270.
002830     05  WK-806-5271-IDX   PIC S9(08) USAGE COMP    VALUE  5271.
002840     05  WK-806-5272-IDX   PIC S9(08) USAGE COMP    VALUE  5272.
002850     05  WK-806-5273-IDX   PIC S9(08) USAGE COMP    VALUE  5273.
002860     05  WK-806-5274-IDX   PIC S9(08) USAGE COMP    VALUE  5274.
002870     05  WK-806-5275-IDX   PIC S9(08) USAGE COMP    VALUE  5275.
002880     05  WK-806-5276-IDX   PIC S9(08) USAGE COMP    VALUE  5276.
002890     05  WK-806-5277-IDX   PIC S9(08) USAGE COMP    VALUE  5277.
002900     05  WK-806-5278-IDX   PIC S9(08) USAGE COMP    VALUE  5278.
002910     05  WK-806-5279-IDX   PIC S9(08) USAGE COMP    VALUE  5279.
002920     05  WK-806-5280-IDX   PIC S9(08) USAGE COMP    VALUE  5280.
002930     05  WK-806-5281-IDX   PIC S9(08) USAGE COMP    VALUE  5281.
002940     05  WK-806-5282-IDX   PIC S9(08) USAGE COMP    VALUE  5282.
002950     05  WK-806-5283-IDX   PIC S9(08) USAGE COMP    VALUE  5283.
002960     05  WK-806-5284-IDX   PIC S9(08) USAGE COMP    VALUE  5284.
002970     05  WK-806-5285-IDX   PIC S9(08) USAGE COMP    VALUE  5285.
002980     05  WK-806-5286-IDX   PIC S9(08) USAGE COMP    VALUE  5286.
002990     05  WK-806-5287-IDX   PIC S9(08) USAGE COMP    VALUE  5287.
003000     05  WK-806-5288-IDX   PIC S9(08) USAGE COMP    VALUE  5288.
003010     05  WK-806-5289-IDX   PIC S9(08) USAGE COMP    VALUE  5289.
003020     05  WK-806-5290-IDX   PIC S9(08) USAGE COMP    VALUE  5290.
003030     05  WK-806-5291-IDX   PIC S9(08) USAGE COMP    VALUE  5291.
003040     05  WK-806-5292-IDX   PIC S9(08) USAGE COMP    VALUE  5292.
003050     05  WK-806-5293-IDX   PIC S9(08) USAGE COMP    VALUE  5293.
003060     05  WK-806-5294-IDX   PIC S9(08) USAGE COMP    VALUE  5294.
003070     05  WK-806-5295-IDX   PIC S9(08) USAGE COMP    VALUE  5295.
003080     05  WK-806-5296-IDX   PIC S9(08) USAGE COMP    VALUE  5296.
003090     05  WK-806-5297-IDX   PIC S9(08) USAGE COMP    VALUE  5297.
003100     05  WK-806-5298-IDX   PIC S9(08) USAGE COMP    VALUE  5298.
003110     05  WK-806-5299-IDX   PIC S9(08) USAGE COMP    VALUE  5299.
003120     05  WK-806-5300-IDX   PIC S9(08) USAGE COMP    VALUE  5300.
003130     05  WK-806-5301-IDX   PIC S9(08) USAGE COMP    VALUE  5301.
003140     05  WK-806-5302-IDX   PIC S9(08) USAGE COMP    VALUE  5302.
003150     05  WK-806-5303-IDX   PIC S9(08) USAGE COMP    VALUE  5303.
003160     05  WK-806-5304-IDX   PIC S9(08) USAGE COMP    VALUE  5304.
003170     05  WK-806-5305-IDX   PIC S9(08) USAGE COMP    VALUE  5305.
003180     05  WK-806-5306-IDX   PIC S9(08) USAGE COMP    VALUE  5306.
003190     05  WK-806-5307-IDX   PIC S9(08) USAGE COMP    VALUE  5307.
003200     05  WK-806-5308-IDX   PIC S9(08) USAGE COMP    VALUE  5308.
003210     05  WK-806-5309-IDX   PIC S9(08) USAGE COMP    VALUE  5309.
003220     05  WK-806-5310-IDX   PIC S9(08) USAGE COMP    VALUE  5310.
003230     05  WK-806-5311-IDX   PIC S9(08) USAGE COMP    VALUE  5311.
003240     05  WK-806-5312-IDX   PIC S9(08) USAGE COMP    VALUE  5312.
003250     05  WK-806-5313-IDX   PIC S9(08) USAGE COMP    VALUE  5313.
003260     05  WK-806-5314-IDX   PIC S9(08) USAGE COMP    VALUE  5314.
003270     05  WK-806-5315-IDX   PIC S9(08) USAGE COMP    VALUE  5315.
003280     05  WK-806-5316-IDX   PIC S9(08) USAGE COMP    VALUE  5316.
003290     05  WK-806-5317-IDX   PIC S9(08) USAGE COMP    VALUE  5317.
003300     05  WK-806-5318-IDX   PIC S9(08) USAGE COMP    VALUE  5318.
003310     05  WK-806-5319-IDX   PIC S9(08) USAGE COMP    VALUE  5319.
003320     05  WK-806-5320-IDX   PIC S9(08) USAGE COMP    VALUE  5320.
003330     05  WK-806-5321-IDX   PIC S9(08) USAGE COMP    VALUE  5321.
003340     05  WK-806-5322-IDX   PIC S9(08) USAGE COMP    VALUE  5322.
003350     05  WK-806-5323-IDX   PIC S9(08) USAGE COMP    VALUE  5323.
003360     05  WK-806-5324-IDX   PIC S9(08) USAGE COMP    VALUE  5324.
003370     05  WK-806-5325-IDX   PIC S9(08) USAGE COMP    VALUE  5325.
003380     05  WK-806-5326-IDX   PIC S9(08) USAGE COMP    VALUE  5326.
003390     05  WK-806-5327-IDX   PIC S9(08) USAGE COMP    VALUE  5327.
003400     05  WK-806-5328-IDX   PIC S9(08) USAGE COMP    VALUE  5328.
003410     05  WK-806-5329-IDX   PIC S9(08) USAGE COMP    VALUE  5329.
003420     05  WK-806-5330-IDX   PIC S9(08) USAGE COMP    VALUE  5330.
003430     05  WK-806-5331-IDX   PIC S9(08) USAGE COMP    VALUE  5331.
003440     05  WK-806-5332-IDX   PIC S9(08) USAGE COMP    VALUE  5332.
003450     05  WK-806-5333-IDX   PIC S9(08) USAGE COMP    VALUE  5333.
003460     05  WK-806-5334-IDX   PIC S9(08) USAGE COMP    VALUE  5334.
003470     05  WK-806-5335-IDX   PIC S9(08) USAGE COMP    VALUE  5335.
003480     05  WK-806-5336-IDX   PIC S9(08) USAGE COMP    VALUE  5336.
003490     05  WK-806-5337-IDX   PIC S9(08) USAGE COMP    VALUE  5337.
003500     05  WK-806-5338-IDX   PIC S9(08) USAGE COMP    VALUE  5338.
003510     05  WK-806-5339-IDX   PIC S9(08) USAGE COMP    VALUE  5339.
003520     05  WK-806-5340-IDX   PIC S9(08) USAGE COMP    VALUE  5340.
003530     05  WK-806-5341-IDX   PIC S9(08) USAGE COMP    VALUE  5341.
003540     05  WK-806-5342-IDX   PIC S9(08) USAGE COMP    VALUE  5342.
003550     05  WK-806-5343-IDX   PIC S9(08) USAGE COMP    VALUE  5343.
003560     05  WK-806-5344-IDX   PIC S9(08) USAGE COMP    VALUE  5344.
003570     05  WK-806-5345-IDX   PIC S9(08) USAGE COMP    VALUE  5345.
003580     05  WK-806-5346-IDX   PIC S9(08) USAGE COMP    VALUE  5346.
003590     05  WK-806-5347-IDX   PIC S9(08) USAGE COMP    VALUE  5347.
003600     05  WK-806-5348-IDX   PIC S9(08) USAGE COMP    VALUE  5348.
003610     05  WK-806-5349-IDX   PIC S9(08) USAGE COMP    VALUE  5349.
003620     05  WK-806-5350-IDX   PIC S9(08) USAGE COMP    VALUE  5350.
003630     05  WK-806-5351-IDX   PIC S9(08) USAGE COMP    VALUE  5351.
003640     05  WK-806-5352-IDX   PIC S9(08) USAGE COMP    VALUE  5352.
003650     05  WK-806-5353-IDX   PIC S9(08) USAGE COMP    VALUE  5353.
003660     05  WK-806-5354-IDX   PIC S9(08) USAGE COMP    VALUE  5354.
003670     05  WK-806-5355-IDX   PIC S9(08) USAGE COMP    VALUE  5355.
003680     05  WK-806-5356-IDX   PIC S9(08) USAGE COMP    VALUE  5356.
003690     05  WK-806-5357-IDX   PIC S9(08) USAGE COMP    VALUE  5357.
003700     05  WK-806-5358-IDX   PIC S9(08) USAGE COMP    VALUE  5358.
003710     05  WK-806-5359-IDX   PIC S9(08) USAGE COMP    VALUE  5359.
003720     05  WK-806-5360-IDX   PIC S9(08) USAGE COMP    VALUE  5360.
003730     05  WK-806-5361-IDX   PIC S9(08) USAGE COMP    VALUE  5361.
003740     05  WK-806-5362-IDX   PIC S9(08) USAGE COMP    VALUE  5362.
003750     05  WK-806-5363-IDX   PIC S9(08) USAGE COMP    VALUE  5363.
003760     05  WK-806-5364-IDX   PIC S9(08) USAGE COMP    VALUE  5364.
003770     05  WK-806-5365-IDX   PIC S9(08) USAGE COMP    VALUE  5365.
003780     05  WK-806-5366-IDX   PIC S9(08) USAGE COMP    VALUE  5366.
003790     05  WK-806-5367-IDX   PIC S9(08) USAGE COMP    VALUE  5367.
003800     05  WK-806-5368-IDX   PIC S9(08) USAGE COMP    VALUE  5368.
003810     05  WK-806-5369-IDX   PIC S9(08) USAGE COMP    VALUE  5369.
003820     05  WK-806-5370-IDX   PIC S9(08) USAGE COMP    VALUE  5370.
003830     05  WK-806-5371-IDX   PIC S9(08) USAGE COMP    VALUE  5371.
003840     05  WK-806-5372-IDX   PIC S9(08) USAGE COMP    VALUE  5372.
003850     05  WK-806-5373-IDX   PIC S9(08) USAGE COMP    VALUE  5373.
003860     05  WK-806-5374-IDX   PIC S9(08) USAGE COMP    VALUE  5374.
003870     05  WK-806-5375-IDX   PIC S9(08) USAGE COMP    VALUE  5375.
003880     05  WK-806-5376-IDX   PIC S9(08) USAGE COMP    VALUE  5376.
003890     05  WK-806-5377-IDX   PIC S9(08) USAGE COMP    VALUE  5377.
003900     05  WK-806-5378-IDX   PIC S9(08) USAGE COMP    VALUE  5378.
003910     05  WK-806-5379-IDX   PIC S9(08) USAGE COMP    VALUE  5379.
003920     05  WK-806-5380-IDX   PIC S9(08) USAGE COMP    VALUE  5380.
003930     05  WK-806-5381-IDX   PIC S9(08) USAGE COMP    VALUE  5381.
003940     05  WK-806-5382-IDX   PIC S9(08) USAGE COMP    VALUE  5382.
003950     05  WK-806-5383-IDX   PIC S9(08) USAGE COMP    VALUE  5383.
003960     05  WK-806-5384-IDX   PIC S9(08) USAGE COMP    VALUE  5384.
003970     05  WK-806-5385-IDX   PIC S9(08) USAGE COMP    VALUE  5385.
003980     05  WK-806-5386-IDX   PIC S9(08) USAGE COMP    VALUE  5386.
003990     05  WK-806-5387-IDX   PIC S9(08) USAGE COMP    VALUE  5387.
004000     05  WK-806-5388-IDX   PIC S9(08) USAGE COMP    VALUE  5388.
004010     05  WK-806-5389-IDX   PIC S9(08) USAGE COMP    VALUE  5389.
004020     05  WK-806-5390-IDX   PIC S9(08) USAGE COMP    VALUE  5390.
004030     05  WK-806-5391-IDX   PIC S9(08) USAGE COMP    VALUE  5391.
004040     05  WK-806-5392-IDX   PIC S9(08) USAGE COMP    VALUE  5392.
004050     05  WK-806-5393-IDX   PIC S9(08) USAGE COMP    VALUE  5393.
004060     05  WK-806-5394-IDX   PIC S9(08) USAGE COMP    VALUE  5394.
004070     05  WK-806-5395-IDX   PIC S9(08) USAGE COMP    VALUE  5395.
004080     05  WK-806-5396-IDX   PIC S9(08) USAGE COMP    VALUE  5396.
004090     05  WK-806-5397-IDX   PIC S9(08) USAGE COMP    VALUE  5397.
004100     05  WK-806-5398-IDX   PIC S9(08) USAGE COMP    VALUE  5398.
004110     05  WK-806-5399-IDX   PIC S9(08) USAGE COMP    VALUE  5399.
004120     05  WK-806-5400-IDX   PIC S9(08) USAGE COMP    VALUE  5400.
004130     05  WK-806-5401-IDX   PIC S9(08) USAGE COMP    VALUE  5401.
004140     05  WK-806-5402-IDX   PIC S9(08) USAGE COMP    VALUE  5402.
004150     05  WK-806-5403-IDX   PIC S9(08) USAGE COMP    VALUE  5403.
004160     05  WK-806-5404-IDX   PIC S9(08) USAGE COMP    VALUE  5404.
004170     05  WK-806-5405-IDX   PIC S9(08) USAGE COMP    VALUE  5405.
004180     05  WK-806-5406-IDX   PIC S9(08) USAGE COMP    VALUE  5406.
004190     05  WK-806-5407-IDX   PIC S9(08) USAGE COMP    VALUE  5407.
004200     05  WK-806-5408-IDX   PIC S9(08) USAGE COMP    VALUE  5408.
004210     05  WK-806-5409-IDX   PIC S9(08) USAGE COMP    VALUE  5409.
004220     05  WK-806-5410-IDX   PIC S9(08) USAGE COMP    VALUE  5410.
004230     05  WK-806-5411-IDX   PIC S9(08) USAGE COMP    VALUE  5411.
004240     05  WK-806-5412-IDX   PIC S9(08) USAGE COMP    VALUE  5412.
004250     05  WK-806-5413-IDX   PIC S9(08) USAGE COMP    VALUE  5413.
004260     05  WK-806-5414-IDX   PIC S9(08) USAGE COMP    VALUE  5414.
004270     05  WK-806-5415-IDX   PIC S9(08) USAGE COMP    VALUE  5415.
004280     05  WK-806-5416-IDX   PIC S9(08) USAGE COMP    VALUE  5416.
004290     05  WK-806-5417-IDX   PIC S9(08) USAGE COMP    VALUE  5417.
004300     05  WK-806-5418-IDX   PIC S9(08) USAGE COMP    VALUE  5418.
004310     05  WK-806-5419-IDX   PIC S9(08) USAGE COMP    VALUE  5419.
004320     05  WK-806-5420-IDX   PIC S9(08) USAGE COMP    VALUE  5420.
004330     05  WK-806-5421-IDX   PIC S9(08) USAGE COMP    VALUE  5421.
004340     05  WK-806-5422-IDX   PIC S9(08) USAGE COMP    VALUE  5422.
004350     05  WK-806-5423-IDX   PIC S9(08) USAGE COMP    VALUE  5423.
004360     05  WK-806-5424-IDX   PIC S9(08) USAGE COMP    VALUE  5424.
004370     05  WK-806-5425-IDX   PIC S9(08) USAGE COMP    VALUE  5425.
004380     05  WK-806-5426-IDX   PIC S9(08) USAGE COMP    VALUE  5426.
004390     05  WK-806-5427-IDX   PIC S9(08) USAGE COMP    VALUE  5427.
004400     05  WK-806-5428-IDX   PIC S9(08) USAGE COMP    VALUE  5428.
004410     05  WK-806-5429-IDX   PIC S9(08) USAGE COMP    VALUE  5429.
004420     05  WK-806-5430-IDX   PIC S9(08) USAGE COMP    VALUE  5430.
004430     05  WK-806-5431-IDX   PIC S9(08) USAGE COMP    VALUE  5431.
004440     05  WK-806-5432-IDX   PIC S9(08) USAGE COMP    VALUE  5432.
004450     05  WK-806-5433-IDX   PIC S9(08) USAGE COMP    VALUE  5433.
004460     05  WK-806-5434-IDX   PIC S9(08) USAGE COMP    VALUE  5434.
004470     05  WK-806-5435-IDX   PIC S9(08) USAGE COMP    VALUE  5435.
004480     05  WK-806-5436-IDX   PIC S9(08) USAGE COMP    VALUE  5436.
004490     05  WK-806-5437-IDX   PIC S9(08) USAGE COMP    VALUE  5437.
004500     05  WK-806-5438-IDX   PIC S9(08) USAGE COMP    VALUE  5438.
004510     05  WK-806-5439-IDX   PIC S9(08) USAGE COMP    VALUE  5439.
004520     05  WK-806-5440-IDX   PIC S9(08) USAGE COMP    VALUE  5440.
004530     05  WK-806-5441-IDX   PIC S9(08) USAGE COMP    VALUE  5441.
004540     05  WK-806-5442-IDX   PIC S9(08) USAGE COMP    VALUE  5442.
004550     05  WK-806-5443-IDX   PIC S9(08) USAGE COMP    VALUE  5443.
004560     05  WK-806-5444-IDX   PIC S9(08) USAGE COMP    VALUE  5444.
004570     05  WK-806-5445-IDX   PIC S9(08) USAGE COMP    VALUE  5445.
004580     05  WK-806-5446-IDX   PIC S9(08) USAGE COMP    VALUE  5446.
004590     05  WK-806-5447-IDX   PIC S9(08) USAGE COMP    VALUE  5447.
004600     05  WK-806-5448-IDX   PIC S9(08) USAGE COMP    VALUE  5448.
004610     05  WK-806-5449-IDX   PIC S9(08) USAGE COMP    VALUE  5449.
004620     05  WK-806-5450-IDX   PIC S9(08) USAGE COMP    VALUE  5450.
004630     05  WK-806-5451-IDX   PIC S9(08) USAGE COMP    VALUE  5451.
004640     05  WK-806-5452-IDX   PIC S9(08) USAGE COMP    VALUE  5452.
004650     05  WK-806-5453-IDX   PIC S9(08) USAGE COMP    VALUE  5453.
004660     05  WK-806-5454-IDX   PIC S9(08) USAGE COMP    VALUE  5454.
004670     05  WK-806-5455-IDX   PIC S9(08) USAGE COMP    VALUE  5455.
004680     05  WK-806-5456-IDX   PIC S9(08) USAGE COMP    VALUE  5456.
004690     05  WK-806-5457-IDX   PIC S9(08) USAGE COMP    VALUE  5457.
004700     05  WK-806-5458-IDX   PIC S9(08) USAGE COMP    VALUE  5458.
004710     05  WK-806-5459-IDX   PIC S9(08) USAGE COMP    VALUE  5459.
004720     05  WK-806-5460-IDX   PIC S9(08) USAGE COMP    VALUE  5460.
004730     05  WK-806-5461-IDX   PIC S9(08) USAGE COMP    VALUE  5461.
004740     05  WK-806-5462-IDX   PIC S9(08) USAGE COMP    VALUE  5462.
004750     05  WK-806-5463-IDX   PIC S9(08) USAGE COMP    VALUE  5463.
004760     05  WK-806-5464-IDX   PIC S9(08) USAGE COMP    VALUE  5464.
004770     05  WK-806-5465-IDX   PIC S9(08) USAGE COMP    VALUE  5465.
004780     05  WK-806-5466-IDX   PIC S9(08) USAGE COMP    VALUE  5466.
004790     05  WK-806-5467-IDX   PIC S9(08) USAGE COMP    VALUE  5467.
004800     05  WK-806-5468-IDX   PIC S9(08) USAGE COMP    VALUE  5468.
004810     05  WK-806-5469-IDX   PIC S9(08) USAGE COMP    VALUE  5469.
004820     05  WK-806-5470-IDX   PIC S9(08) USAGE COMP    VALUE  5470.
004830     05  WK-806-5471-IDX   PIC S9(08) USAGE COMP    VALUE  5471.
004840     05  WK-806-5472-IDX   PIC S9(08) USAGE COMP    VALUE  5472.
004850     05  WK-806-5473-IDX   PIC S9(08) USAGE COMP    VALUE  5473.
004860     05  WK-806-5474-IDX   PIC S9(08) USAGE COMP    VALUE  5474.
004870     05  WK-806-5475-IDX   PIC S9(08) USAGE COMP    VALUE  5475.
004880     05  WK-806-5476-IDX   PIC S9(08) USAGE COMP    VALUE  5476.
004890     05  WK-806-5477-IDX   PIC S9(08) USAGE COMP    VALUE  5477.
004900     05  WK-806-5478-IDX   PIC S9(08) USAGE COMP    VALUE  5478.
004910     05  WK-806-5479-IDX   PIC S9(08) USAGE COMP    VALUE  5479.
004920     05  WK-806-5480-IDX   PIC S9(08) USAGE COMP    VALUE  5480.
004930     05  WK-806-5481-IDX   PIC S9(08) USAGE COMP    VALUE  5481.
004940     05  WK-806-5482-IDX   PIC S9(08) USAGE COMP    VALUE  5482.
004950     05  WK-806-5483-IDX   PIC S9(08) USAGE COMP    VALUE  5483.
004960     05  WK-806-5484-IDX   PIC S9(08) USAGE COMP    VALUE  5484.
004970     05  WK-806-5485-IDX   PIC S9(08) USAGE COMP    VALUE  5485.
004980     05  WK-806-5486-IDX   PIC S9(08) USAGE COMP    VALUE  5486.
004990     05  WK-806-5487-IDX   PIC S9(08) USAGE COMP    VALUE  5487.
005000     05  WK-806-5488-IDX   PIC S9(08) USAGE COMP    VALUE  5488.
005010     05  WK-806-5489-IDX   PIC S9(08) USAGE COMP    VALUE  5489.
005020     05  WK-806-5490-IDX   PIC S9(08) USAGE COMP    VALUE  5490.
005030     05  WK-806-5491-IDX   PIC S9(08) USAGE COMP    VALUE  5491.
005040     05  WK-806-5492-IDX   PIC S9(08) USAGE COMP    VALUE  5492.
005050     05  WK-806-5493-IDX   PIC S9(08) USAGE COMP    VALUE  5493.
005060     05  WK-806-5494-IDX   PIC S9(08) USAGE COMP    VALUE  5494.
005070     05  WK-806-5495-IDX   PIC S9(08) USAGE COMP    VALUE  5495.
005080     05  WK-806-5496-IDX   PIC S9(08) USAGE COMP    VALUE  5496.
005090     05  WK-806-5497-IDX   PIC S9(08) USAGE COMP    VALUE  5497.
005100     05  WK-806-5498-IDX   PIC S9(08) USAGE COMP    VALUE  5498.
005110     05  WK-806-5499-IDX   PIC S9(08) USAGE COMP    VALUE  5499.
005120     05  WK-806-5500-IDX   PIC S9(08) USAGE COMP    VALUE  5500.
005130     05  WK-806-5501-IDX   PIC S9(08) USAGE COMP    VALUE  5501.
005140     05  WK-806-5502-IDX   PIC S9(08) USAGE COMP    VALUE  5502.
005150     05  WK-806-5503-IDX   PIC S9(08) USAGE COMP    VALUE  5503.
005160     05  WK-806-5504-IDX   PIC S9(08) USAGE COMP    VALUE  5504.
005170     05  WK-806-5505-IDX   PIC S9(08) USAGE COMP    VALUE  5505.
005180     05  WK-806-5506-IDX   PIC S9(08) USAGE COMP    VALUE  5506.
005190     05  WK-806-5507-IDX   PIC S9(08) USAGE COMP    VALUE  5507.
005200     05  WK-806-5508-IDX   PIC S9(08) USAGE COMP    VALUE  5508.
005210     05  WK-806-5509-IDX   PIC S9(08) USAGE COMP    VALUE  5509.
005220     05  WK-806-5510-IDX   PIC S9(08) USAGE COMP    VALUE  5510.
005230     05  WK-806-5511-IDX   PIC S9(08) USAGE COMP    VALUE  5511.
005240     05  WK-806-5512-IDX   PIC S9(08) USAGE COMP    VALUE  5512.
005250     05  WK-806-5513-IDX   PIC S9(08) USAGE COMP    VALUE  5513.
005260     05  WK-806-5514-IDX   PIC S9(08) USAGE COMP    VALUE  5514.
005270     05  WK-806-5515-IDX   PIC S9(08) USAGE COMP    VALUE  5515.
005280     05  WK-806-5516-IDX   PIC S9(08) USAGE COMP    VALUE  5516.
005290     05  WK-806-5517-IDX   PIC S9(08) USAGE COMP    VALUE  5517.
005300     05  WK-806-5518-IDX   PIC S9(08) USAGE COMP    VALUE  5518.
005310     05  WK-806-5519-IDX   PIC S9(08) USAGE COMP    VALUE  5519.
005320     05  WK-806-5520-IDX   PIC S9(08) USAGE COMP    VALUE  5520.
005330     05  WK-806-5521-IDX   PIC S9(08) USAGE COMP    VALUE  5521.
005340     05  WK-806-5522-IDX   PIC S9(08) USAGE COMP    VALUE  5522.
005350     05  WK-806-5523-IDX   PIC S9(08) USAGE COMP    VALUE  5523.
005360     05  WK-806-5524-IDX   PIC S9(08) USAGE COMP    VALUE  5524.
005370     05  WK-806-5525-IDX   PIC S9(08) USAGE COMP    VALUE  5525.
005380     05  WK-806-5526-IDX   PIC S9(08) USAGE COMP    VALUE  5526.
005390     05  WK-806-5527-IDX   PIC S9(08) USAGE COMP    VALUE  5527.
005400     05  WK-806-5528-IDX   PIC S9(08) USAGE COMP    VALUE  5528.
005410     05  WK-806-5529-IDX   PIC S9(08) USAGE COMP    VALUE  5529.
005420     05  WK-806-5530-IDX   PIC S9(08) USAGE COMP    VALUE  5530.
005430     05  WK-806-5531-IDX   PIC S9(08) USAGE COMP    VALUE  5531.
005440     05  WK-806-5532-IDX   PIC S9(08) USAGE COMP    VALUE  5532.
005450     05  WK-806-5533-IDX   PIC S9(08) USAGE COMP    VALUE  5533.
005460     05  WK-806-5534-IDX   PIC S9(08) USAGE COMP    VALUE  5534.
005470     05  WK-806-5535-IDX   PIC S9(08) USAGE COMP    VALUE  5535.
005480     05  WK-806-5536-IDX   PIC S9(08) USAGE COMP    VALUE  5536.
005490     05  WK-806-5537-IDX   PIC S9(08) USAGE COMP    VALUE  5537.
005500     05  WK-806-5538-IDX   PIC S9(08) USAGE COMP    VALUE  5538.
005510     05  WK-806-5539-IDX   PIC S9(08) USAGE COMP    VALUE  5539.
005520     05  WK-806-5540-IDX   PIC S9(08) USAGE COMP    VALUE  5540.
005530     05  WK-806-5541-IDX   PIC S9(08) USAGE COMP    VALUE  5541.
005540     05  WK-806-5542-IDX   PIC S9(08) USAGE COMP    VALUE  5542.
005550     05  WK-806-5543-IDX   PIC S9(08) USAGE COMP    VALUE  5543.
005560     05  WK-806-5544-IDX   PIC S9(08) USAGE COMP    VALUE  5544.
005570     05  WK-806-5545-IDX   PIC S9(08) USAGE COMP    VALUE  5545.
005580     05  WK-806-5546-IDX   PIC S9(08) USAGE COMP    VALUE  5546.
005590     05  WK-806-5547-IDX   PIC S9(08) USAGE COMP    VALUE  5547.
005600     05  WK-806-5548-IDX   PIC S9(08) USAGE COMP    VALUE  5548.
005610     05  WK-806-5549-IDX   PIC S9(08) USAGE COMP    VALUE  5549.
005620     05  WK-806-5550-IDX   PIC S9(08) USAGE COMP    VALUE  5550.
005630     05  WK-806-5551-IDX   PIC S9(08) USAGE COMP    VALUE  5551.
005640     05  WK-806-5552-IDX   PIC S9(08) USAGE COMP    VALUE  5552.
005650     05  WK-806-5553-IDX   PIC S9(08) USAGE COMP    VALUE  5553.
005660     05  WK-806-5554-IDX   PIC S9(08) USAGE COMP    VALUE  5554.
005670     05  WK-806-5555-IDX   PIC S9(08) USAGE COMP    VALUE  5555.
005680     05  WK-806-5556-IDX   PIC S9(08) USAGE COMP    VALUE  5556.
005690     05  WK-806-5557-IDX   PIC S9(08) USAGE COMP    VALUE  5557.
005700     05  WK-806-5558-IDX   PIC S9(08) USAGE COMP    VALUE  5558.
005710     05  WK-806-5559-IDX   PIC S9(08) USAGE COMP    VALUE  5559.
005720     05  WK-806-5560-IDX   PIC S9(08) USAGE COMP    VALUE  5560.
005730     05  WK-806-5561-IDX   PIC S9(08) USAGE COMP    VALUE  5561.
005740     05  WK-806-5562-IDX   PIC S9(08) USAGE COMP    VALUE  5562.
005750     05  WK-806-5563-IDX   PIC S9(08) USAGE COMP    VALUE  5563.
005760     05  WK-806-5564-IDX   PIC S9(08) USAGE COMP    VALUE  5564.
005770     05  WK-806-5565-IDX   PIC S9(08) USAGE COMP    VALUE  5565.
005780     05  WK-806-5566-IDX   PIC S9(08) USAGE COMP    VALUE  5566.
005790     05  WK-806-5567-IDX   PIC S9(08) USAGE COMP    VALUE  5567.
005800     05  WK-806-5568-IDX   PIC S9(08) USAGE COMP    VALUE  5568.
005810     05  WK-806-5569-IDX   PIC S9(08) USAGE COMP    VALUE  5569.
005820     05  WK-806-5570-IDX   PIC S9(08) USAGE COMP    VALUE  5570.
005830     05  WK-806-5571-IDX   PIC S9(08) USAGE COMP    VALUE  5571.
005840     05  WK-806-5572-IDX   PIC S9(08) USAGE COMP    VALUE  5572.
005850     05  WK-806-5573-IDX   PIC S9(08) USAGE COMP    VALUE  5573.
005860     05  WK-806-5574-IDX   PIC S9(08) USAGE COMP    VALUE  5574.
005870     05  WK-806-5575-IDX   PIC S9(08) USAGE COMP    VALUE  5575.
005880     05  WK-806-5576-IDX   PIC S9(08) USAGE COMP    VALUE  5576.
005890     05  WK-806-5577-IDX   PIC S9(08) USAGE COMP    VALUE  5577.
005900     05  WK-806-5578-IDX   PIC S9(08) USAGE COMP    VALUE  5578.
005910     05  WK-806-5579-IDX   PIC S9(08) USAGE COMP    VALUE  5579.
005920     05  WK-806-5580-IDX   PIC S9(08) USAGE COMP    VALUE  5580.
005930     05  WK-806-5581-IDX   PIC S9(08) USAGE COMP    VALUE  5581.
005940     05  WK-806-5582-IDX   PIC S9(08) USAGE COMP    VALUE  5582.
005950     05  WK-806-5583-IDX   PIC S9(08) USAGE COMP    VALUE  5583.
005960     05  WK-806-5584-IDX   PIC S9(08) USAGE COMP    VALUE  5584.
005970     05  WK-806-5585-IDX   PIC S9(08) USAGE COMP    VALUE  5585.
005980     05  WK-806-5586-IDX   PIC S9(08) USAGE COMP    VALUE  5586.
005990     05  WK-806-5587-IDX   PIC S9(08) USAGE COMP    VALUE  5587.
006000     05  WK-806-5588-IDX   PIC S9(08) USAGE COMP    VALUE  5588.
006010     05  WK-806-5589-IDX   PIC S9(08) USAGE COMP    VALUE  5589.
006020     05  WK-806-5590-IDX   PIC S9(08) USAGE COMP    VALUE  5590.
006030     05  WK-806-5591-IDX   PIC S9(08) USAGE COMP    VALUE  5591.
006040     05  WK-806-5592-IDX   PIC S9(08) USAGE COMP    VALUE  5592.
006050     05  WK-806-5593-IDX   PIC S9(08) USAGE COMP    VALUE  5593.
006060     05  WK-806-5594-IDX   PIC S9(08) USAGE COMP    VALUE  5594.
006070     05  WK-806-5595-IDX   PIC S9(08) USAGE COMP    VALUE  5595.
006080     05  WK-806-5596-IDX   PIC S9(08) USAGE COMP    VALUE  5596.
006090     05  WK-806-5597-IDX   PIC S9(08) USAGE COMP    VALUE  5597.
006100     05  WK-806-5598-IDX   PIC S9(08) USAGE COMP    VALUE  5598.
006110     05  WK-806-5599-IDX   PIC S9(08) USAGE COMP    VALUE  5599.
006120     05  WK-806-5600-IDX   PIC S9(08) USAGE COMP    VALUE  5600.
006130     05  WK-806-5601-IDX   PIC S9(08) USAGE COMP    VALUE  5601.
006140     05  WK-806-5602-IDX   PIC S9(08) USAGE COMP    VALUE  5602.
006150     05  WK-806-5603-IDX   PIC S9(08) USAGE COMP    VALUE  5603.
006160     05  WK-806-5604-IDX   PIC S9(08) USAGE COMP    VALUE  5604.
006170     05  WK-806-5605-IDX   PIC S9(08) USAGE COMP    VALUE  5605.
006180     05  WK-806-5606-IDX   PIC S9(08) USAGE COMP    VALUE  5606.
006190     05  WK-806-5607-IDX   PIC S9(08) USAGE COMP    VALUE  5607.
006200     05  WK-806-5608-IDX   PIC S9(08) USAGE COMP    VALUE  5608.
006210     05  WK-806-5609-IDX   PIC S9(08) USAGE COMP    VALUE  5609.
006220     05  WK-806-5610-IDX   PIC S9(08) USAGE COMP    VALUE  5610.
006230     05  WK-806-5611-IDX   PIC S9(08) USAGE COMP    VALUE  5611.
006240     05  WK-806-5612-IDX   PIC S9(08) USAGE COMP    VALUE  5612.
006250     05  WK-806-5613-IDX   PIC S9(08) USAGE COMP    VALUE  5613.
006260     05  WK-806-5614-IDX   PIC S9(08) USAGE COMP    VALUE  5614.
006270     05  WK-806-5615-IDX   PIC S9(08) USAGE COMP    VALUE  5615.
006280     05  WK-806-5616-IDX   PIC S9(08) USAGE COMP    VALUE  5616.
006290     05  WK-806-5617-IDX   PIC S9(08) USAGE COMP    VALUE  5617.
006300     05  WK-806-5618-IDX   PIC S9(08) USAGE COMP    VALUE  5618.
006310     05  WK-806-5619-IDX   PIC S9(08) USAGE COMP    VALUE  5619.
006320     05  WK-806-5620-IDX   PIC S9(08) USAGE COMP    VALUE  5620.
006330     05  WK-806-5621-IDX   PIC S9(08) USAGE COMP    VALUE  5621.
006340     05  WK-806-5622-IDX   PIC S9(08) USAGE COMP    VALUE  5622.
006350     05  WK-806-5623-IDX   PIC S9(08) USAGE COMP    VALUE  5623.
006360     05  WK-806-5624-IDX   PIC S9(08) USAGE COMP    VALUE  5624.
006370     05  WK-806-5625-IDX   PIC S9(08) USAGE COMP    VALUE  5625.
006380     05  WK-806-5626-IDX   PIC S9(08) USAGE COMP    VALUE  5626.
006390     05  WK-806-5627-IDX   PIC S9(08) USAGE COMP    VALUE  5627.
006400     05  WK-806-5628-IDX   PIC S9(08) USAGE COMP    VALUE  5628.
006410     05  WK-806-5629-IDX   PIC S9(08) USAGE COMP    VALUE  5629.
006420     05  WK-806-5630-IDX   PIC S9(08) USAGE COMP    VALUE  5630.
006430     05  WK-806-5631-IDX   PIC S9(08) USAGE COMP    VALUE  5631.
006440     05  WK-806-5632-IDX   PIC S9(08) USAGE COMP    VALUE  5632.
006450     05  WK-806-5633-IDX   PIC S9(08) USAGE COMP    VALUE  5633.
006460     05  WK-806-5634-IDX   PIC S9(08) USAGE COMP    VALUE  5634.
006470     05  WK-806-5635-IDX   PIC S9(08) USAGE COMP    VALUE  5635.
006480     05  WK-806-5636-IDX   PIC S9(08) USAGE COMP    VALUE  5636.
006490     05  WK-806-5637-IDX   PIC S9(08) USAGE COMP    VALUE  5637.
006500     05  WK-806-5638-IDX   PIC S9(08) USAGE COMP    VALUE  5638.
006510     05  WK-806-5639-IDX   PIC S9(08) USAGE COMP    VALUE  5639.
006520     05  WK-806-5640-IDX   PIC S9(08) USAGE COMP    VALUE  5640.
006530     05  WK-806-5641-IDX   PIC S9(08) USAGE COMP    VALUE  5641.
006540     05  WK-806-5642-IDX   PIC S9(08) USAGE COMP    VALUE  5642.
006550     05  WK-806-5643-IDX   PIC S9(08) USAGE COMP    VALUE  5643.
006560     05  WK-806-5644-IDX   PIC S9(08) USAGE COMP    VALUE  5644.
006570     05  WK-806-5645-IDX   PIC S9(08) USAGE COMP    VALUE  5645.
006580     05  WK-806-5646-IDX   PIC S9(08) USAGE COMP    VALUE  5646.
006590     05  WK-806-5647-IDX   PIC S9(08) USAGE COMP    VALUE  5647.
006600     05  WK-806-5648-IDX   PIC S9(08) USAGE COMP    VALUE  5648.
006610     05  WK-806-5649-IDX   PIC S9(08) USAGE COMP    VALUE  5649.
006620     05  WK-806-5650-IDX   PIC S9(08) USAGE COMP    VALUE  5650.
006630     05  WK-806-5651-IDX   PIC S9(08) USAGE COMP    VALUE  5651.
006640     05  WK-806-5652-IDX   PIC S9(08) USAGE COMP    VALUE  5652.
006650     05  WK-806-5653-IDX   PIC S9(08) USAGE COMP    VALUE  5653.
006660     05  WK-806-5654-IDX   PIC S9(08) USAGE COMP    VALUE  5654.
006670     05  WK-806-5655-IDX   PIC S9(08) USAGE COMP    VALUE  5655.
006680     05  WK-806-5656-IDX   PIC S9(08) USAGE COMP    VALUE  5656.
006690     05  WK-806-5657-IDX   PIC S9(08) USAGE COMP    VALUE  5657.
006700     05  WK-806-5658-IDX   PIC S9(08) USAGE COMP    VALUE  5658.
006710     05  WK-806-5659-IDX   PIC S9(08) USAGE COMP    VALUE  5659.
006720     05  WK-806-5660-IDX   PIC S9(08) USAGE COMP    VALUE  5660.
006730     05  WK-806-5661-IDX   PIC S9(08) USAGE COMP    VALUE  5661.
006740     05  WK-806-5662-IDX   PIC S9(08) USAGE COMP    VALUE  5662.
006750     05  WK-806-5663-IDX   PIC S9(08) USAGE COMP    VALUE  5663.
006760     05  WK-806-5664-IDX   PIC S9(08) USAGE COMP    VALUE  5664.
006770     05  WK-806-5665-IDX   PIC S9(08) USAGE COMP    VALUE  5665.
006780     05  WK-806-5666-IDX   PIC S9(08) USAGE COMP    VALUE  5666.
006790     05  WK-806-5667-IDX   PIC S9(08) USAGE COMP    VALUE  5667.
006800     05  WK-806-5668-IDX   PIC S9(08) USAGE COMP    VALUE  5668.
006810     05  WK-806-5669-IDX   PIC S9(08) USAGE COMP    VALUE  5669.
006820     05  WK-806-5670-IDX   PIC S9(08) USAGE COMP    VALUE  5670.
006830     05  WK-806-5671-IDX   PIC S9(08) USAGE COMP    VALUE  5671.
006840     05  WK-806-5672-IDX   PIC S9(08) USAGE COMP    VALUE  5672.
006850     05  WK-806-5673-IDX   PIC S9(08) USAGE COMP    VALUE  5673.
006860     05  WK-806-5674-IDX   PIC S9(08) USAGE COMP    VALUE  5674.
006870     05  WK-806-5675-IDX   PIC S9(08) USAGE COMP    VALUE  5675.
006880     05  WK-806-5676-IDX   PIC S9(08) USAGE COMP    VALUE  5676.
006890     05  WK-806-5677-IDX   PIC S9(08) USAGE COMP    VALUE  5677.
006900     05  WK-806-5678-IDX   PIC S9(08) USAGE COMP    VALUE  5678.
006910     05  WK-806-5679-IDX   PIC S9(08) USAGE COMP    VALUE  5679.
006920     05  WK-806-5680-IDX   PIC S9(08) USAGE COMP    VALUE  5680.
006930     05  WK-806-5681-IDX   PIC S9(08) USAGE COMP    VALUE  5681.
006940     05  WK-806-5682-IDX   PIC S9(08) USAGE COMP    VALUE  5682.
006950     05  WK-806-5683-IDX   PIC S9(08) USAGE COMP    VALUE  5683.
006960     05  WK-806-5684-IDX   PIC S9(08) USAGE COMP    VALUE  5684.
006970     05  WK-806-5685-IDX   PIC S9(08) USAGE COMP    VALUE  5685.
006980     05  WK-806-5686-IDX   PIC S9(08) USAGE COMP    VALUE  5686.
006990     05  WK-806-5687-IDX   PIC S9(08) USAGE COMP    VALUE  5687.
007000     05  WK-806-5688-IDX   PIC S9(08) USAGE COMP    VALUE  5688.
007010     05  WK-806-5689-IDX   PIC S9(08) USAGE COMP    VALUE  5689.
007020     05  WK-806-5690-IDX   PIC S9(08) USAGE COMP    VALUE  5690.
007030     05  WK-806-5691-IDX   PIC S9(08) USAGE COMP    VALUE  5691.
007040     05  WK-806-5692-IDX   PIC S9(08) USAGE COMP    VALUE  5692.
007050     05  WK-806-5693-IDX   PIC S9(08) USAGE COMP    VALUE  5693.
007060     05  WK-806-5694-IDX   PIC S9(08) USAGE COMP    VALUE  5694.
007070     05  WK-806-5695-IDX   PIC S9(08) USAGE COMP    VALUE  5695.
007080     05  WK-806-5696-IDX   PIC S9(08) USAGE COMP    VALUE  5696.
007090     05  WK-806-5697-IDX   PIC S9(08) USAGE COMP    VALUE  5697.
007100     05  WK-806-5698-IDX   PIC S9(08) USAGE COMP    VALUE  5698.
007110     05  WK-806-5699-IDX   PIC S9(08) USAGE COMP    VALUE  5699.
007120     05  WK-806-5700-IDX   PIC S9(08) USAGE COMP    VALUE  5700.
007130     05  WK-806-5701-IDX   PIC S9(08) USAGE COMP    VALUE  5701.
007140     05  WK-806-5702-IDX   PIC S9(08) USAGE COMP    VALUE  5702.
007150     05  WK-806-5703-IDX   PIC S9(08) USAGE COMP    VALUE  5703.
007160     05  WK-806-5704-IDX   PIC S9(08) USAGE COMP    VALUE  5704.
007170     05  WK-806-5705-IDX   PIC S9(08) USAGE COMP    VALUE  5705.
007180     05  WK-806-5706-IDX   PIC S9(08) USAGE COMP    VALUE  5706.
007190     05  WK-806-5707-IDX   PIC S9(08) USAGE COMP    VALUE  5707.
007200     05  WK-806-5708-IDX   PIC S9(08) USAGE COMP    VALUE  5708.
007210     05  WK-806-5709-IDX   PIC S9(08) USAGE COMP    VALUE  5709.
007220     05  WK-806-5710-IDX   PIC S9(08) USAGE COMP    VALUE  5710.
007230     05  WK-806-5711-IDX   PIC S9(08) USAGE COMP    VALUE  5711.
007240     05  WK-806-5712-IDX   PIC S9(08) USAGE COMP    VALUE  5712.
007250     05  WK-806-5713-IDX   PIC S9(08) USAGE COMP    VALUE  5713.
007260     05  WK-806-5714-IDX   PIC S9(08) USAGE COMP    VALUE  5714.
007270     05  WK-806-5715-IDX   PIC S9(08) USAGE COMP    VALUE  5715.
007280     05  WK-806-5716-IDX   PIC S9(08) USAGE COMP    VALUE  5716.
007290     05  WK-806-5717-IDX   PIC S9(08) USAGE COMP    VALUE  5717.
007300     05  WK-806-5718-IDX   PIC S9(08) USAGE COMP    VALUE  5718.
007310     05  WK-806-5719-IDX   PIC S9(08) USAGE COMP    VALUE  5719.
007320     05  WK-806-5720-IDX   PIC S9(08) USAGE COMP    VALUE  5720.
007330     05  WK-806-5721-IDX   PIC S9(08) USAGE COMP    VALUE  5721.
007340     05  WK-806-5722-IDX   PIC S9(08) USAGE COMP    VALUE  5722.
007350     05  WK-806-5723-IDX   PIC S9(08) USAGE COMP    VALUE  5723.
007360     05  WK-806-5724-IDX   PIC S9(08) USAGE COMP    VALUE  5724.
007370     05  WK-806-5725-IDX   PIC S9(08) USAGE COMP    VALUE  5725.
007380     05  WK-806-5726-IDX   PIC S9(08) USAGE COMP    VALUE  5726.
007390     05  WK-806-5727-IDX   PIC S9(08) USAGE COMP    VALUE  5727.
007400     05  WK-806-5728-IDX   PIC S9(08) USAGE COMP    VALUE  5728.
007410     05  WK-806-5729-IDX   PIC S9(08) USAGE COMP    VALUE  5729.
007420     05  WK-806-5730-IDX   PIC S9(08) USAGE COMP    VALUE  5730.
007430     05  WK-806-5731-IDX   PIC S9(08) USAGE COMP    VALUE  5731.
007440     05  WK-806-5732-IDX   PIC S9(08) USAGE COMP    VALUE  5732.
007450     05  WK-806-5733-IDX   PIC S9(08) USAGE COMP    VALUE  5733.
007460     05  WK-806-5734-IDX   PIC S9(08) USAGE COMP    VALUE  5734.
007470     05  WK-806-5735-IDX   PIC S9(08) USAGE COMP    VALUE  5735.
007480     05  WK-806-5736-IDX   PIC S9(08) USAGE COMP    VALUE  5736.
007490     05  WK-806-5737-IDX   PIC S9(08) USAGE COMP    VALUE  5737.
007500     05  WK-806-5738-IDX   PIC S9(08) USAGE COMP    VALUE  5738.
007510     05  WK-806-5739-IDX   PIC S9(08) USAGE COMP    VALUE  5739.
007520     05  WK-806-5740-IDX   PIC S9(08) USAGE COMP    VALUE  5740.
007530     05  WK-806-5741-IDX   PIC S9(08) USAGE COMP    VALUE  5741.
007540     05  WK-806-5742-IDX   PIC S9(08) USAGE COMP    VALUE  5742.
007550     05  WK-806-5743-IDX   PIC S9(08) USAGE COMP    VALUE  5743.
007560     05  WK-806-5744-IDX   PIC S9(08) USAGE COMP    VALUE  5744.
007570     05  WK-806-5745-IDX   PIC S9(08) USAGE COMP    VALUE  5745.
007580     05  WK-806-5746-IDX   PIC S9(08) USAGE COMP    VALUE  5746.
007590     05  WK-806-5747-IDX   PIC S9(08) USAGE COMP    VALUE  5747.
007600     05  WK-806-5748-IDX   PIC S9(08) USAGE COMP    VALUE  5748.
007610     05  WK-806-5749-IDX   PIC S9(08) USAGE COMP    VALUE  5749.
007620     05  WK-806-5750-IDX   PIC S9(08) USAGE COMP    VALUE  5750.
007630     05  WK-806-5751-IDX   PIC S9(08) USAGE COMP    VALUE  5751.
007640     05  WK-806-5752-IDX   PIC S9(08) USAGE COMP    VALUE  5752.
007650     05  WK-806-5753-IDX   PIC S9(08) USAGE COMP    VALUE  5753.
007660     05  WK-806-5754-IDX   PIC S9(08) USAGE COMP    VALUE  5754.
007670     05  WK-806-5755-IDX   PIC S9(08) USAGE COMP    VALUE  5755.
007680     05  WK-806-5756-IDX   PIC S9(08) USAGE COMP    VALUE  5756.
007690     05  WK-806-5757-IDX   PIC S9(08) USAGE COMP    VALUE  5757.
007700     05  WK-806-5758-IDX   PIC S9(08) USAGE COMP    VALUE  5758.
007710     05  WK-806-5759-IDX   PIC S9(08) USAGE COMP    VALUE  5759.
007720     05  WK-806-5760-IDX   PIC S9(08) USAGE COMP    VALUE  5760.
007730     05  WK-806-5761-IDX   PIC S9(08) USAGE COMP    VALUE  5761.
007740     05  WK-806-5762-IDX   PIC S9(08) USAGE COMP    VALUE  5762.
007750     05  WK-806-5763-IDX   PIC S9(08) USAGE COMP    VALUE  5763.
007760     05  WK-806-5764-IDX   PIC S9(08) USAGE COMP    VALUE  5764.
007770     05  WK-806-5765-IDX   PIC S9(08) USAGE COMP    VALUE  5765.
007780     05  WK-806-5766-IDX   PIC S9(08) USAGE COMP    VALUE  5766.
007790     05  WK-806-5767-IDX   PIC S9(08) USAGE COMP    VALUE  5767.
007800     05  WK-806-5768-IDX   PIC S9(08) USAGE COMP    VALUE  5768.
007810     05  WK-806-5769-IDX   PIC S9(08) USAGE COMP    VALUE  5769.
007820     05  WK-806-5770-IDX   PIC S9(08) USAGE COMP    VALUE  5770.
007830     05  WK-806-5771-IDX   PIC S9(08) USAGE COMP    VALUE  5771.
007840     05  WK-806-5772-IDX   PIC S9(08) USAGE COMP    VALUE  5772.
007850     05  WK-806-5773-IDX   PIC S9(08) USAGE COMP    VALUE  5773.
007860     05  WK-806-5774-IDX   PIC S9(08) USAGE COMP    VALUE  5774.
007870     05  WK-806-5775-IDX   PIC S9(08) USAGE COMP    VALUE  5775.
007880     05  WK-806-5776-IDX   PIC S9(08) USAGE COMP    VALUE  5776.
007890     05  WK-806-5777-IDX   PIC S9(08) USAGE COMP    VALUE  5777.
007900     05  WK-806-5778-IDX   PIC S9(08) USAGE COMP    VALUE  5778.
007910     05  WK-806-5779-IDX   PIC S9(08) USAGE COMP    VALUE  5779.
007920     05  WK-806-5780-IDX   PIC S9(08) USAGE COMP    VALUE  5780.
007930     05  WK-806-5781-IDX   PIC S9(08) USAGE COMP    VALUE  5781.
007940     05  WK-806-5782-IDX   PIC S9(08) USAGE COMP    VALUE  5782.
007950     05  WK-806-5783-IDX   PIC S9(08) USAGE COMP    VALUE  5783.
007960     05  WK-806-5784-IDX   PIC S9(08) USAGE COMP    VALUE  5784.
007970     05  WK-806-5785-IDX   PIC S9(08) USAGE COMP    VALUE  5785.
007980     05  WK-806-5786-IDX   PIC S9(08) USAGE COMP    VALUE  5786.
007990     05  WK-806-5787-IDX   PIC S9(08) USAGE COMP    VALUE  5787.
008000     05  WK-806-5788-IDX   PIC S9(08) USAGE COMP    VALUE  5788.
008010     05  WK-806-5789-IDX   PIC S9(08) USAGE COMP    VALUE  5789.
008020     05  WK-806-5790-IDX   PIC S9(08) USAGE COMP    VALUE  5790.
008030     05  WK-806-5791-IDX   PIC S9(08) USAGE COMP    VALUE  5791.
008040     05  WK-806-5792-IDX   PIC S9(08) USAGE COMP    VALUE  5792.
008050     05  WK-806-5793-IDX   PIC S9(08) USAGE COMP    VALUE  5793.
008060     05  WK-806-5794-IDX   PIC S9(08) USAGE COMP    VALUE  5794.
008070     05  WK-806-5795-IDX   PIC S9(08) USAGE COMP    VALUE  5795.
008080     05  WK-806-5796-IDX   PIC S9(08) USAGE COMP    VALUE  5796.
008090     05  WK-806-5797-IDX   PIC S9(08) USAGE COMP    VALUE  5797.
008100     05  WK-806-5798-IDX   PIC S9(08) USAGE COMP    VALUE  5798.
008110     05  WK-806-5799-IDX   PIC S9(08) USAGE COMP    VALUE  5799.
008120     05  WK-806-5800-IDX   PIC S9(08) USAGE COMP    VALUE  5800.
008130     05  WK-806-5801-IDX   PIC S9(08) USAGE COMP    VALUE  5801.
008140     05  WK-806-5802-IDX   PIC S9(08) USAGE COMP    VALUE  5802.
008150     05  WK-806-5803-IDX   PIC S9(08) USAGE COMP    VALUE  5803.
008160     05  WK-806-5804-IDX   PIC S9(08) USAGE COMP    VALUE  5804.
008170     05  WK-806-5805-IDX   PIC S9(08) USAGE COMP    VALUE  5805.
008180     05  WK-806-5806-IDX   PIC S9(08) USAGE COMP    VALUE  5806.
008190     05  WK-806-5807-IDX   PIC S9(08) USAGE COMP    VALUE  5807.
008200     05  WK-806-5808-IDX   PIC S9(08) USAGE COMP    VALUE  5808.
008210     05  WK-806-5809-IDX   PIC S9(08) USAGE COMP    VALUE  5809.
008220     05  WK-806-5810-IDX   PIC S9(08) USAGE COMP    VALUE  5810.
008230     05  WK-806-5811-IDX   PIC S9(08) USAGE COMP    VALUE  5811.
008240     05  WK-806-5812-IDX   PIC S9(08) USAGE COMP    VALUE  5812.
008250     05  WK-806-5813-IDX   PIC S9(08) USAGE COMP    VALUE  5813.
008260     05  WK-806-5814-IDX   PIC S9(08) USAGE COMP    VALUE  5814.
008270     05  WK-806-5815-IDX   PIC S9(08) USAGE COMP    VALUE  5815.
008280     05  WK-806-5816-IDX   PIC S9(08) USAGE COMP    VALUE  5816.
008290     05  WK-806-5817-IDX   PIC S9(08) USAGE COMP    VALUE  5817.
008300     05  WK-806-5818-IDX   PIC S9(08) USAGE COMP    VALUE  5818.
008310     05  WK-806-5819-IDX   PIC S9(08) USAGE COMP    VALUE  5819.
008320     05  WK-806-5820-IDX   PIC S9(08) USAGE COMP    VALUE  5820.
008330     05  WK-806-5821-IDX   PIC S9(08) USAGE COMP    VALUE  5821.
008340     05  WK-806-5822-IDX   PIC S9(08) USAGE COMP    VALUE  5822.
008350     05  WK-806-5823-IDX   PIC S9(08) USAGE COMP    VALUE  5823.
008360     05  WK-806-5824-IDX   PIC S9(08) USAGE COMP    VALUE  5824.
008370     05  WK-806-5825-IDX   PIC S9(08) USAGE COMP    VALUE  5825.
008380     05  WK-806-5826-IDX   PIC S9(08) USAGE COMP    VALUE  5826.
008390     05  WK-806-5827-IDX   PIC S9(08) USAGE COMP    VALUE  5827.
008400     05  WK-806-5828-IDX   PIC S9(08) USAGE COMP    VALUE  5828.
008410     05  WK-806-5829-IDX   PIC S9(08) USAGE COMP    VALUE  5829.
008420     05  WK-806-5830-IDX   PIC S9(08) USAGE COMP    VALUE  5830.
008430     05  WK-806-5831-IDX   PIC S9(08) USAGE COMP    VALUE  5831.
008440     05  WK-806-5832-IDX   PIC S9(08) USAGE COMP    VALUE  5832.
008450     05  WK-806-5833-IDX   PIC S9(08) USAGE COMP    VALUE  5833.
008460     05  WK-806-5834-IDX   PIC S9(08) USAGE COMP    VALUE  5834.
008470     05  WK-806-5835-IDX   PIC S9(08) USAGE COMP    VALUE  5835.
008480     05  WK-806-5836-IDX   PIC S9(08) USAGE COMP    VALUE  5836.
008490     05  WK-806-5837-IDX   PIC S9(08) USAGE COMP    VALUE  5837.
008500     05  WK-806-5838-IDX   PIC S9(08) USAGE COMP    VALUE  5838.
008510     05  WK-806-5839-IDX   PIC S9(08) USAGE COMP    VALUE  5839.
008520     05  WK-806-5840-IDX   PIC S9(08) USAGE COMP    VALUE  5840.
008530     05  WK-806-5841-IDX   PIC S9(08) USAGE COMP    VALUE  5841.
008540     05  WK-806-5842-IDX   PIC S9(08) USAGE COMP    VALUE  5842.
008550     05  WK-806-5843-IDX   PIC S9(08) USAGE COMP    VALUE  5843.
008560     05  WK-806-5844-IDX   PIC S9(08) USAGE COMP    VALUE  5844.
008570     05  WK-806-5845-IDX   PIC S9(08) USAGE COMP    VALUE  5845.
008580     05  WK-806-5846-IDX   PIC S9(08) USAGE COMP    VALUE  5846.
008590     05  WK-806-5847-IDX   PIC S9(08) USAGE COMP    VALUE  5847.
008600     05  WK-806-5848-IDX   PIC S9(08) USAGE COMP    VALUE  5848.
008610     05  WK-806-5849-IDX   PIC S9(08) USAGE COMP    VALUE  5849.
008620     05  WK-806-5850-IDX   PIC S9(08) USAGE COMP    VALUE  5850.
008630     05  WK-806-5851-IDX   PIC S9(08) USAGE COMP    VALUE  5851.
008640     05  WK-806-5852-IDX   PIC S9(08) USAGE COMP    VALUE  5852.
008650     05  WK-806-5853-IDX   PIC S9(08) USAGE COMP    VALUE  5853.
008660     05  WK-806-5854-IDX   PIC S9(08) USAGE COMP    VALUE  5854.
008670     05  WK-806-5855-IDX   PIC S9(08) USAGE COMP    VALUE  5855.
008680     05  WK-806-5856-IDX   PIC S9(08) USAGE COMP    VALUE  5856.
008690     05  WK-806-5857-IDX   PIC S9(08) USAGE COMP    VALUE  5857.
008700     05  WK-806-5858-IDX   PIC S9(08) USAGE COMP    VALUE  5858.
008710     05  WK-806-5859-IDX   PIC S9(08) USAGE COMP    VALUE  5859.
008720     05  WK-806-5860-IDX   PIC S9(08) USAGE COMP    VALUE  5860.
008730     05  WK-806-5861-IDX   PIC S9(08) USAGE COMP    VALUE  5861.
008740     05  WK-806-5862-IDX   PIC S9(08) USAGE COMP    VALUE  5862.
008750     05  WK-806-5863-IDX   PIC S9(08) USAGE COMP    VALUE  5863.
008760     05  WK-806-5864-IDX   PIC S9(08) USAGE COMP    VALUE  5864.
008770     05  WK-806-5865-IDX   PIC S9(08) USAGE COMP    VALUE  5865.
008780     05  WK-806-5866-IDX   PIC S9(08) USAGE COMP    VALUE  5866.
008790     05  WK-806-5867-IDX   PIC S9(08) USAGE COMP    VALUE  5867.
008800     05  WK-806-5868-IDX   PIC S9(08) USAGE COMP    VALUE  5868.
008810     05  WK-806-5869-IDX   PIC S9(08) USAGE COMP    VALUE  5869.
008820     05  WK-806-5870-IDX   PIC S9(08) USAGE COMP    VALUE  5870.
008830     05  WK-806-5871-IDX   PIC S9(08) USAGE COMP    VALUE  5871.
008840     05  WK-806-5872-IDX   PIC S9(08) USAGE COMP    VALUE  5872.
008850     05  WK-806-5873-IDX   PIC S9(08) USAGE COMP    VALUE  5873.
008860     05  WK-806-5874-IDX   PIC S9(08) USAGE COMP    VALUE  5874.
008870     05  WK-806-5875-IDX   PIC S9(08) USAGE COMP    VALUE  5875.
008880     05  WK-806-5876-IDX   PIC S9(08) USAGE COMP    VALUE  5876.
008890     05  WK-806-5877-IDX   PIC S9(08) USAGE COMP    VALUE  5877.
008900     05  WK-806-5878-IDX   PIC S9(08) USAGE COMP    VALUE  5878.
008910     05  WK-806-5879-IDX   PIC S9(08) USAGE COMP    VALUE  5879.
008920     05  WK-806-5880-IDX   PIC S9(08) USAGE COMP    VALUE  5880.
008930     05  WK-806-5881-IDX   PIC S9(08) USAGE COMP    VALUE  5881.
008940     05  WK-806-5882-IDX   PIC S9(08) USAGE COMP    VALUE  5882.
008950     05  WK-806-5883-IDX   PIC S9(08) USAGE COMP    VALUE  5883.
008960     05  WK-806-5884-IDX   PIC S9(08) USAGE COMP    VALUE  5884.
008970     05  WK-806-5885-IDX   PIC S9(08) USAGE COMP    VALUE  5885.
008980     05  WK-806-5886-IDX   PIC S9(08) USAGE COMP    VALUE  5886.
008990     05  WK-806-5887-IDX   PIC S9(08) USAGE COMP    VALUE  5887.
009000     05  WK-806-5888-IDX   PIC S9(08) USAGE COMP    VALUE  5888.
009010     05  WK-806-5889-IDX   PIC S9(08) USAGE COMP    VALUE  5889.
009020     05  WK-806-5890-IDX   PIC S9(08) USAGE COMP    VALUE  5890.
009030     05  WK-806-5891-IDX   PIC S9(08) USAGE COMP    VALUE  5891.
009040     05  WK-806-5892-IDX   PIC S9(08) USAGE COMP    VALUE  5892.
009050     05  WK-806-5893-IDX   PIC S9(08) USAGE COMP    VALUE  5893.
009060     05  WK-806-5894-IDX   PIC S9(08) USAGE COMP    VALUE  5894.
009070     05  WK-806-5895-IDX   PIC S9(08) USAGE COMP    VALUE  5895.
009080     05  WK-806-5896-IDX   PIC S9(08) USAGE COMP    VALUE  5896.
009090     05  WK-806-5897-IDX   PIC S9(08) USAGE COMP    VALUE  5897.
009100     05  WK-806-5898-IDX   PIC S9(08) USAGE COMP    VALUE  5898.
009110     05  WK-806-5899-IDX   PIC S9(08) USAGE COMP    VALUE  5899.
009120     05  WK-806-5900-IDX   PIC S9(08) USAGE COMP    VALUE  5900.
009130     05  WK-806-5901-IDX   PIC S9(08) USAGE COMP    VALUE  5901.
009140     05  WK-806-5902-IDX   PIC S9(08) USAGE COMP    VALUE  5902.
009150     05  WK-806-5903-IDX   PIC S9(08) USAGE COMP    VALUE  5903.
009160     05  WK-806-5904-IDX   PIC S9(08) USAGE COMP    VALUE  5904.
009170     05  WK-806-5905-IDX   PIC S9(08) USAGE COMP    VALUE  5905.
009180     05  WK-806-5906-IDX   PIC S9(08) USAGE COMP    VALUE  5906.
009190     05  WK-806-5907-IDX   PIC S9(08) USAGE COMP    VALUE  5907.
009200     05  WK-806-5908-IDX   PIC S9(08) USAGE COMP    VALUE  5908.
009210     05  WK-806-5909-IDX   PIC S9(08) USAGE COMP    VALUE  5909.
009220     05  WK-806-5910-IDX   PIC S9(08) USAGE COMP    VALUE  5910.
009230     05  WK-806-5911-IDX   PIC S9(08) USAGE COMP    VALUE  5911.
009240     05  WK-806-5912-IDX   PIC S9(08) USAGE COMP    VALUE  5912.
009250     05  WK-806-5913-IDX   PIC S9(08) USAGE COMP    VALUE  5913.
009260     05  WK-806-5914-IDX   PIC S9(08) USAGE COMP    VALUE  5914.
009270     05  WK-806-5915-IDX   PIC S9(08) USAGE COMP    VALUE  5915.
009280     05  WK-806-5916-IDX   PIC S9(08) USAGE COMP    VALUE  5916.
009290     05  WK-806-5917-IDX   PIC S9(08) USAGE COMP    VALUE  5917.
009300     05  WK-806-5918-IDX   PIC S9(08) USAGE COMP    VALUE  5918.
009310     05  WK-806-5919-IDX   PIC S9(08) USAGE COMP    VALUE  5919.
009320     05  WK-806-5920-IDX   PIC S9(08) USAGE COMP    VALUE  5920.
009330     05  WK-806-5921-IDX   PIC S9(08) USAGE COMP    VALUE  5921.
009340     05  WK-806-5922-IDX   PIC S9(08) USAGE COMP    VALUE  5922.
009350     05  WK-806-5923-IDX   PIC S9(08) USAGE COMP    VALUE  5923.
009360     05  WK-806-5924-IDX   PIC S9(08) USAGE COMP    VALUE  5924.
009370     05  WK-806-5925-IDX   PIC S9(08) USAGE COMP    VALUE  5925.
009380     05  WK-806-5926-IDX   PIC S9(08) USAGE COMP    VALUE  5926.
009390     05  WK-806-5927-IDX   PIC S9(08) USAGE COMP    VALUE  5927.
009400     05  WK-806-5928-IDX   PIC S9(08) USAGE COMP    VALUE  5928.
009410     05  WK-806-5929-IDX   PIC S9(08) USAGE COMP    VALUE  5929.
009420     05  WK-806-5930-IDX   PIC S9(08) USAGE COMP    VALUE  5930.
009430     05  WK-806-5931-IDX   PIC S9(08) USAGE COMP    VALUE  5931.
009440     05  WK-806-5932-IDX   PIC S9(08) USAGE COMP    VALUE  5932.
009450     05  WK-806-5933-IDX   PIC S9(08) USAGE COMP    VALUE  5933.
009460     05  WK-806-5934-IDX   PIC S9(08) USAGE COMP    VALUE  5934.
009470     05  WK-806-5935-IDX   PIC S9(08) USAGE COMP    VALUE  5935.
009480     05  WK-806-5936-IDX   PIC S9(08) USAGE COMP    VALUE  5936.
009490     05  WK-806-5937-IDX   PIC S9(08) USAGE COMP    VALUE  5937.
009500     05  WK-806-5938-IDX   PIC S9(08) USAGE COMP    VALUE  5938.
009510     05  WK-806-5939-IDX   PIC S9(08) USAGE COMP    VALUE  5939.
009520     05  WK-806-5940-IDX   PIC S9(08) USAGE COMP    VALUE  5940.
009530     05  WK-806-5941-IDX   PIC S9(08) USAGE COMP    VALUE  5941.
009540     05  WK-806-5942-IDX   PIC S9(08) USAGE COMP    VALUE  5942.
009550     05  WK-806-5943-IDX   PIC S9(08) USAGE COMP    VALUE  5943.
009560     05  WK-806-5944-IDX   PIC S9(08) USAGE COMP    VALUE  5944.
009570     05  WK-806-5945-IDX   PIC S9(08) USAGE COMP    VALUE  5945.
009580     05  WK-806-5946-IDX   PIC S9(08) USAGE COMP    VALUE  5946.
009590     05  WK-806-5947-IDX   PIC S9(08) USAGE COMP    VALUE  5947.
009600     05  WK-806-5948-IDX   PIC S9(08) USAGE COMP    VALUE  5948.
009610     05  WK-806-5949-IDX   PIC S9(08) USAGE COMP    VALUE  5949.
009620     05  WK-806-5950-IDX   PIC S9(08) USAGE COMP    VALUE  5950.
009630     05  WK-806-5951-IDX   PIC S9(08) USAGE COMP    VALUE  5951.
009640     05  WK-806-5952-IDX   PIC S9(08) USAGE COMP    VALUE  5952.
009650     05  WK-806-5953-IDX   PIC S9(08) USAGE COMP    VALUE  5953.
009660     05  WK-806-5954-IDX   PIC S9(08) USAGE COMP    VALUE  5954.
009670     05  WK-806-5955-IDX   PIC S9(08) USAGE COMP    VALUE  5955.
009680     05  WK-806-5956-IDX   PIC S9(08) USAGE COMP    VALUE  5956.
009690     05  WK-806-5957-IDX   PIC S9(08) USAGE COMP    VALUE  5957.
009700     05  WK-806-5958-IDX   PIC S9(08) USAGE COMP    VALUE  5958.
009710     05  WK-806-5959-IDX   PIC S9(08) USAGE COMP    VALUE  5959.
009720     05  WK-806-5960-IDX   PIC S9(08) USAGE COMP    VALUE  5960.
009730     05  WK-806-5961-IDX   PIC S9(08) USAGE COMP    VALUE  5961.
009740     05  WK-806-5962-IDX   PIC S9(08) USAGE COMP    VALUE  5962.
009750     05  WK-806-5963-IDX   PIC S9(08) USAGE COMP    VALUE  5963.
009760     05  WK-806-5964-IDX   PIC S9(08) USAGE COMP    VALUE  5964.
009770     05  WK-806-5965-IDX   PIC S9(08) USAGE COMP    VALUE  5965.
009780     05  WK-806-5966-IDX   PIC S9(08) USAGE COMP    VALUE  5966.
009790     05  WK-806-5967-IDX   PIC S9(08) USAGE COMP    VALUE  5967.
009800     05  WK-806-5968-IDX   PIC S9(08) USAGE COMP    VALUE  5968.
009810     05  WK-806-5969-IDX   PIC S9(08) USAGE COMP    VALUE  5969.
009820     05  WK-806-5970-IDX   PIC S9(08) USAGE COMP    VALUE  5970.
009830     05  WK-806-5971-IDX   PIC S9(08) USAGE COMP    VALUE  5971.
009840     05  WK-806-5972-IDX   PIC S9(08) USAGE COMP    VALUE  5972.
009850     05  WK-806-5973-IDX   PIC S9(08) USAGE COMP    VALUE  5973.
009860     05  WK-806-5974-IDX   PIC S9(08) USAGE COMP    VALUE  5974.
009870     05  WK-806-5975-IDX   PIC S9(08) USAGE COMP    VALUE  5975.
009880     05  WK-806-5976-IDX   PIC S9(08) USAGE COMP    VALUE  5976.
009890     05  WK-806-5977-IDX   PIC S9(08) USAGE COMP    VALUE  5977.
009900     05  WK-806-5978-IDX   PIC S9(08) USAGE COMP    VALUE  5978.
009910     05  WK-806-5979-IDX   PIC S9(08) USAGE COMP    VALUE  5979.
009920     05  WK-806-5980-IDX   PIC S9(08) USAGE COMP    VALUE  5980.
009930     05  WK-806-5981-IDX   PIC S9(08) USAGE COMP    VALUE  5981.
009940     05  WK-806-5982-IDX   PIC S9(08) USAGE COMP    VALUE  5982.
009950     05  WK-806-5983-IDX   PIC S9(08) USAGE COMP    VALUE  5983.
009960     05  WK-806-5984-IDX   PIC S9(08) USAGE COMP    VALUE  5984.
009970     05  WK-806-5985-IDX   PIC S9(08) USAGE COMP    VALUE  5985.
009980     05  WK-806-5986-IDX   PIC S9(08) USAGE COMP    VALUE  5986.
009990     05  WK-806-5987-IDX   PIC S9(08) USAGE COMP    VALUE  5987.
010000     05  WK-806-5988-IDX   PIC S9(08) USAGE COMP    VALUE  5988.
010010     05  WK-806-5989-IDX   PIC S9(08) USAGE COMP    VALUE  5989.
010020     05  WK-806-5990-IDX   PIC S9(08) USAGE COMP    VALUE  5990.
010030     05  WK-806-5991-IDX   PIC S9(08) USAGE COMP    VALUE  5991.
010040     05  WK-806-5992-IDX   PIC S9(08) USAGE COMP    VALUE  5992.
010050     05  WK-806-5993-IDX   PIC S9(08) USAGE COMP    VALUE  5993.
010060     05  WK-806-5994-IDX   PIC S9(08) USAGE COMP    VALUE  5994.
010070     05  WK-806-5995-IDX   PIC S9(08) USAGE COMP    VALUE  5995.
010080     05  WK-806-5996-IDX   PIC S9(08) USAGE COMP    VALUE  5996.
010090     05  WK-806-5997-IDX   PIC S9(08) USAGE COMP    VALUE  5997.
010100     05  WK-806-5998-IDX   PIC S9(08) USAGE COMP    VALUE  5998.
010110     05  WK-806-5999-IDX   PIC S9(08) USAGE COMP    VALUE  5999.
010110     05  WK-806-6000-IDX   PIC S9(08) USAGE COMP    VALUE  6000.
000130     05  WK-806-6001-IDX   PIC S9(08) USAGE COMP    VALUE  6001.
000140     05  WK-806-6002-IDX   PIC S9(08) USAGE COMP    VALUE  6002.
000150     05  WK-806-6003-IDX   PIC S9(08) USAGE COMP    VALUE  6003.
000160     05  WK-806-6004-IDX   PIC S9(08) USAGE COMP    VALUE  6004.
000170     05  WK-806-6005-IDX   PIC S9(08) USAGE COMP    VALUE  6005.
000180     05  WK-806-6006-IDX   PIC S9(08) USAGE COMP    VALUE  6006.
000190     05  WK-806-6007-IDX   PIC S9(08) USAGE COMP    VALUE  6007.
000200     05  WK-806-6008-IDX   PIC S9(08) USAGE COMP    VALUE  6008.
000210     05  WK-806-6009-IDX   PIC S9(08) USAGE COMP    VALUE  6009.
000220     05  WK-806-6010-IDX   PIC S9(08) USAGE COMP    VALUE  6010.
000230     05  WK-806-6011-IDX   PIC S9(08) USAGE COMP    VALUE  6011.
000240     05  WK-806-6012-IDX   PIC S9(08) USAGE COMP    VALUE  6012.
000250     05  WK-806-6013-IDX   PIC S9(08) USAGE COMP    VALUE  6013.
000260     05  WK-806-6014-IDX   PIC S9(08) USAGE COMP    VALUE  6014.
000270     05  WK-806-6015-IDX   PIC S9(08) USAGE COMP    VALUE  6015.
000280     05  WK-806-6016-IDX   PIC S9(08) USAGE COMP    VALUE  6016.
000290     05  WK-806-6017-IDX   PIC S9(08) USAGE COMP    VALUE  6017.
000300     05  WK-806-6018-IDX   PIC S9(08) USAGE COMP    VALUE  6018.
000310     05  WK-806-6019-IDX   PIC S9(08) USAGE COMP    VALUE  6019.
000320     05  WK-806-6020-IDX   PIC S9(08) USAGE COMP    VALUE  6020.
000330     05  WK-806-6021-IDX   PIC S9(08) USAGE COMP    VALUE  6021.
000340     05  WK-806-6022-IDX   PIC S9(08) USAGE COMP    VALUE  6022.
000350     05  WK-806-6023-IDX   PIC S9(08) USAGE COMP    VALUE  6023.
000360     05  WK-806-6024-IDX   PIC S9(08) USAGE COMP    VALUE  6024.
000370     05  WK-806-6025-IDX   PIC S9(08) USAGE COMP    VALUE  6025.
000380     05  WK-806-6026-IDX   PIC S9(08) USAGE COMP    VALUE  6026.
000390     05  WK-806-6027-IDX   PIC S9(08) USAGE COMP    VALUE  6027.
000400     05  WK-806-6028-IDX   PIC S9(08) USAGE COMP    VALUE  6028.
000410     05  WK-806-6029-IDX   PIC S9(08) USAGE COMP    VALUE  6029.
000420     05  WK-806-6030-IDX   PIC S9(08) USAGE COMP    VALUE  6030.
000430     05  WK-806-6031-IDX   PIC S9(08) USAGE COMP    VALUE  6031.
000440     05  WK-806-6032-IDX   PIC S9(08) USAGE COMP    VALUE  6032.
000450     05  WK-806-6033-IDX   PIC S9(08) USAGE COMP    VALUE  6033.
000460     05  WK-806-6034-IDX   PIC S9(08) USAGE COMP    VALUE  6034.
000470     05  WK-806-6035-IDX   PIC S9(08) USAGE COMP    VALUE  6035.
000480     05  WK-806-6036-IDX   PIC S9(08) USAGE COMP    VALUE  6036.
000490     05  WK-806-6037-IDX   PIC S9(08) USAGE COMP    VALUE  6037.
000500     05  WK-806-6038-IDX   PIC S9(08) USAGE COMP    VALUE  6038.
000510     05  WK-806-6039-IDX   PIC S9(08) USAGE COMP    VALUE  6039.
000520     05  WK-806-6040-IDX   PIC S9(08) USAGE COMP    VALUE  6040.
000530     05  WK-806-6041-IDX   PIC S9(08) USAGE COMP    VALUE  6041.
000540     05  WK-806-6042-IDX   PIC S9(08) USAGE COMP    VALUE  6042.
000550     05  WK-806-6043-IDX   PIC S9(08) USAGE COMP    VALUE  6043.
000560     05  WK-806-6044-IDX   PIC S9(08) USAGE COMP    VALUE  6044.
000570     05  WK-806-6045-IDX   PIC S9(08) USAGE COMP    VALUE  6045.
000580     05  WK-806-6046-IDX   PIC S9(08) USAGE COMP    VALUE  6046.
000590     05  WK-806-6047-IDX   PIC S9(08) USAGE COMP    VALUE  6047.
000600     05  WK-806-6048-IDX   PIC S9(08) USAGE COMP    VALUE  6048.
000610     05  WK-806-6049-IDX   PIC S9(08) USAGE COMP    VALUE  6049.
000620     05  WK-806-6050-IDX   PIC S9(08) USAGE COMP    VALUE  6050.
000630     05  WK-806-6051-IDX   PIC S9(08) USAGE COMP    VALUE  6051.
000640     05  WK-806-6052-IDX   PIC S9(08) USAGE COMP    VALUE  6052.
000650     05  WK-806-6053-IDX   PIC S9(08) USAGE COMP    VALUE  6053.
000660     05  WK-806-6054-IDX   PIC S9(08) USAGE COMP    VALUE  6054.
000670     05  WK-806-6055-IDX   PIC S9(08) USAGE COMP    VALUE  6055.
000680     05  WK-806-6056-IDX   PIC S9(08) USAGE COMP    VALUE  6056.
000690     05  WK-806-6057-IDX   PIC S9(08) USAGE COMP    VALUE  6057.
000700     05  WK-806-6058-IDX   PIC S9(08) USAGE COMP    VALUE  6058.
000710     05  WK-806-6059-IDX   PIC S9(08) USAGE COMP    VALUE  6059.
000720     05  WK-806-6060-IDX   PIC S9(08) USAGE COMP    VALUE  6060.
000730     05  WK-806-6061-IDX   PIC S9(08) USAGE COMP    VALUE  6061.
000740     05  WK-806-6062-IDX   PIC S9(08) USAGE COMP    VALUE  6062.
000750     05  WK-806-6063-IDX   PIC S9(08) USAGE COMP    VALUE  6063.
000760     05  WK-806-6064-IDX   PIC S9(08) USAGE COMP    VALUE  6064.
000770     05  WK-806-6065-IDX   PIC S9(08) USAGE COMP    VALUE  6065.
000780     05  WK-806-6066-IDX   PIC S9(08) USAGE COMP    VALUE  6066.
000790     05  WK-806-6067-IDX   PIC S9(08) USAGE COMP    VALUE  6067.
000800     05  WK-806-6068-IDX   PIC S9(08) USAGE COMP    VALUE  6068.
000810     05  WK-806-6069-IDX   PIC S9(08) USAGE COMP    VALUE  6069.
000820     05  WK-806-6070-IDX   PIC S9(08) USAGE COMP    VALUE  6070.
000830     05  WK-806-6071-IDX   PIC S9(08) USAGE COMP    VALUE  6071.
000840     05  WK-806-6072-IDX   PIC S9(08) USAGE COMP    VALUE  6072.
000850     05  WK-806-6073-IDX   PIC S9(08) USAGE COMP    VALUE  6073.
000860     05  WK-806-6074-IDX   PIC S9(08) USAGE COMP    VALUE  6074.
000870     05  WK-806-6075-IDX   PIC S9(08) USAGE COMP    VALUE  6075.
000880     05  WK-806-6076-IDX   PIC S9(08) USAGE COMP    VALUE  6076.
000890     05  WK-806-6077-IDX   PIC S9(08) USAGE COMP    VALUE  6077.
000900     05  WK-806-6078-IDX   PIC S9(08) USAGE COMP    VALUE  6078.
000910     05  WK-806-6079-IDX   PIC S9(08) USAGE COMP    VALUE  6079.
000920     05  WK-806-6080-IDX   PIC S9(08) USAGE COMP    VALUE  6080.
000930     05  WK-806-6081-IDX   PIC S9(08) USAGE COMP    VALUE  6081.
000940     05  WK-806-6082-IDX   PIC S9(08) USAGE COMP    VALUE  6082.
000950     05  WK-806-6083-IDX   PIC S9(08) USAGE COMP    VALUE  6083.
000960     05  WK-806-6084-IDX   PIC S9(08) USAGE COMP    VALUE  6084.
000970     05  WK-806-6085-IDX   PIC S9(08) USAGE COMP    VALUE  6085.
000980     05  WK-806-6086-IDX   PIC S9(08) USAGE COMP    VALUE  6086.
000990     05  WK-806-6087-IDX   PIC S9(08) USAGE COMP    VALUE  6087.
001000     05  WK-806-6088-IDX   PIC S9(08) USAGE COMP    VALUE  6088.
001010     05  WK-806-6089-IDX   PIC S9(08) USAGE COMP    VALUE  6089.
001020     05  WK-806-6090-IDX   PIC S9(08) USAGE COMP    VALUE  6090.
001030     05  WK-806-6091-IDX   PIC S9(08) USAGE COMP    VALUE  6091.
001040     05  WK-806-6092-IDX   PIC S9(08) USAGE COMP    VALUE  6092.
001050     05  WK-806-6093-IDX   PIC S9(08) USAGE COMP    VALUE  6093.
001060     05  WK-806-6094-IDX   PIC S9(08) USAGE COMP    VALUE  6094.
001070     05  WK-806-6095-IDX   PIC S9(08) USAGE COMP    VALUE  6095.
001080     05  WK-806-6096-IDX   PIC S9(08) USAGE COMP    VALUE  6096.
001090     05  WK-806-6097-IDX   PIC S9(08) USAGE COMP    VALUE  6097.
001100     05  WK-806-6098-IDX   PIC S9(08) USAGE COMP    VALUE  6098.
001110     05  WK-806-6099-IDX   PIC S9(08) USAGE COMP    VALUE  6099.
001120     05  WK-806-6100-IDX   PIC S9(08) USAGE COMP    VALUE  6100.
001130     05  WK-806-6101-IDX   PIC S9(08) USAGE COMP    VALUE  6101.
001140     05  WK-806-6102-IDX   PIC S9(08) USAGE COMP    VALUE  6102.
001150     05  WK-806-6103-IDX   PIC S9(08) USAGE COMP    VALUE  6103.
001160     05  WK-806-6104-IDX   PIC S9(08) USAGE COMP    VALUE  6104.
001170     05  WK-806-6105-IDX   PIC S9(08) USAGE COMP    VALUE  6105.
001180     05  WK-806-6106-IDX   PIC S9(08) USAGE COMP    VALUE  6106.
001190     05  WK-806-6107-IDX   PIC S9(08) USAGE COMP    VALUE  6107.
001200     05  WK-806-6108-IDX   PIC S9(08) USAGE COMP    VALUE  6108.
001210     05  WK-806-6109-IDX   PIC S9(08) USAGE COMP    VALUE  6109.
001220     05  WK-806-6110-IDX   PIC S9(08) USAGE COMP    VALUE  6110.
001230     05  WK-806-6111-IDX   PIC S9(08) USAGE COMP    VALUE  6111.
001240     05  WK-806-6112-IDX   PIC S9(08) USAGE COMP    VALUE  6112.
001250     05  WK-806-6113-IDX   PIC S9(08) USAGE COMP    VALUE  6113.
001260     05  WK-806-6114-IDX   PIC S9(08) USAGE COMP    VALUE  6114.
001270     05  WK-806-6115-IDX   PIC S9(08) USAGE COMP    VALUE  6115.
001280     05  WK-806-6116-IDX   PIC S9(08) USAGE COMP    VALUE  6116.
001290     05  WK-806-6117-IDX   PIC S9(08) USAGE COMP    VALUE  6117.
001300     05  WK-806-6118-IDX   PIC S9(08) USAGE COMP    VALUE  6118.
001310     05  WK-806-6119-IDX   PIC S9(08) USAGE COMP    VALUE  6119.
001320     05  WK-806-6120-IDX   PIC S9(08) USAGE COMP    VALUE  6120.
001330     05  WK-806-6121-IDX   PIC S9(08) USAGE COMP    VALUE  6121.
001340     05  WK-806-6122-IDX   PIC S9(08) USAGE COMP    VALUE  6122.
001350     05  WK-806-6123-IDX   PIC S9(08) USAGE COMP    VALUE  6123.
001360     05  WK-806-6124-IDX   PIC S9(08) USAGE COMP    VALUE  6124.
001370     05  WK-806-6125-IDX   PIC S9(08) USAGE COMP    VALUE  6125.
001380     05  WK-806-6126-IDX   PIC S9(08) USAGE COMP    VALUE  6126.
001390     05  WK-806-6127-IDX   PIC S9(08) USAGE COMP    VALUE  6127.
001400     05  WK-806-6128-IDX   PIC S9(08) USAGE COMP    VALUE  6128.
001410     05  WK-806-6129-IDX   PIC S9(08) USAGE COMP    VALUE  6129.
001420     05  WK-806-6130-IDX   PIC S9(08) USAGE COMP    VALUE  6130.
001430     05  WK-806-6131-IDX   PIC S9(08) USAGE COMP    VALUE  6131.
001440     05  WK-806-6132-IDX   PIC S9(08) USAGE COMP    VALUE  6132.
001450     05  WK-806-6133-IDX   PIC S9(08) USAGE COMP    VALUE  6133.
001460     05  WK-806-6134-IDX   PIC S9(08) USAGE COMP    VALUE  6134.
001470     05  WK-806-6135-IDX   PIC S9(08) USAGE COMP    VALUE  6135.
001480     05  WK-806-6136-IDX   PIC S9(08) USAGE COMP    VALUE  6136.
001490     05  WK-806-6137-IDX   PIC S9(08) USAGE COMP    VALUE  6137.
001500     05  WK-806-6138-IDX   PIC S9(08) USAGE COMP    VALUE  6138.
001510     05  WK-806-6139-IDX   PIC S9(08) USAGE COMP    VALUE  6139.
001520     05  WK-806-6140-IDX   PIC S9(08) USAGE COMP    VALUE  6140.
001530     05  WK-806-6141-IDX   PIC S9(08) USAGE COMP    VALUE  6141.
001540     05  WK-806-6142-IDX   PIC S9(08) USAGE COMP    VALUE  6142.
001550     05  WK-806-6143-IDX   PIC S9(08) USAGE COMP    VALUE  6143.
001560     05  WK-806-6144-IDX   PIC S9(08) USAGE COMP    VALUE  6144.
001570     05  WK-806-6145-IDX   PIC S9(08) USAGE COMP    VALUE  6145.
001580     05  WK-806-6146-IDX   PIC S9(08) USAGE COMP    VALUE  6146.
001590     05  WK-806-6147-IDX   PIC S9(08) USAGE COMP    VALUE  6147.
001600     05  WK-806-6148-IDX   PIC S9(08) USAGE COMP    VALUE  6148.
001610     05  WK-806-6149-IDX   PIC S9(08) USAGE COMP    VALUE  6149.
001620     05  WK-806-6150-IDX   PIC S9(08) USAGE COMP    VALUE  6150.
001630     05  WK-806-6151-IDX   PIC S9(08) USAGE COMP    VALUE  6151.
001640     05  WK-806-6152-IDX   PIC S9(08) USAGE COMP    VALUE  6152.
001650     05  WK-806-6153-IDX   PIC S9(08) USAGE COMP    VALUE  6153.
001660     05  WK-806-6154-IDX   PIC S9(08) USAGE COMP    VALUE  6154.
001670     05  WK-806-6155-IDX   PIC S9(08) USAGE COMP    VALUE  6155.
001680     05  WK-806-6156-IDX   PIC S9(08) USAGE COMP    VALUE  6156.
001690     05  WK-806-6157-IDX   PIC S9(08) USAGE COMP    VALUE  6157.
001700     05  WK-806-6158-IDX   PIC S9(08) USAGE COMP    VALUE  6158.
001710     05  WK-806-6159-IDX   PIC S9(08) USAGE COMP    VALUE  6159.
001720     05  WK-806-6160-IDX   PIC S9(08) USAGE COMP    VALUE  6160.
001730     05  WK-806-6161-IDX   PIC S9(08) USAGE COMP    VALUE  6161.
001740     05  WK-806-6162-IDX   PIC S9(08) USAGE COMP    VALUE  6162.
001750     05  WK-806-6163-IDX   PIC S9(08) USAGE COMP    VALUE  6163.
001760     05  WK-806-6164-IDX   PIC S9(08) USAGE COMP    VALUE  6164.
001770     05  WK-806-6165-IDX   PIC S9(08) USAGE COMP    VALUE  6165.
001780     05  WK-806-6166-IDX   PIC S9(08) USAGE COMP    VALUE  6166.
001790     05  WK-806-6167-IDX   PIC S9(08) USAGE COMP    VALUE  6167.
001800     05  WK-806-6168-IDX   PIC S9(08) USAGE COMP    VALUE  6168.
001810     05  WK-806-6169-IDX   PIC S9(08) USAGE COMP    VALUE  6169.
001820     05  WK-806-6170-IDX   PIC S9(08) USAGE COMP    VALUE  6170.
001830     05  WK-806-6171-IDX   PIC S9(08) USAGE COMP    VALUE  6171.
001840     05  WK-806-6172-IDX   PIC S9(08) USAGE COMP    VALUE  6172.
001850     05  WK-806-6173-IDX   PIC S9(08) USAGE COMP    VALUE  6173.
001860     05  WK-806-6174-IDX   PIC S9(08) USAGE COMP    VALUE  6174.
001870     05  WK-806-6175-IDX   PIC S9(08) USAGE COMP    VALUE  6175.
001880     05  WK-806-6176-IDX   PIC S9(08) USAGE COMP    VALUE  6176.
001890     05  WK-806-6177-IDX   PIC S9(08) USAGE COMP    VALUE  6177.
001900     05  WK-806-6178-IDX   PIC S9(08) USAGE COMP    VALUE  6178.
001910     05  WK-806-6179-IDX   PIC S9(08) USAGE COMP    VALUE  6179.
001920     05  WK-806-6180-IDX   PIC S9(08) USAGE COMP    VALUE  6180.
001930     05  WK-806-6181-IDX   PIC S9(08) USAGE COMP    VALUE  6181.
001940     05  WK-806-6182-IDX   PIC S9(08) USAGE COMP    VALUE  6182.
001950     05  WK-806-6183-IDX   PIC S9(08) USAGE COMP    VALUE  6183.
001960     05  WK-806-6184-IDX   PIC S9(08) USAGE COMP    VALUE  6184.
001970     05  WK-806-6185-IDX   PIC S9(08) USAGE COMP    VALUE  6185.
001980     05  WK-806-6186-IDX   PIC S9(08) USAGE COMP    VALUE  6186.
001990     05  WK-806-6187-IDX   PIC S9(08) USAGE COMP    VALUE  6187.
002000     05  WK-806-6188-IDX   PIC S9(08) USAGE COMP    VALUE  6188.
002010     05  WK-806-6189-IDX   PIC S9(08) USAGE COMP    VALUE  6189.
002020     05  WK-806-6190-IDX   PIC S9(08) USAGE COMP    VALUE  6190.
002030     05  WK-806-6191-IDX   PIC S9(08) USAGE COMP    VALUE  6191.
002040     05  WK-806-6192-IDX   PIC S9(08) USAGE COMP    VALUE  6192.
002050     05  WK-806-6193-IDX   PIC S9(08) USAGE COMP    VALUE  6193.
002060     05  WK-806-6194-IDX   PIC S9(08) USAGE COMP    VALUE  6194.
002070     05  WK-806-6195-IDX   PIC S9(08) USAGE COMP    VALUE  6195.
002080     05  WK-806-6196-IDX   PIC S9(08) USAGE COMP    VALUE  6196.
002090     05  WK-806-6197-IDX   PIC S9(08) USAGE COMP    VALUE  6197.
002100     05  WK-806-6198-IDX   PIC S9(08) USAGE COMP    VALUE  6198.
002110     05  WK-806-6199-IDX   PIC S9(08) USAGE COMP    VALUE  6199.
002120     05  WK-806-6200-IDX   PIC S9(08) USAGE COMP    VALUE  6200.
002130     05  WK-806-6201-IDX   PIC S9(08) USAGE COMP    VALUE  6201.
002140     05  WK-806-6202-IDX   PIC S9(08) USAGE COMP    VALUE  6202.
002150     05  WK-806-6203-IDX   PIC S9(08) USAGE COMP    VALUE  6203.
002160     05  WK-806-6204-IDX   PIC S9(08) USAGE COMP    VALUE  6204.
002170     05  WK-806-6205-IDX   PIC S9(08) USAGE COMP    VALUE  6205.
002180     05  WK-806-6206-IDX   PIC S9(08) USAGE COMP    VALUE  6206.
002190     05  WK-806-6207-IDX   PIC S9(08) USAGE COMP    VALUE  6207.
002200     05  WK-806-6208-IDX   PIC S9(08) USAGE COMP    VALUE  6208.
002210     05  WK-806-6209-IDX   PIC S9(08) USAGE COMP    VALUE  6209.
002220     05  WK-806-6210-IDX   PIC S9(08) USAGE COMP    VALUE  6210.
002230     05  WK-806-6211-IDX   PIC S9(08) USAGE COMP    VALUE  6211.
002240     05  WK-806-6212-IDX   PIC S9(08) USAGE COMP    VALUE  6212.
002250     05  WK-806-6213-IDX   PIC S9(08) USAGE COMP    VALUE  6213.
002260     05  WK-806-6214-IDX   PIC S9(08) USAGE COMP    VALUE  6214.
002270     05  WK-806-6215-IDX   PIC S9(08) USAGE COMP    VALUE  6215.
002280     05  WK-806-6216-IDX   PIC S9(08) USAGE COMP    VALUE  6216.
002290     05  WK-806-6217-IDX   PIC S9(08) USAGE COMP    VALUE  6217.
002300     05  WK-806-6218-IDX   PIC S9(08) USAGE COMP    VALUE  6218.
002310     05  WK-806-6219-IDX   PIC S9(08) USAGE COMP    VALUE  6219.
002320     05  WK-806-6220-IDX   PIC S9(08) USAGE COMP    VALUE  6220.
002330     05  WK-806-6221-IDX   PIC S9(08) USAGE COMP    VALUE  6221.
002340     05  WK-806-6222-IDX   PIC S9(08) USAGE COMP    VALUE  6222.
002350     05  WK-806-6223-IDX   PIC S9(08) USAGE COMP    VALUE  6223.
002360     05  WK-806-6224-IDX   PIC S9(08) USAGE COMP    VALUE  6224.
002370     05  WK-806-6225-IDX   PIC S9(08) USAGE COMP    VALUE  6225.
002380     05  WK-806-6226-IDX   PIC S9(08) USAGE COMP    VALUE  6226.
002390     05  WK-806-6227-IDX   PIC S9(08) USAGE COMP    VALUE  6227.
002400     05  WK-806-6228-IDX   PIC S9(08) USAGE COMP    VALUE  6228.
002410     05  WK-806-6229-IDX   PIC S9(08) USAGE COMP    VALUE  6229.
002420     05  WK-806-6230-IDX   PIC S9(08) USAGE COMP    VALUE  6230.
002430     05  WK-806-6231-IDX   PIC S9(08) USAGE COMP    VALUE  6231.
002440     05  WK-806-6232-IDX   PIC S9(08) USAGE COMP    VALUE  6232.
002450     05  WK-806-6233-IDX   PIC S9(08) USAGE COMP    VALUE  6233.
002460     05  WK-806-6234-IDX   PIC S9(08) USAGE COMP    VALUE  6234.
002470     05  WK-806-6235-IDX   PIC S9(08) USAGE COMP    VALUE  6235.
002480     05  WK-806-6236-IDX   PIC S9(08) USAGE COMP    VALUE  6236.
002490     05  WK-806-6237-IDX   PIC S9(08) USAGE COMP    VALUE  6237.
002500     05  WK-806-6238-IDX   PIC S9(08) USAGE COMP    VALUE  6238.
002510     05  WK-806-6239-IDX   PIC S9(08) USAGE COMP    VALUE  6239.
002520     05  WK-806-6240-IDX   PIC S9(08) USAGE COMP    VALUE  6240.
002530     05  WK-806-6241-IDX   PIC S9(08) USAGE COMP    VALUE  6241.
002540     05  WK-806-6242-IDX   PIC S9(08) USAGE COMP    VALUE  6242.
002550     05  WK-806-6243-IDX   PIC S9(08) USAGE COMP    VALUE  6243.
002560     05  WK-806-6244-IDX   PIC S9(08) USAGE COMP    VALUE  6244.
002570     05  WK-806-6245-IDX   PIC S9(08) USAGE COMP    VALUE  6245.
002580     05  WK-806-6246-IDX   PIC S9(08) USAGE COMP    VALUE  6246.
002590     05  WK-806-6247-IDX   PIC S9(08) USAGE COMP    VALUE  6247.
002600     05  WK-806-6248-IDX   PIC S9(08) USAGE COMP    VALUE  6248.
002610     05  WK-806-6249-IDX   PIC S9(08) USAGE COMP    VALUE  6249.
002620     05  WK-806-6250-IDX   PIC S9(08) USAGE COMP    VALUE  6250.
002630     05  WK-806-6251-IDX   PIC S9(08) USAGE COMP    VALUE  6251.
002640     05  WK-806-6252-IDX   PIC S9(08) USAGE COMP    VALUE  6252.
002650     05  WK-806-6253-IDX   PIC S9(08) USAGE COMP    VALUE  6253.
002660     05  WK-806-6254-IDX   PIC S9(08) USAGE COMP    VALUE  6254.
002670     05  WK-806-6255-IDX   PIC S9(08) USAGE COMP    VALUE  6255.
002680     05  WK-806-6256-IDX   PIC S9(08) USAGE COMP    VALUE  6256.
002690     05  WK-806-6257-IDX   PIC S9(08) USAGE COMP    VALUE  6257.
002700     05  WK-806-6258-IDX   PIC S9(08) USAGE COMP    VALUE  6258.
002710     05  WK-806-6259-IDX   PIC S9(08) USAGE COMP    VALUE  6259.
002720     05  WK-806-6260-IDX   PIC S9(08) USAGE COMP    VALUE  6260.
002730     05  WK-806-6261-IDX   PIC S9(08) USAGE COMP    VALUE  6261.
002740     05  WK-806-6262-IDX   PIC S9(08) USAGE COMP    VALUE  6262.
002750     05  WK-806-6263-IDX   PIC S9(08) USAGE COMP    VALUE  6263.
002760     05  WK-806-6264-IDX   PIC S9(08) USAGE COMP    VALUE  6264.
002770     05  WK-806-6265-IDX   PIC S9(08) USAGE COMP    VALUE  6265.
002780     05  WK-806-6266-IDX   PIC S9(08) USAGE COMP    VALUE  6266.
002790     05  WK-806-6267-IDX   PIC S9(08) USAGE COMP    VALUE  6267.
002800     05  WK-806-6268-IDX   PIC S9(08) USAGE COMP    VALUE  6268.
002810     05  WK-806-6269-IDX   PIC S9(08) USAGE COMP    VALUE  6269.
002820     05  WK-806-6270-IDX   PIC S9(08) USAGE COMP    VALUE  6270.
002830     05  WK-806-6271-IDX   PIC S9(08) USAGE COMP    VALUE  6271.
002840     05  WK-806-6272-IDX   PIC S9(08) USAGE COMP    VALUE  6272.
002850     05  WK-806-6273-IDX   PIC S9(08) USAGE COMP    VALUE  6273.
002860     05  WK-806-6274-IDX   PIC S9(08) USAGE COMP    VALUE  6274.
002870     05  WK-806-6275-IDX   PIC S9(08) USAGE COMP    VALUE  6275.
002880     05  WK-806-6276-IDX   PIC S9(08) USAGE COMP    VALUE  6276.
002890     05  WK-806-6277-IDX   PIC S9(08) USAGE COMP    VALUE  6277.
002900     05  WK-806-6278-IDX   PIC S9(08) USAGE COMP    VALUE  6278.
002910     05  WK-806-6279-IDX   PIC S9(08) USAGE COMP    VALUE  6279.
002920     05  WK-806-6280-IDX   PIC S9(08) USAGE COMP    VALUE  6280.
002930     05  WK-806-6281-IDX   PIC S9(08) USAGE COMP    VALUE  6281.
002940     05  WK-806-6282-IDX   PIC S9(08) USAGE COMP    VALUE  6282.
002950     05  WK-806-6283-IDX   PIC S9(08) USAGE COMP    VALUE  6283.
002960     05  WK-806-6284-IDX   PIC S9(08) USAGE COMP    VALUE  6284.
002970     05  WK-806-6285-IDX   PIC S9(08) USAGE COMP    VALUE  6285.
002980     05  WK-806-6286-IDX   PIC S9(08) USAGE COMP    VALUE  6286.
002990     05  WK-806-6287-IDX   PIC S9(08) USAGE COMP    VALUE  6287.
003000     05  WK-806-6288-IDX   PIC S9(08) USAGE COMP    VALUE  6288.
003010     05  WK-806-6289-IDX   PIC S9(08) USAGE COMP    VALUE  6289.
003020     05  WK-806-6290-IDX   PIC S9(08) USAGE COMP    VALUE  6290.
003030     05  WK-806-6291-IDX   PIC S9(08) USAGE COMP    VALUE  6291.
003040     05  WK-806-6292-IDX   PIC S9(08) USAGE COMP    VALUE  6292.
003050     05  WK-806-6293-IDX   PIC S9(08) USAGE COMP    VALUE  6293.
003060     05  WK-806-6294-IDX   PIC S9(08) USAGE COMP    VALUE  6294.
003070     05  WK-806-6295-IDX   PIC S9(08) USAGE COMP    VALUE  6295.
003080     05  WK-806-6296-IDX   PIC S9(08) USAGE COMP    VALUE  6296.
003090     05  WK-806-6297-IDX   PIC S9(08) USAGE COMP    VALUE  6297.
003100     05  WK-806-6298-IDX   PIC S9(08) USAGE COMP    VALUE  6298.
003110     05  WK-806-6299-IDX   PIC S9(08) USAGE COMP    VALUE  6299.
003120     05  WK-806-6300-IDX   PIC S9(08) USAGE COMP    VALUE  6300.
003130     05  WK-806-6301-IDX   PIC S9(08) USAGE COMP    VALUE  6301.
003140     05  WK-806-6302-IDX   PIC S9(08) USAGE COMP    VALUE  6302.
003150     05  WK-806-6303-IDX   PIC S9(08) USAGE COMP    VALUE  6303.
003160     05  WK-806-6304-IDX   PIC S9(08) USAGE COMP    VALUE  6304.
003170     05  WK-806-6305-IDX   PIC S9(08) USAGE COMP    VALUE  6305.
003180     05  WK-806-6306-IDX   PIC S9(08) USAGE COMP    VALUE  6306.
003190     05  WK-806-6307-IDX   PIC S9(08) USAGE COMP    VALUE  6307.
003200     05  WK-806-6308-IDX   PIC S9(08) USAGE COMP    VALUE  6308.
003210     05  WK-806-6309-IDX   PIC S9(08) USAGE COMP    VALUE  6309.
003220     05  WK-806-6310-IDX   PIC S9(08) USAGE COMP    VALUE  6310.
003230     05  WK-806-6311-IDX   PIC S9(08) USAGE COMP    VALUE  6311.
003240     05  WK-806-6312-IDX   PIC S9(08) USAGE COMP    VALUE  6312.
003250     05  WK-806-6313-IDX   PIC S9(08) USAGE COMP    VALUE  6313.
003260     05  WK-806-6314-IDX   PIC S9(08) USAGE COMP    VALUE  6314.
003270     05  WK-806-6315-IDX   PIC S9(08) USAGE COMP    VALUE  6315.
003280     05  WK-806-6316-IDX   PIC S9(08) USAGE COMP    VALUE  6316.
003290     05  WK-806-6317-IDX   PIC S9(08) USAGE COMP    VALUE  6317.
003300     05  WK-806-6318-IDX   PIC S9(08) USAGE COMP    VALUE  6318.
003310     05  WK-806-6319-IDX   PIC S9(08) USAGE COMP    VALUE  6319.
003320     05  WK-806-6320-IDX   PIC S9(08) USAGE COMP    VALUE  6320.
003330     05  WK-806-6321-IDX   PIC S9(08) USAGE COMP    VALUE  6321.
003340     05  WK-806-6322-IDX   PIC S9(08) USAGE COMP    VALUE  6322.
003350     05  WK-806-6323-IDX   PIC S9(08) USAGE COMP    VALUE  6323.
003360     05  WK-806-6324-IDX   PIC S9(08) USAGE COMP    VALUE  6324.
003370     05  WK-806-6325-IDX   PIC S9(08) USAGE COMP    VALUE  6325.
003380     05  WK-806-6326-IDX   PIC S9(08) USAGE COMP    VALUE  6326.
003390     05  WK-806-6327-IDX   PIC S9(08) USAGE COMP    VALUE  6327.
003400     05  WK-806-6328-IDX   PIC S9(08) USAGE COMP    VALUE  6328.
003410     05  WK-806-6329-IDX   PIC S9(08) USAGE COMP    VALUE  6329.
003420     05  WK-806-6330-IDX   PIC S9(08) USAGE COMP    VALUE  6330.
003430     05  WK-806-6331-IDX   PIC S9(08) USAGE COMP    VALUE  6331.
003440     05  WK-806-6332-IDX   PIC S9(08) USAGE COMP    VALUE  6332.
003450     05  WK-806-6333-IDX   PIC S9(08) USAGE COMP    VALUE  6333.
003460     05  WK-806-6334-IDX   PIC S9(08) USAGE COMP    VALUE  6334.
003470     05  WK-806-6335-IDX   PIC S9(08) USAGE COMP    VALUE  6335.
003480     05  WK-806-6336-IDX   PIC S9(08) USAGE COMP    VALUE  6336.
003490     05  WK-806-6337-IDX   PIC S9(08) USAGE COMP    VALUE  6337.
003500     05  WK-806-6338-IDX   PIC S9(08) USAGE COMP    VALUE  6338.
003510     05  WK-806-6339-IDX   PIC S9(08) USAGE COMP    VALUE  6339.
003520     05  WK-806-6340-IDX   PIC S9(08) USAGE COMP    VALUE  6340.
003530     05  WK-806-6341-IDX   PIC S9(08) USAGE COMP    VALUE  6341.
003540     05  WK-806-6342-IDX   PIC S9(08) USAGE COMP    VALUE  6342.
003550     05  WK-806-6343-IDX   PIC S9(08) USAGE COMP    VALUE  6343.
003560     05  WK-806-6344-IDX   PIC S9(08) USAGE COMP    VALUE  6344.
003570     05  WK-806-6345-IDX   PIC S9(08) USAGE COMP    VALUE  6345.
003580     05  WK-806-6346-IDX   PIC S9(08) USAGE COMP    VALUE  6346.
003590     05  WK-806-6347-IDX   PIC S9(08) USAGE COMP    VALUE  6347.
003600     05  WK-806-6348-IDX   PIC S9(08) USAGE COMP    VALUE  6348.
003610     05  WK-806-6349-IDX   PIC S9(08) USAGE COMP    VALUE  6349.
003620     05  WK-806-6350-IDX   PIC S9(08) USAGE COMP    VALUE  6350.
003630     05  WK-806-6351-IDX   PIC S9(08) USAGE COMP    VALUE  6351.
003640     05  WK-806-6352-IDX   PIC S9(08) USAGE COMP    VALUE  6352.
003650     05  WK-806-6353-IDX   PIC S9(08) USAGE COMP    VALUE  6353.
003660     05  WK-806-6354-IDX   PIC S9(08) USAGE COMP    VALUE  6354.
003670     05  WK-806-6355-IDX   PIC S9(08) USAGE COMP    VALUE  6355.
003680     05  WK-806-6356-IDX   PIC S9(08) USAGE COMP    VALUE  6356.
003690     05  WK-806-6357-IDX   PIC S9(08) USAGE COMP    VALUE  6357.
003700     05  WK-806-6358-IDX   PIC S9(08) USAGE COMP    VALUE  6358.
003710     05  WK-806-6359-IDX   PIC S9(08) USAGE COMP    VALUE  6359.
003720     05  WK-806-6360-IDX   PIC S9(08) USAGE COMP    VALUE  6360.
003730     05  WK-806-6361-IDX   PIC S9(08) USAGE COMP    VALUE  6361.
003740     05  WK-806-6362-IDX   PIC S9(08) USAGE COMP    VALUE  6362.
003750     05  WK-806-6363-IDX   PIC S9(08) USAGE COMP    VALUE  6363.
003760     05  WK-806-6364-IDX   PIC S9(08) USAGE COMP    VALUE  6364.
003770     05  WK-806-6365-IDX   PIC S9(08) USAGE COMP    VALUE  6365.
003780     05  WK-806-6366-IDX   PIC S9(08) USAGE COMP    VALUE  6366.
003790     05  WK-806-6367-IDX   PIC S9(08) USAGE COMP    VALUE  6367.
003800     05  WK-806-6368-IDX   PIC S9(08) USAGE COMP    VALUE  6368.
003810     05  WK-806-6369-IDX   PIC S9(08) USAGE COMP    VALUE  6369.
003820     05  WK-806-6370-IDX   PIC S9(08) USAGE COMP    VALUE  6370.
003830     05  WK-806-6371-IDX   PIC S9(08) USAGE COMP    VALUE  6371.
003840     05  WK-806-6372-IDX   PIC S9(08) USAGE COMP    VALUE  6372.
003850     05  WK-806-6373-IDX   PIC S9(08) USAGE COMP    VALUE  6373.
003860     05  WK-806-6374-IDX   PIC S9(08) USAGE COMP    VALUE  6374.
003870     05  WK-806-6375-IDX   PIC S9(08) USAGE COMP    VALUE  6375.
003880     05  WK-806-6376-IDX   PIC S9(08) USAGE COMP    VALUE  6376.
003890     05  WK-806-6377-IDX   PIC S9(08) USAGE COMP    VALUE  6377.
003900     05  WK-806-6378-IDX   PIC S9(08) USAGE COMP    VALUE  6378.
003910     05  WK-806-6379-IDX   PIC S9(08) USAGE COMP    VALUE  6379.
003920     05  WK-806-6380-IDX   PIC S9(08) USAGE COMP    VALUE  6380.
003930     05  WK-806-6381-IDX   PIC S9(08) USAGE COMP    VALUE  6381.
003940     05  WK-806-6382-IDX   PIC S9(08) USAGE COMP    VALUE  6382.
003950     05  WK-806-6383-IDX   PIC S9(08) USAGE COMP    VALUE  6383.
003960     05  WK-806-6384-IDX   PIC S9(08) USAGE COMP    VALUE  6384.
003970     05  WK-806-6385-IDX   PIC S9(08) USAGE COMP    VALUE  6385.
003980     05  WK-806-6386-IDX   PIC S9(08) USAGE COMP    VALUE  6386.
003990     05  WK-806-6387-IDX   PIC S9(08) USAGE COMP    VALUE  6387.
004000     05  WK-806-6388-IDX   PIC S9(08) USAGE COMP    VALUE  6388.
004010     05  WK-806-6389-IDX   PIC S9(08) USAGE COMP    VALUE  6389.
004020     05  WK-806-6390-IDX   PIC S9(08) USAGE COMP    VALUE  6390.
004030     05  WK-806-6391-IDX   PIC S9(08) USAGE COMP    VALUE  6391.
004040     05  WK-806-6392-IDX   PIC S9(08) USAGE COMP    VALUE  6392.
004050     05  WK-806-6393-IDX   PIC S9(08) USAGE COMP    VALUE  6393.
004060     05  WK-806-6394-IDX   PIC S9(08) USAGE COMP    VALUE  6394.
004070     05  WK-806-6395-IDX   PIC S9(08) USAGE COMP    VALUE  6395.
004080     05  WK-806-6396-IDX   PIC S9(08) USAGE COMP    VALUE  6396.
004090     05  WK-806-6397-IDX   PIC S9(08) USAGE COMP    VALUE  6397.
004100     05  WK-806-6398-IDX   PIC S9(08) USAGE COMP    VALUE  6398.
004110     05  WK-806-6399-IDX   PIC S9(08) USAGE COMP    VALUE  6399.
004120     05  WK-806-6400-IDX   PIC S9(08) USAGE COMP    VALUE  6400.
004130     05  WK-806-6401-IDX   PIC S9(08) USAGE COMP    VALUE  6401.
004140     05  WK-806-6402-IDX   PIC S9(08) USAGE COMP    VALUE  6402.
004150     05  WK-806-6403-IDX   PIC S9(08) USAGE COMP    VALUE  6403.
004160     05  WK-806-6404-IDX   PIC S9(08) USAGE COMP    VALUE  6404.
004170     05  WK-806-6405-IDX   PIC S9(08) USAGE COMP    VALUE  6405.
004180     05  WK-806-6406-IDX   PIC S9(08) USAGE COMP    VALUE  6406.
004190     05  WK-806-6407-IDX   PIC S9(08) USAGE COMP    VALUE  6407.
004200     05  WK-806-6408-IDX   PIC S9(08) USAGE COMP    VALUE  6408.
004210     05  WK-806-6409-IDX   PIC S9(08) USAGE COMP    VALUE  6409.
004220     05  WK-806-6410-IDX   PIC S9(08) USAGE COMP    VALUE  6410.
004230     05  WK-806-6411-IDX   PIC S9(08) USAGE COMP    VALUE  6411.
004240     05  WK-806-6412-IDX   PIC S9(08) USAGE COMP    VALUE  6412.
004250     05  WK-806-6413-IDX   PIC S9(08) USAGE COMP    VALUE  6413.
004260     05  WK-806-6414-IDX   PIC S9(08) USAGE COMP    VALUE  6414.
004270     05  WK-806-6415-IDX   PIC S9(08) USAGE COMP    VALUE  6415.
004280     05  WK-806-6416-IDX   PIC S9(08) USAGE COMP    VALUE  6416.
004290     05  WK-806-6417-IDX   PIC S9(08) USAGE COMP    VALUE  6417.
004300     05  WK-806-6418-IDX   PIC S9(08) USAGE COMP    VALUE  6418.
004310     05  WK-806-6419-IDX   PIC S9(08) USAGE COMP    VALUE  6419.
004320     05  WK-806-6420-IDX   PIC S9(08) USAGE COMP    VALUE  6420.
004330     05  WK-806-6421-IDX   PIC S9(08) USAGE COMP    VALUE  6421.
004340     05  WK-806-6422-IDX   PIC S9(08) USAGE COMP    VALUE  6422.
004350     05  WK-806-6423-IDX   PIC S9(08) USAGE COMP    VALUE  6423.
004360     05  WK-806-6424-IDX   PIC S9(08) USAGE COMP    VALUE  6424.
004370     05  WK-806-6425-IDX   PIC S9(08) USAGE COMP    VALUE  6425.
004380     05  WK-806-6426-IDX   PIC S9(08) USAGE COMP    VALUE  6426.
004390     05  WK-806-6427-IDX   PIC S9(08) USAGE COMP    VALUE  6427.
004400     05  WK-806-6428-IDX   PIC S9(08) USAGE COMP    VALUE  6428.
004410     05  WK-806-6429-IDX   PIC S9(08) USAGE COMP    VALUE  6429.
004420     05  WK-806-6430-IDX   PIC S9(08) USAGE COMP    VALUE  6430.
004430     05  WK-806-6431-IDX   PIC S9(08) USAGE COMP    VALUE  6431.
004440     05  WK-806-6432-IDX   PIC S9(08) USAGE COMP    VALUE  6432.
004450     05  WK-806-6433-IDX   PIC S9(08) USAGE COMP    VALUE  6433.
004460     05  WK-806-6434-IDX   PIC S9(08) USAGE COMP    VALUE  6434.
004470     05  WK-806-6435-IDX   PIC S9(08) USAGE COMP    VALUE  6435.
004480     05  WK-806-6436-IDX   PIC S9(08) USAGE COMP    VALUE  6436.
004490     05  WK-806-6437-IDX   PIC S9(08) USAGE COMP    VALUE  6437.
004500     05  WK-806-6438-IDX   PIC S9(08) USAGE COMP    VALUE  6438.
004510     05  WK-806-6439-IDX   PIC S9(08) USAGE COMP    VALUE  6439.
004520     05  WK-806-6440-IDX   PIC S9(08) USAGE COMP    VALUE  6440.
004530     05  WK-806-6441-IDX   PIC S9(08) USAGE COMP    VALUE  6441.
004540     05  WK-806-6442-IDX   PIC S9(08) USAGE COMP    VALUE  6442.
004550     05  WK-806-6443-IDX   PIC S9(08) USAGE COMP    VALUE  6443.
004560     05  WK-806-6444-IDX   PIC S9(08) USAGE COMP    VALUE  6444.
004570     05  WK-806-6445-IDX   PIC S9(08) USAGE COMP    VALUE  6445.
004580     05  WK-806-6446-IDX   PIC S9(08) USAGE COMP    VALUE  6446.
004590     05  WK-806-6447-IDX   PIC S9(08) USAGE COMP    VALUE  6447.
004600     05  WK-806-6448-IDX   PIC S9(08) USAGE COMP    VALUE  6448.
004610     05  WK-806-6449-IDX   PIC S9(08) USAGE COMP    VALUE  6449.
004620     05  WK-806-6450-IDX   PIC S9(08) USAGE COMP    VALUE  6450.
004630     05  WK-806-6451-IDX   PIC S9(08) USAGE COMP    VALUE  6451.
004640     05  WK-806-6452-IDX   PIC S9(08) USAGE COMP    VALUE  6452.
004650     05  WK-806-6453-IDX   PIC S9(08) USAGE COMP    VALUE  6453.
004660     05  WK-806-6454-IDX   PIC S9(08) USAGE COMP    VALUE  6454.
004670     05  WK-806-6455-IDX   PIC S9(08) USAGE COMP    VALUE  6455.
004680     05  WK-806-6456-IDX   PIC S9(08) USAGE COMP    VALUE  6456.
004690     05  WK-806-6457-IDX   PIC S9(08) USAGE COMP    VALUE  6457.
004700     05  WK-806-6458-IDX   PIC S9(08) USAGE COMP    VALUE  6458.
004710     05  WK-806-6459-IDX   PIC S9(08) USAGE COMP    VALUE  6459.
004720     05  WK-806-6460-IDX   PIC S9(08) USAGE COMP    VALUE  6460.
004730     05  WK-806-6461-IDX   PIC S9(08) USAGE COMP    VALUE  6461.
004740     05  WK-806-6462-IDX   PIC S9(08) USAGE COMP    VALUE  6462.
004750     05  WK-806-6463-IDX   PIC S9(08) USAGE COMP    VALUE  6463.
004760     05  WK-806-6464-IDX   PIC S9(08) USAGE COMP    VALUE  6464.
004770     05  WK-806-6465-IDX   PIC S9(08) USAGE COMP    VALUE  6465.
004780     05  WK-806-6466-IDX   PIC S9(08) USAGE COMP    VALUE  6466.
004790     05  WK-806-6467-IDX   PIC S9(08) USAGE COMP    VALUE  6467.
004800     05  WK-806-6468-IDX   PIC S9(08) USAGE COMP    VALUE  6468.
004810     05  WK-806-6469-IDX   PIC S9(08) USAGE COMP    VALUE  6469.
004820     05  WK-806-6470-IDX   PIC S9(08) USAGE COMP    VALUE  6470.
004830     05  WK-806-6471-IDX   PIC S9(08) USAGE COMP    VALUE  6471.
004840     05  WK-806-6472-IDX   PIC S9(08) USAGE COMP    VALUE  6472.
004850     05  WK-806-6473-IDX   PIC S9(08) USAGE COMP    VALUE  6473.
004860     05  WK-806-6474-IDX   PIC S9(08) USAGE COMP    VALUE  6474.
004870     05  WK-806-6475-IDX   PIC S9(08) USAGE COMP    VALUE  6475.
004880     05  WK-806-6476-IDX   PIC S9(08) USAGE COMP    VALUE  6476.
004890     05  WK-806-6477-IDX   PIC S9(08) USAGE COMP    VALUE  6477.
004900     05  WK-806-6478-IDX   PIC S9(08) USAGE COMP    VALUE  6478.
004910     05  WK-806-6479-IDX   PIC S9(08) USAGE COMP    VALUE  6479.
004920     05  WK-806-6480-IDX   PIC S9(08) USAGE COMP    VALUE  6480.
004930     05  WK-806-6481-IDX   PIC S9(08) USAGE COMP    VALUE  6481.
004940     05  WK-806-6482-IDX   PIC S9(08) USAGE COMP    VALUE  6482.
004950     05  WK-806-6483-IDX   PIC S9(08) USAGE COMP    VALUE  6483.
004960     05  WK-806-6484-IDX   PIC S9(08) USAGE COMP    VALUE  6484.
004970     05  WK-806-6485-IDX   PIC S9(08) USAGE COMP    VALUE  6485.
004980     05  WK-806-6486-IDX   PIC S9(08) USAGE COMP    VALUE  6486.
004990     05  WK-806-6487-IDX   PIC S9(08) USAGE COMP    VALUE  6487.
005000     05  WK-806-6488-IDX   PIC S9(08) USAGE COMP    VALUE  6488.
005010     05  WK-806-6489-IDX   PIC S9(08) USAGE COMP    VALUE  6489.
005020     05  WK-806-6490-IDX   PIC S9(08) USAGE COMP    VALUE  6490.
005030     05  WK-806-6491-IDX   PIC S9(08) USAGE COMP    VALUE  6491.
005040     05  WK-806-6492-IDX   PIC S9(08) USAGE COMP    VALUE  6492.
005050     05  WK-806-6493-IDX   PIC S9(08) USAGE COMP    VALUE  6493.
005060     05  WK-806-6494-IDX   PIC S9(08) USAGE COMP    VALUE  6494.
005070     05  WK-806-6495-IDX   PIC S9(08) USAGE COMP    VALUE  6495.
005080     05  WK-806-6496-IDX   PIC S9(08) USAGE COMP    VALUE  6496.
005090     05  WK-806-6497-IDX   PIC S9(08) USAGE COMP    VALUE  6497.
005100     05  WK-806-6498-IDX   PIC S9(08) USAGE COMP    VALUE  6498.
005110     05  WK-806-6499-IDX   PIC S9(08) USAGE COMP    VALUE  6499.
005120     05  WK-806-6500-IDX   PIC S9(08) USAGE COMP    VALUE  6500.
005130     05  WK-806-6501-IDX   PIC S9(08) USAGE COMP    VALUE  6501.
005140     05  WK-806-6502-IDX   PIC S9(08) USAGE COMP    VALUE  6502.
005150     05  WK-806-6503-IDX   PIC S9(08) USAGE COMP    VALUE  6503.
005160     05  WK-806-6504-IDX   PIC S9(08) USAGE COMP    VALUE  6504.
005170     05  WK-806-6505-IDX   PIC S9(08) USAGE COMP    VALUE  6505.
005180     05  WK-806-6506-IDX   PIC S9(08) USAGE COMP    VALUE  6506.
005190     05  WK-806-6507-IDX   PIC S9(08) USAGE COMP    VALUE  6507.
005200     05  WK-806-6508-IDX   PIC S9(08) USAGE COMP    VALUE  6508.
005210     05  WK-806-6509-IDX   PIC S9(08) USAGE COMP    VALUE  6509.
005220     05  WK-806-6510-IDX   PIC S9(08) USAGE COMP    VALUE  6510.
005230     05  WK-806-6511-IDX   PIC S9(08) USAGE COMP    VALUE  6511.
005240     05  WK-806-6512-IDX   PIC S9(08) USAGE COMP    VALUE  6512.
005250     05  WK-806-6513-IDX   PIC S9(08) USAGE COMP    VALUE  6513.
005260     05  WK-806-6514-IDX   PIC S9(08) USAGE COMP    VALUE  6514.
005270     05  WK-806-6515-IDX   PIC S9(08) USAGE COMP    VALUE  6515.
005280     05  WK-806-6516-IDX   PIC S9(08) USAGE COMP    VALUE  6516.
005290     05  WK-806-6517-IDX   PIC S9(08) USAGE COMP    VALUE  6517.
005300     05  WK-806-6518-IDX   PIC S9(08) USAGE COMP    VALUE  6518.
005310     05  WK-806-6519-IDX   PIC S9(08) USAGE COMP    VALUE  6519.
005320     05  WK-806-6520-IDX   PIC S9(08) USAGE COMP    VALUE  6520.
005330     05  WK-806-6521-IDX   PIC S9(08) USAGE COMP    VALUE  6521.
005340     05  WK-806-6522-IDX   PIC S9(08) USAGE COMP    VALUE  6522.
005350     05  WK-806-6523-IDX   PIC S9(08) USAGE COMP    VALUE  6523.
005360     05  WK-806-6524-IDX   PIC S9(08) USAGE COMP    VALUE  6524.
005370     05  WK-806-6525-IDX   PIC S9(08) USAGE COMP    VALUE  6525.
005380     05  WK-806-6526-IDX   PIC S9(08) USAGE COMP    VALUE  6526.
005390     05  WK-806-6527-IDX   PIC S9(08) USAGE COMP    VALUE  6527.
005400     05  WK-806-6528-IDX   PIC S9(08) USAGE COMP    VALUE  6528.
005410     05  WK-806-6529-IDX   PIC S9(08) USAGE COMP    VALUE  6529.
005420     05  WK-806-6530-IDX   PIC S9(08) USAGE COMP    VALUE  6530.
005430     05  WK-806-6531-IDX   PIC S9(08) USAGE COMP    VALUE  6531.
005440     05  WK-806-6532-IDX   PIC S9(08) USAGE COMP    VALUE  6532.
005450     05  WK-806-6533-IDX   PIC S9(08) USAGE COMP    VALUE  6533.
005460     05  WK-806-6534-IDX   PIC S9(08) USAGE COMP    VALUE  6534.
005470     05  WK-806-6535-IDX   PIC S9(08) USAGE COMP    VALUE  6535.
005480     05  WK-806-6536-IDX   PIC S9(08) USAGE COMP    VALUE  6536.
005490     05  WK-806-6537-IDX   PIC S9(08) USAGE COMP    VALUE  6537.
005500     05  WK-806-6538-IDX   PIC S9(08) USAGE COMP    VALUE  6538.
005510     05  WK-806-6539-IDX   PIC S9(08) USAGE COMP    VALUE  6539.
005520     05  WK-806-6540-IDX   PIC S9(08) USAGE COMP    VALUE  6540.
005530     05  WK-806-6541-IDX   PIC S9(08) USAGE COMP    VALUE  6541.
005540     05  WK-806-6542-IDX   PIC S9(08) USAGE COMP    VALUE  6542.
005550     05  WK-806-6543-IDX   PIC S9(08) USAGE COMP    VALUE  6543.
005560     05  WK-806-6544-IDX   PIC S9(08) USAGE COMP    VALUE  6544.
005570     05  WK-806-6545-IDX   PIC S9(08) USAGE COMP    VALUE  6545.
005580     05  WK-806-6546-IDX   PIC S9(08) USAGE COMP    VALUE  6546.
005590     05  WK-806-6547-IDX   PIC S9(08) USAGE COMP    VALUE  6547.
005600     05  WK-806-6548-IDX   PIC S9(08) USAGE COMP    VALUE  6548.
005610     05  WK-806-6549-IDX   PIC S9(08) USAGE COMP    VALUE  6549.
005620     05  WK-806-6550-IDX   PIC S9(08) USAGE COMP    VALUE  6550.
005630     05  WK-806-6551-IDX   PIC S9(08) USAGE COMP    VALUE  6551.
005640     05  WK-806-6552-IDX   PIC S9(08) USAGE COMP    VALUE  6552.
005650     05  WK-806-6553-IDX   PIC S9(08) USAGE COMP    VALUE  6553.
005660     05  WK-806-6554-IDX   PIC S9(08) USAGE COMP    VALUE  6554.
005670     05  WK-806-6555-IDX   PIC S9(08) USAGE COMP    VALUE  6555.
005680     05  WK-806-6556-IDX   PIC S9(08) USAGE COMP    VALUE  6556.
005690     05  WK-806-6557-IDX   PIC S9(08) USAGE COMP    VALUE  6557.
005700     05  WK-806-6558-IDX   PIC S9(08) USAGE COMP    VALUE  6558.
005710     05  WK-806-6559-IDX   PIC S9(08) USAGE COMP    VALUE  6559.
005720     05  WK-806-6560-IDX   PIC S9(08) USAGE COMP    VALUE  6560.
005730     05  WK-806-6561-IDX   PIC S9(08) USAGE COMP    VALUE  6561.
005740     05  WK-806-6562-IDX   PIC S9(08) USAGE COMP    VALUE  6562.
005750     05  WK-806-6563-IDX   PIC S9(08) USAGE COMP    VALUE  6563.
005760     05  WK-806-6564-IDX   PIC S9(08) USAGE COMP    VALUE  6564.
005770     05  WK-806-6565-IDX   PIC S9(08) USAGE COMP    VALUE  6565.
005780     05  WK-806-6566-IDX   PIC S9(08) USAGE COMP    VALUE  6566.
005790     05  WK-806-6567-IDX   PIC S9(08) USAGE COMP    VALUE  6567.
005800     05  WK-806-6568-IDX   PIC S9(08) USAGE COMP    VALUE  6568.
005810     05  WK-806-6569-IDX   PIC S9(08) USAGE COMP    VALUE  6569.
005820     05  WK-806-6570-IDX   PIC S9(08) USAGE COMP    VALUE  6570.
005830     05  WK-806-6571-IDX   PIC S9(08) USAGE COMP    VALUE  6571.
005840     05  WK-806-6572-IDX   PIC S9(08) USAGE COMP    VALUE  6572.
005850     05  WK-806-6573-IDX   PIC S9(08) USAGE COMP    VALUE  6573.
005860     05  WK-806-6574-IDX   PIC S9(08) USAGE COMP    VALUE  6574.
005870     05  WK-806-6575-IDX   PIC S9(08) USAGE COMP    VALUE  6575.
005880     05  WK-806-6576-IDX   PIC S9(08) USAGE COMP    VALUE  6576.
005890     05  WK-806-6577-IDX   PIC S9(08) USAGE COMP    VALUE  6577.
005900     05  WK-806-6578-IDX   PIC S9(08) USAGE COMP    VALUE  6578.
005910     05  WK-806-6579-IDX   PIC S9(08) USAGE COMP    VALUE  6579.
005920     05  WK-806-6580-IDX   PIC S9(08) USAGE COMP    VALUE  6580.
005930     05  WK-806-6581-IDX   PIC S9(08) USAGE COMP    VALUE  6581.
005940     05  WK-806-6582-IDX   PIC S9(08) USAGE COMP    VALUE  6582.
005950     05  WK-806-6583-IDX   PIC S9(08) USAGE COMP    VALUE  6583.
005960     05  WK-806-6584-IDX   PIC S9(08) USAGE COMP    VALUE  6584.
005970     05  WK-806-6585-IDX   PIC S9(08) USAGE COMP    VALUE  6585.
005980     05  WK-806-6586-IDX   PIC S9(08) USAGE COMP    VALUE  6586.
005990     05  WK-806-6587-IDX   PIC S9(08) USAGE COMP    VALUE  6587.
006000     05  WK-806-6588-IDX   PIC S9(08) USAGE COMP    VALUE  6588.
006010     05  WK-806-6589-IDX   PIC S9(08) USAGE COMP    VALUE  6589.
006020     05  WK-806-6590-IDX   PIC S9(08) USAGE COMP    VALUE  6590.
006030     05  WK-806-6591-IDX   PIC S9(08) USAGE COMP    VALUE  6591.
006040     05  WK-806-6592-IDX   PIC S9(08) USAGE COMP    VALUE  6592.
006050     05  WK-806-6593-IDX   PIC S9(08) USAGE COMP    VALUE  6593.
006060     05  WK-806-6594-IDX   PIC S9(08) USAGE COMP    VALUE  6594.
006070     05  WK-806-6595-IDX   PIC S9(08) USAGE COMP    VALUE  6595.
006080     05  WK-806-6596-IDX   PIC S9(08) USAGE COMP    VALUE  6596.
006090     05  WK-806-6597-IDX   PIC S9(08) USAGE COMP    VALUE  6597.
006100     05  WK-806-6598-IDX   PIC S9(08) USAGE COMP    VALUE  6598.
006110     05  WK-806-6599-IDX   PIC S9(08) USAGE COMP    VALUE  6599.
006120     05  WK-806-6600-IDX   PIC S9(08) USAGE COMP    VALUE  6600.
006130     05  WK-806-6601-IDX   PIC S9(08) USAGE COMP    VALUE  6601.
006140     05  WK-806-6602-IDX   PIC S9(08) USAGE COMP    VALUE  6602.
006150     05  WK-806-6603-IDX   PIC S9(08) USAGE COMP    VALUE  6603.
006160     05  WK-806-6604-IDX   PIC S9(08) USAGE COMP    VALUE  6604.
006170     05  WK-806-6605-IDX   PIC S9(08) USAGE COMP    VALUE  6605.
006180     05  WK-806-6606-IDX   PIC S9(08) USAGE COMP    VALUE  6606.
006190     05  WK-806-6607-IDX   PIC S9(08) USAGE COMP    VALUE  6607.
006200     05  WK-806-6608-IDX   PIC S9(08) USAGE COMP    VALUE  6608.
006210     05  WK-806-6609-IDX   PIC S9(08) USAGE COMP    VALUE  6609.
006220     05  WK-806-6610-IDX   PIC S9(08) USAGE COMP    VALUE  6610.
006230     05  WK-806-6611-IDX   PIC S9(08) USAGE COMP    VALUE  6611.
006240     05  WK-806-6612-IDX   PIC S9(08) USAGE COMP    VALUE  6612.
006250     05  WK-806-6613-IDX   PIC S9(08) USAGE COMP    VALUE  6613.
006260     05  WK-806-6614-IDX   PIC S9(08) USAGE COMP    VALUE  6614.
006270     05  WK-806-6615-IDX   PIC S9(08) USAGE COMP    VALUE  6615.
006280     05  WK-806-6616-IDX   PIC S9(08) USAGE COMP    VALUE  6616.
006290     05  WK-806-6617-IDX   PIC S9(08) USAGE COMP    VALUE  6617.
006300     05  WK-806-6618-IDX   PIC S9(08) USAGE COMP    VALUE  6618.
006310     05  WK-806-6619-IDX   PIC S9(08) USAGE COMP    VALUE  6619.
006320     05  WK-806-6620-IDX   PIC S9(08) USAGE COMP    VALUE  6620.
006330     05  WK-806-6621-IDX   PIC S9(08) USAGE COMP    VALUE  6621.
006340     05  WK-806-6622-IDX   PIC S9(08) USAGE COMP    VALUE  6622.
006350     05  WK-806-6623-IDX   PIC S9(08) USAGE COMP    VALUE  6623.
006360     05  WK-806-6624-IDX   PIC S9(08) USAGE COMP    VALUE  6624.
006370     05  WK-806-6625-IDX   PIC S9(08) USAGE COMP    VALUE  6625.
006380     05  WK-806-6626-IDX   PIC S9(08) USAGE COMP    VALUE  6626.
006390     05  WK-806-6627-IDX   PIC S9(08) USAGE COMP    VALUE  6627.
006400     05  WK-806-6628-IDX   PIC S9(08) USAGE COMP    VALUE  6628.
006410     05  WK-806-6629-IDX   PIC S9(08) USAGE COMP    VALUE  6629.
006420     05  WK-806-6630-IDX   PIC S9(08) USAGE COMP    VALUE  6630.
006430     05  WK-806-6631-IDX   PIC S9(08) USAGE COMP    VALUE  6631.
006440     05  WK-806-6632-IDX   PIC S9(08) USAGE COMP    VALUE  6632.
006450     05  WK-806-6633-IDX   PIC S9(08) USAGE COMP    VALUE  6633.
006460     05  WK-806-6634-IDX   PIC S9(08) USAGE COMP    VALUE  6634.
006470     05  WK-806-6635-IDX   PIC S9(08) USAGE COMP    VALUE  6635.
006480     05  WK-806-6636-IDX   PIC S9(08) USAGE COMP    VALUE  6636.
006490     05  WK-806-6637-IDX   PIC S9(08) USAGE COMP    VALUE  6637.
006500     05  WK-806-6638-IDX   PIC S9(08) USAGE COMP    VALUE  6638.
006510     05  WK-806-6639-IDX   PIC S9(08) USAGE COMP    VALUE  6639.
006520     05  WK-806-6640-IDX   PIC S9(08) USAGE COMP    VALUE  6640.
006530     05  WK-806-6641-IDX   PIC S9(08) USAGE COMP    VALUE  6641.
006540     05  WK-806-6642-IDX   PIC S9(08) USAGE COMP    VALUE  6642.
006550     05  WK-806-6643-IDX   PIC S9(08) USAGE COMP    VALUE  6643.
006560     05  WK-806-6644-IDX   PIC S9(08) USAGE COMP    VALUE  6644.
006570     05  WK-806-6645-IDX   PIC S9(08) USAGE COMP    VALUE  6645.
006580     05  WK-806-6646-IDX   PIC S9(08) USAGE COMP    VALUE  6646.
006590     05  WK-806-6647-IDX   PIC S9(08) USAGE COMP    VALUE  6647.
006600     05  WK-806-6648-IDX   PIC S9(08) USAGE COMP    VALUE  6648.
006610     05  WK-806-6649-IDX   PIC S9(08) USAGE COMP    VALUE  6649.
006620     05  WK-806-6650-IDX   PIC S9(08) USAGE COMP    VALUE  6650.
006630     05  WK-806-6651-IDX   PIC S9(08) USAGE COMP    VALUE  6651.
006640     05  WK-806-6652-IDX   PIC S9(08) USAGE COMP    VALUE  6652.
006650     05  WK-806-6653-IDX   PIC S9(08) USAGE COMP    VALUE  6653.
006660     05  WK-806-6654-IDX   PIC S9(08) USAGE COMP    VALUE  6654.
006670     05  WK-806-6655-IDX   PIC S9(08) USAGE COMP    VALUE  6655.
006680     05  WK-806-6656-IDX   PIC S9(08) USAGE COMP    VALUE  6656.
006690     05  WK-806-6657-IDX   PIC S9(08) USAGE COMP    VALUE  6657.
006700     05  WK-806-6658-IDX   PIC S9(08) USAGE COMP    VALUE  6658.
006710     05  WK-806-6659-IDX   PIC S9(08) USAGE COMP    VALUE  6659.
006720     05  WK-806-6660-IDX   PIC S9(08) USAGE COMP    VALUE  6660.
006730     05  WK-806-6661-IDX   PIC S9(08) USAGE COMP    VALUE  6661.
006740     05  WK-806-6662-IDX   PIC S9(08) USAGE COMP    VALUE  6662.
006750     05  WK-806-6663-IDX   PIC S9(08) USAGE COMP    VALUE  6663.
006760     05  WK-806-6664-IDX   PIC S9(08) USAGE COMP    VALUE  6664.
006770     05  WK-806-6665-IDX   PIC S9(08) USAGE COMP    VALUE  6665.
006780     05  WK-806-6666-IDX   PIC S9(08) USAGE COMP    VALUE  6666.
006790     05  WK-806-6667-IDX   PIC S9(08) USAGE COMP    VALUE  6667.
006800     05  WK-806-6668-IDX   PIC S9(08) USAGE COMP    VALUE  6668.
006810     05  WK-806-6669-IDX   PIC S9(08) USAGE COMP    VALUE  6669.
006820     05  WK-806-6670-IDX   PIC S9(08) USAGE COMP    VALUE  6670.
006830     05  WK-806-6671-IDX   PIC S9(08) USAGE COMP    VALUE  6671.
006840     05  WK-806-6672-IDX   PIC S9(08) USAGE COMP    VALUE  6672.
006850     05  WK-806-6673-IDX   PIC S9(08) USAGE COMP    VALUE  6673.
006860     05  WK-806-6674-IDX   PIC S9(08) USAGE COMP    VALUE  6674.
006870     05  WK-806-6675-IDX   PIC S9(08) USAGE COMP    VALUE  6675.
006880     05  WK-806-6676-IDX   PIC S9(08) USAGE COMP    VALUE  6676.
006890     05  WK-806-6677-IDX   PIC S9(08) USAGE COMP    VALUE  6677.
006900     05  WK-806-6678-IDX   PIC S9(08) USAGE COMP    VALUE  6678.
006910     05  WK-806-6679-IDX   PIC S9(08) USAGE COMP    VALUE  6679.
006920     05  WK-806-6680-IDX   PIC S9(08) USAGE COMP    VALUE  6680.
006930     05  WK-806-6681-IDX   PIC S9(08) USAGE COMP    VALUE  6681.
006940     05  WK-806-6682-IDX   PIC S9(08) USAGE COMP    VALUE  6682.
006950     05  WK-806-6683-IDX   PIC S9(08) USAGE COMP    VALUE  6683.
006960     05  WK-806-6684-IDX   PIC S9(08) USAGE COMP    VALUE  6684.
006970     05  WK-806-6685-IDX   PIC S9(08) USAGE COMP    VALUE  6685.
006980     05  WK-806-6686-IDX   PIC S9(08) USAGE COMP    VALUE  6686.
006990     05  WK-806-6687-IDX   PIC S9(08) USAGE COMP    VALUE  6687.
007000     05  WK-806-6688-IDX   PIC S9(08) USAGE COMP    VALUE  6688.
007010     05  WK-806-6689-IDX   PIC S9(08) USAGE COMP    VALUE  6689.
007020     05  WK-806-6690-IDX   PIC S9(08) USAGE COMP    VALUE  6690.
007030     05  WK-806-6691-IDX   PIC S9(08) USAGE COMP    VALUE  6691.
007040     05  WK-806-6692-IDX   PIC S9(08) USAGE COMP    VALUE  6692.
007050     05  WK-806-6693-IDX   PIC S9(08) USAGE COMP    VALUE  6693.
007060     05  WK-806-6694-IDX   PIC S9(08) USAGE COMP    VALUE  6694.
007070     05  WK-806-6695-IDX   PIC S9(08) USAGE COMP    VALUE  6695.
007080     05  WK-806-6696-IDX   PIC S9(08) USAGE COMP    VALUE  6696.
007090     05  WK-806-6697-IDX   PIC S9(08) USAGE COMP    VALUE  6697.
007100     05  WK-806-6698-IDX   PIC S9(08) USAGE COMP    VALUE  6698.
007110     05  WK-806-6699-IDX   PIC S9(08) USAGE COMP    VALUE  6699.
007120     05  WK-806-6700-IDX   PIC S9(08) USAGE COMP    VALUE  6700.
007130     05  WK-806-6701-IDX   PIC S9(08) USAGE COMP    VALUE  6701.
007140     05  WK-806-6702-IDX   PIC S9(08) USAGE COMP    VALUE  6702.
007150     05  WK-806-6703-IDX   PIC S9(08) USAGE COMP    VALUE  6703.
007160     05  WK-806-6704-IDX   PIC S9(08) USAGE COMP    VALUE  6704.
007170     05  WK-806-6705-IDX   PIC S9(08) USAGE COMP    VALUE  6705.
007180     05  WK-806-6706-IDX   PIC S9(08) USAGE COMP    VALUE  6706.
007190     05  WK-806-6707-IDX   PIC S9(08) USAGE COMP    VALUE  6707.
007200     05  WK-806-6708-IDX   PIC S9(08) USAGE COMP    VALUE  6708.
007210     05  WK-806-6709-IDX   PIC S9(08) USAGE COMP    VALUE  6709.
007220     05  WK-806-6710-IDX   PIC S9(08) USAGE COMP    VALUE  6710.
007230     05  WK-806-6711-IDX   PIC S9(08) USAGE COMP    VALUE  6711.
007240     05  WK-806-6712-IDX   PIC S9(08) USAGE COMP    VALUE  6712.
007250     05  WK-806-6713-IDX   PIC S9(08) USAGE COMP    VALUE  6713.
007260     05  WK-806-6714-IDX   PIC S9(08) USAGE COMP    VALUE  6714.
007270     05  WK-806-6715-IDX   PIC S9(08) USAGE COMP    VALUE  6715.
007280     05  WK-806-6716-IDX   PIC S9(08) USAGE COMP    VALUE  6716.
007290     05  WK-806-6717-IDX   PIC S9(08) USAGE COMP    VALUE  6717.
007300     05  WK-806-6718-IDX   PIC S9(08) USAGE COMP    VALUE  6718.
007310     05  WK-806-6719-IDX   PIC S9(08) USAGE COMP    VALUE  6719.
007320     05  WK-806-6720-IDX   PIC S9(08) USAGE COMP    VALUE  6720.
007330     05  WK-806-6721-IDX   PIC S9(08) USAGE COMP    VALUE  6721.
007340     05  WK-806-6722-IDX   PIC S9(08) USAGE COMP    VALUE  6722.
007350     05  WK-806-6723-IDX   PIC S9(08) USAGE COMP    VALUE  6723.
007360     05  WK-806-6724-IDX   PIC S9(08) USAGE COMP    VALUE  6724.
007370     05  WK-806-6725-IDX   PIC S9(08) USAGE COMP    VALUE  6725.
007380     05  WK-806-6726-IDX   PIC S9(08) USAGE COMP    VALUE  6726.
007390     05  WK-806-6727-IDX   PIC S9(08) USAGE COMP    VALUE  6727.
007400     05  WK-806-6728-IDX   PIC S9(08) USAGE COMP    VALUE  6728.
007410     05  WK-806-6729-IDX   PIC S9(08) USAGE COMP    VALUE  6729.
007420     05  WK-806-6730-IDX   PIC S9(08) USAGE COMP    VALUE  6730.
007430     05  WK-806-6731-IDX   PIC S9(08) USAGE COMP    VALUE  6731.
007440     05  WK-806-6732-IDX   PIC S9(08) USAGE COMP    VALUE  6732.
007450     05  WK-806-6733-IDX   PIC S9(08) USAGE COMP    VALUE  6733.
007460     05  WK-806-6734-IDX   PIC S9(08) USAGE COMP    VALUE  6734.
007470     05  WK-806-6735-IDX   PIC S9(08) USAGE COMP    VALUE  6735.
007480     05  WK-806-6736-IDX   PIC S9(08) USAGE COMP    VALUE  6736.
007490     05  WK-806-6737-IDX   PIC S9(08) USAGE COMP    VALUE  6737.
007500     05  WK-806-6738-IDX   PIC S9(08) USAGE COMP    VALUE  6738.
007510     05  WK-806-6739-IDX   PIC S9(08) USAGE COMP    VALUE  6739.
007520     05  WK-806-6740-IDX   PIC S9(08) USAGE COMP    VALUE  6740.
007530     05  WK-806-6741-IDX   PIC S9(08) USAGE COMP    VALUE  6741.
007540     05  WK-806-6742-IDX   PIC S9(08) USAGE COMP    VALUE  6742.
007550     05  WK-806-6743-IDX   PIC S9(08) USAGE COMP    VALUE  6743.
007560     05  WK-806-6744-IDX   PIC S9(08) USAGE COMP    VALUE  6744.
007570     05  WK-806-6745-IDX   PIC S9(08) USAGE COMP    VALUE  6745.
007580     05  WK-806-6746-IDX   PIC S9(08) USAGE COMP    VALUE  6746.
007590     05  WK-806-6747-IDX   PIC S9(08) USAGE COMP    VALUE  6747.
007600     05  WK-806-6748-IDX   PIC S9(08) USAGE COMP    VALUE  6748.
007610     05  WK-806-6749-IDX   PIC S9(08) USAGE COMP    VALUE  6749.
007620     05  WK-806-6750-IDX   PIC S9(08) USAGE COMP    VALUE  6750.
007630     05  WK-806-6751-IDX   PIC S9(08) USAGE COMP    VALUE  6751.
007640     05  WK-806-6752-IDX   PIC S9(08) USAGE COMP    VALUE  6752.
007650     05  WK-806-6753-IDX   PIC S9(08) USAGE COMP    VALUE  6753.
007660     05  WK-806-6754-IDX   PIC S9(08) USAGE COMP    VALUE  6754.
007670     05  WK-806-6755-IDX   PIC S9(08) USAGE COMP    VALUE  6755.
007680     05  WK-806-6756-IDX   PIC S9(08) USAGE COMP    VALUE  6756.
007690     05  WK-806-6757-IDX   PIC S9(08) USAGE COMP    VALUE  6757.
007700     05  WK-806-6758-IDX   PIC S9(08) USAGE COMP    VALUE  6758.
007710     05  WK-806-6759-IDX   PIC S9(08) USAGE COMP    VALUE  6759.
007720     05  WK-806-6760-IDX   PIC S9(08) USAGE COMP    VALUE  6760.
007730     05  WK-806-6761-IDX   PIC S9(08) USAGE COMP    VALUE  6761.
007740     05  WK-806-6762-IDX   PIC S9(08) USAGE COMP    VALUE  6762.
007750     05  WK-806-6763-IDX   PIC S9(08) USAGE COMP    VALUE  6763.
007760     05  WK-806-6764-IDX   PIC S9(08) USAGE COMP    VALUE  6764.
007770     05  WK-806-6765-IDX   PIC S9(08) USAGE COMP    VALUE  6765.
007780     05  WK-806-6766-IDX   PIC S9(08) USAGE COMP    VALUE  6766.
007790     05  WK-806-6767-IDX   PIC S9(08) USAGE COMP    VALUE  6767.
007800     05  WK-806-6768-IDX   PIC S9(08) USAGE COMP    VALUE  6768.
007810     05  WK-806-6769-IDX   PIC S9(08) USAGE COMP    VALUE  6769.
007820     05  WK-806-6770-IDX   PIC S9(08) USAGE COMP    VALUE  6770.
007830     05  WK-806-6771-IDX   PIC S9(08) USAGE COMP    VALUE  6771.
007840     05  WK-806-6772-IDX   PIC S9(08) USAGE COMP    VALUE  6772.
007850     05  WK-806-6773-IDX   PIC S9(08) USAGE COMP    VALUE  6773.
007860     05  WK-806-6774-IDX   PIC S9(08) USAGE COMP    VALUE  6774.
007870     05  WK-806-6775-IDX   PIC S9(08) USAGE COMP    VALUE  6775.
007880     05  WK-806-6776-IDX   PIC S9(08) USAGE COMP    VALUE  6776.
007890     05  WK-806-6777-IDX   PIC S9(08) USAGE COMP    VALUE  6777.
007900     05  WK-806-6778-IDX   PIC S9(08) USAGE COMP    VALUE  6778.
007910     05  WK-806-6779-IDX   PIC S9(08) USAGE COMP    VALUE  6779.
007920     05  WK-806-6780-IDX   PIC S9(08) USAGE COMP    VALUE  6780.
007930     05  WK-806-6781-IDX   PIC S9(08) USAGE COMP    VALUE  6781.
007940     05  WK-806-6782-IDX   PIC S9(08) USAGE COMP    VALUE  6782.
007950     05  WK-806-6783-IDX   PIC S9(08) USAGE COMP    VALUE  6783.
007960     05  WK-806-6784-IDX   PIC S9(08) USAGE COMP    VALUE  6784.
007970     05  WK-806-6785-IDX   PIC S9(08) USAGE COMP    VALUE  6785.
007980     05  WK-806-6786-IDX   PIC S9(08) USAGE COMP    VALUE  6786.
007990     05  WK-806-6787-IDX   PIC S9(08) USAGE COMP    VALUE  6787.
008000     05  WK-806-6788-IDX   PIC S9(08) USAGE COMP    VALUE  6788.
008010     05  WK-806-6789-IDX   PIC S9(08) USAGE COMP    VALUE  6789.
008020     05  WK-806-6790-IDX   PIC S9(08) USAGE COMP    VALUE  6790.
008030     05  WK-806-6791-IDX   PIC S9(08) USAGE COMP    VALUE  6791.
008040     05  WK-806-6792-IDX   PIC S9(08) USAGE COMP    VALUE  6792.
008050     05  WK-806-6793-IDX   PIC S9(08) USAGE COMP    VALUE  6793.
008060     05  WK-806-6794-IDX   PIC S9(08) USAGE COMP    VALUE  6794.
008070     05  WK-806-6795-IDX   PIC S9(08) USAGE COMP    VALUE  6795.
008080     05  WK-806-6796-IDX   PIC S9(08) USAGE COMP    VALUE  6796.
008090     05  WK-806-6797-IDX   PIC S9(08) USAGE COMP    VALUE  6797.
008100     05  WK-806-6798-IDX   PIC S9(08) USAGE COMP    VALUE  6798.
008110     05  WK-806-6799-IDX   PIC S9(08) USAGE COMP    VALUE  6799.
008120     05  WK-806-6800-IDX   PIC S9(08) USAGE COMP    VALUE  6800.
008130     05  WK-806-6801-IDX   PIC S9(08) USAGE COMP    VALUE  6801.
008140     05  WK-806-6802-IDX   PIC S9(08) USAGE COMP    VALUE  6802.
008150     05  WK-806-6803-IDX   PIC S9(08) USAGE COMP    VALUE  6803.
008160     05  WK-806-6804-IDX   PIC S9(08) USAGE COMP    VALUE  6804.
008170     05  WK-806-6805-IDX   PIC S9(08) USAGE COMP    VALUE  6805.
008180     05  WK-806-6806-IDX   PIC S9(08) USAGE COMP    VALUE  6806.
008190     05  WK-806-6807-IDX   PIC S9(08) USAGE COMP    VALUE  6807.
008200     05  WK-806-6808-IDX   PIC S9(08) USAGE COMP    VALUE  6808.
008210     05  WK-806-6809-IDX   PIC S9(08) USAGE COMP    VALUE  6809.
008220     05  WK-806-6810-IDX   PIC S9(08) USAGE COMP    VALUE  6810.
008230     05  WK-806-6811-IDX   PIC S9(08) USAGE COMP    VALUE  6811.
008240     05  WK-806-6812-IDX   PIC S9(08) USAGE COMP    VALUE  6812.
008250     05  WK-806-6813-IDX   PIC S9(08) USAGE COMP    VALUE  6813.
008260     05  WK-806-6814-IDX   PIC S9(08) USAGE COMP    VALUE  6814.
008270     05  WK-806-6815-IDX   PIC S9(08) USAGE COMP    VALUE  6815.
008280     05  WK-806-6816-IDX   PIC S9(08) USAGE COMP    VALUE  6816.
008290     05  WK-806-6817-IDX   PIC S9(08) USAGE COMP    VALUE  6817.
008300     05  WK-806-6818-IDX   PIC S9(08) USAGE COMP    VALUE  6818.
008310     05  WK-806-6819-IDX   PIC S9(08) USAGE COMP    VALUE  6819.
008320     05  WK-806-6820-IDX   PIC S9(08) USAGE COMP    VALUE  6820.
008330     05  WK-806-6821-IDX   PIC S9(08) USAGE COMP    VALUE  6821.
008340     05  WK-806-6822-IDX   PIC S9(08) USAGE COMP    VALUE  6822.
008350     05  WK-806-6823-IDX   PIC S9(08) USAGE COMP    VALUE  6823.
008360     05  WK-806-6824-IDX   PIC S9(08) USAGE COMP    VALUE  6824.
008370     05  WK-806-6825-IDX   PIC S9(08) USAGE COMP    VALUE  6825.
008380     05  WK-806-6826-IDX   PIC S9(08) USAGE COMP    VALUE  6826.
008390     05  WK-806-6827-IDX   PIC S9(08) USAGE COMP    VALUE  6827.
008400     05  WK-806-6828-IDX   PIC S9(08) USAGE COMP    VALUE  6828.
008410     05  WK-806-6829-IDX   PIC S9(08) USAGE COMP    VALUE  6829.
008420     05  WK-806-6830-IDX   PIC S9(08) USAGE COMP    VALUE  6830.
008430     05  WK-806-6831-IDX   PIC S9(08) USAGE COMP    VALUE  6831.
008440     05  WK-806-6832-IDX   PIC S9(08) USAGE COMP    VALUE  6832.
008450     05  WK-806-6833-IDX   PIC S9(08) USAGE COMP    VALUE  6833.
008460     05  WK-806-6834-IDX   PIC S9(08) USAGE COMP    VALUE  6834.
008470     05  WK-806-6835-IDX   PIC S9(08) USAGE COMP    VALUE  6835.
008480     05  WK-806-6836-IDX   PIC S9(08) USAGE COMP    VALUE  6836.
008490     05  WK-806-6837-IDX   PIC S9(08) USAGE COMP    VALUE  6837.
008500     05  WK-806-6838-IDX   PIC S9(08) USAGE COMP    VALUE  6838.
008510     05  WK-806-6839-IDX   PIC S9(08) USAGE COMP    VALUE  6839.
008520     05  WK-806-6840-IDX   PIC S9(08) USAGE COMP    VALUE  6840.
008530     05  WK-806-6841-IDX   PIC S9(08) USAGE COMP    VALUE  6841.
008540     05  WK-806-6842-IDX   PIC S9(08) USAGE COMP    VALUE  6842.
008550     05  WK-806-6843-IDX   PIC S9(08) USAGE COMP    VALUE  6843.
008560     05  WK-806-6844-IDX   PIC S9(08) USAGE COMP    VALUE  6844.
008570     05  WK-806-6845-IDX   PIC S9(08) USAGE COMP    VALUE  6845.
008580     05  WK-806-6846-IDX   PIC S9(08) USAGE COMP    VALUE  6846.
008590     05  WK-806-6847-IDX   PIC S9(08) USAGE COMP    VALUE  6847.
008600     05  WK-806-6848-IDX   PIC S9(08) USAGE COMP    VALUE  6848.
008610     05  WK-806-6849-IDX   PIC S9(08) USAGE COMP    VALUE  6849.
008620     05  WK-806-6850-IDX   PIC S9(08) USAGE COMP    VALUE  6850.
008630     05  WK-806-6851-IDX   PIC S9(08) USAGE COMP    VALUE  6851.
008640     05  WK-806-6852-IDX   PIC S9(08) USAGE COMP    VALUE  6852.
008650     05  WK-806-6853-IDX   PIC S9(08) USAGE COMP    VALUE  6853.
008660     05  WK-806-6854-IDX   PIC S9(08) USAGE COMP    VALUE  6854.
008670     05  WK-806-6855-IDX   PIC S9(08) USAGE COMP    VALUE  6855.
008680     05  WK-806-6856-IDX   PIC S9(08) USAGE COMP    VALUE  6856.
008690     05  WK-806-6857-IDX   PIC S9(08) USAGE COMP    VALUE  6857.
008700     05  WK-806-6858-IDX   PIC S9(08) USAGE COMP    VALUE  6858.
008710     05  WK-806-6859-IDX   PIC S9(08) USAGE COMP    VALUE  6859.
008720     05  WK-806-6860-IDX   PIC S9(08) USAGE COMP    VALUE  6860.
008730     05  WK-806-6861-IDX   PIC S9(08) USAGE COMP    VALUE  6861.
008740     05  WK-806-6862-IDX   PIC S9(08) USAGE COMP    VALUE  6862.
008750     05  WK-806-6863-IDX   PIC S9(08) USAGE COMP    VALUE  6863.
008760     05  WK-806-6864-IDX   PIC S9(08) USAGE COMP    VALUE  6864.
008770     05  WK-806-6865-IDX   PIC S9(08) USAGE COMP    VALUE  6865.
008780     05  WK-806-6866-IDX   PIC S9(08) USAGE COMP    VALUE  6866.
008790     05  WK-806-6867-IDX   PIC S9(08) USAGE COMP    VALUE  6867.
008800     05  WK-806-6868-IDX   PIC S9(08) USAGE COMP    VALUE  6868.
008810     05  WK-806-6869-IDX   PIC S9(08) USAGE COMP    VALUE  6869.
008820     05  WK-806-6870-IDX   PIC S9(08) USAGE COMP    VALUE  6870.
008830     05  WK-806-6871-IDX   PIC S9(08) USAGE COMP    VALUE  6871.
008840     05  WK-806-6872-IDX   PIC S9(08) USAGE COMP    VALUE  6872.
008850     05  WK-806-6873-IDX   PIC S9(08) USAGE COMP    VALUE  6873.
008860     05  WK-806-6874-IDX   PIC S9(08) USAGE COMP    VALUE  6874.
008870     05  WK-806-6875-IDX   PIC S9(08) USAGE COMP    VALUE  6875.
008880     05  WK-806-6876-IDX   PIC S9(08) USAGE COMP    VALUE  6876.
008890     05  WK-806-6877-IDX   PIC S9(08) USAGE COMP    VALUE  6877.
008900     05  WK-806-6878-IDX   PIC S9(08) USAGE COMP    VALUE  6878.
008910     05  WK-806-6879-IDX   PIC S9(08) USAGE COMP    VALUE  6879.
008920     05  WK-806-6880-IDX   PIC S9(08) USAGE COMP    VALUE  6880.
008930     05  WK-806-6881-IDX   PIC S9(08) USAGE COMP    VALUE  6881.
008940     05  WK-806-6882-IDX   PIC S9(08) USAGE COMP    VALUE  6882.
008950     05  WK-806-6883-IDX   PIC S9(08) USAGE COMP    VALUE  6883.
008960     05  WK-806-6884-IDX   PIC S9(08) USAGE COMP    VALUE  6884.
008970     05  WK-806-6885-IDX   PIC S9(08) USAGE COMP    VALUE  6885.
008980     05  WK-806-6886-IDX   PIC S9(08) USAGE COMP    VALUE  6886.
008990     05  WK-806-6887-IDX   PIC S9(08) USAGE COMP    VALUE  6887.
009000     05  WK-806-6888-IDX   PIC S9(08) USAGE COMP    VALUE  6888.
009010     05  WK-806-6889-IDX   PIC S9(08) USAGE COMP    VALUE  6889.
009020     05  WK-806-6890-IDX   PIC S9(08) USAGE COMP    VALUE  6890.
009030     05  WK-806-6891-IDX   PIC S9(08) USAGE COMP    VALUE  6891.
009040     05  WK-806-6892-IDX   PIC S9(08) USAGE COMP    VALUE  6892.
009050     05  WK-806-6893-IDX   PIC S9(08) USAGE COMP    VALUE  6893.
009060     05  WK-806-6894-IDX   PIC S9(08) USAGE COMP    VALUE  6894.
009070     05  WK-806-6895-IDX   PIC S9(08) USAGE COMP    VALUE  6895.
009080     05  WK-806-6896-IDX   PIC S9(08) USAGE COMP    VALUE  6896.
009090     05  WK-806-6897-IDX   PIC S9(08) USAGE COMP    VALUE  6897.
009100     05  WK-806-6898-IDX   PIC S9(08) USAGE COMP    VALUE  6898.
009110     05  WK-806-6899-IDX   PIC S9(08) USAGE COMP    VALUE  6899.
009120     05  WK-806-6900-IDX   PIC S9(08) USAGE COMP    VALUE  6900.
009130     05  WK-806-6901-IDX   PIC S9(08) USAGE COMP    VALUE  6901.
009140     05  WK-806-6902-IDX   PIC S9(08) USAGE COMP    VALUE  6902.
009150     05  WK-806-6903-IDX   PIC S9(08) USAGE COMP    VALUE  6903.
009160     05  WK-806-6904-IDX   PIC S9(08) USAGE COMP    VALUE  6904.
009170     05  WK-806-6905-IDX   PIC S9(08) USAGE COMP    VALUE  6905.
009180     05  WK-806-6906-IDX   PIC S9(08) USAGE COMP    VALUE  6906.
009190     05  WK-806-6907-IDX   PIC S9(08) USAGE COMP    VALUE  6907.
009200     05  WK-806-6908-IDX   PIC S9(08) USAGE COMP    VALUE  6908.
009210     05  WK-806-6909-IDX   PIC S9(08) USAGE COMP    VALUE  6909.
009220     05  WK-806-6910-IDX   PIC S9(08) USAGE COMP    VALUE  6910.
009230     05  WK-806-6911-IDX   PIC S9(08) USAGE COMP    VALUE  6911.
009240     05  WK-806-6912-IDX   PIC S9(08) USAGE COMP    VALUE  6912.
009250     05  WK-806-6913-IDX   PIC S9(08) USAGE COMP    VALUE  6913.
009260     05  WK-806-6914-IDX   PIC S9(08) USAGE COMP    VALUE  6914.
009270     05  WK-806-6915-IDX   PIC S9(08) USAGE COMP    VALUE  6915.
009280     05  WK-806-6916-IDX   PIC S9(08) USAGE COMP    VALUE  6916.
009290     05  WK-806-6917-IDX   PIC S9(08) USAGE COMP    VALUE  6917.
009300     05  WK-806-6918-IDX   PIC S9(08) USAGE COMP    VALUE  6918.
009310     05  WK-806-6919-IDX   PIC S9(08) USAGE COMP    VALUE  6919.
009320     05  WK-806-6920-IDX   PIC S9(08) USAGE COMP    VALUE  6920.
009330     05  WK-806-6921-IDX   PIC S9(08) USAGE COMP    VALUE  6921.
009340     05  WK-806-6922-IDX   PIC S9(08) USAGE COMP    VALUE  6922.
009350     05  WK-806-6923-IDX   PIC S9(08) USAGE COMP    VALUE  6923.
009360     05  WK-806-6924-IDX   PIC S9(08) USAGE COMP    VALUE  6924.
009370     05  WK-806-6925-IDX   PIC S9(08) USAGE COMP    VALUE  6925.
009380     05  WK-806-6926-IDX   PIC S9(08) USAGE COMP    VALUE  6926.
009390     05  WK-806-6927-IDX   PIC S9(08) USAGE COMP    VALUE  6927.
009400     05  WK-806-6928-IDX   PIC S9(08) USAGE COMP    VALUE  6928.
009410     05  WK-806-6929-IDX   PIC S9(08) USAGE COMP    VALUE  6929.
009420     05  WK-806-6930-IDX   PIC S9(08) USAGE COMP    VALUE  6930.
009430     05  WK-806-6931-IDX   PIC S9(08) USAGE COMP    VALUE  6931.
009440     05  WK-806-6932-IDX   PIC S9(08) USAGE COMP    VALUE  6932.
009450     05  WK-806-6933-IDX   PIC S9(08) USAGE COMP    VALUE  6933.
009460     05  WK-806-6934-IDX   PIC S9(08) USAGE COMP    VALUE  6934.
009470     05  WK-806-6935-IDX   PIC S9(08) USAGE COMP    VALUE  6935.
009480     05  WK-806-6936-IDX   PIC S9(08) USAGE COMP    VALUE  6936.
009490     05  WK-806-6937-IDX   PIC S9(08) USAGE COMP    VALUE  6937.
009500     05  WK-806-6938-IDX   PIC S9(08) USAGE COMP    VALUE  6938.
009510     05  WK-806-6939-IDX   PIC S9(08) USAGE COMP    VALUE  6939.
009520     05  WK-806-6940-IDX   PIC S9(08) USAGE COMP    VALUE  6940.
009530     05  WK-806-6941-IDX   PIC S9(08) USAGE COMP    VALUE  6941.
009540     05  WK-806-6942-IDX   PIC S9(08) USAGE COMP    VALUE  6942.
009550     05  WK-806-6943-IDX   PIC S9(08) USAGE COMP    VALUE  6943.
009560     05  WK-806-6944-IDX   PIC S9(08) USAGE COMP    VALUE  6944.
009570     05  WK-806-6945-IDX   PIC S9(08) USAGE COMP    VALUE  6945.
009580     05  WK-806-6946-IDX   PIC S9(08) USAGE COMP    VALUE  6946.
009590     05  WK-806-6947-IDX   PIC S9(08) USAGE COMP    VALUE  6947.
009600     05  WK-806-6948-IDX   PIC S9(08) USAGE COMP    VALUE  6948.
009610     05  WK-806-6949-IDX   PIC S9(08) USAGE COMP    VALUE  6949.
009620     05  WK-806-6950-IDX   PIC S9(08) USAGE COMP    VALUE  6950.
009630     05  WK-806-6951-IDX   PIC S9(08) USAGE COMP    VALUE  6951.
009640     05  WK-806-6952-IDX   PIC S9(08) USAGE COMP    VALUE  6952.
009650     05  WK-806-6953-IDX   PIC S9(08) USAGE COMP    VALUE  6953.
009660     05  WK-806-6954-IDX   PIC S9(08) USAGE COMP    VALUE  6954.
009670     05  WK-806-6955-IDX   PIC S9(08) USAGE COMP    VALUE  6955.
009680     05  WK-806-6956-IDX   PIC S9(08) USAGE COMP    VALUE  6956.
009690     05  WK-806-6957-IDX   PIC S9(08) USAGE COMP    VALUE  6957.
009700     05  WK-806-6958-IDX   PIC S9(08) USAGE COMP    VALUE  6958.
009710     05  WK-806-6959-IDX   PIC S9(08) USAGE COMP    VALUE  6959.
009720     05  WK-806-6960-IDX   PIC S9(08) USAGE COMP    VALUE  6960.
009730     05  WK-806-6961-IDX   PIC S9(08) USAGE COMP    VALUE  6961.
009740     05  WK-806-6962-IDX   PIC S9(08) USAGE COMP    VALUE  6962.
009750     05  WK-806-6963-IDX   PIC S9(08) USAGE COMP    VALUE  6963.
009760     05  WK-806-6964-IDX   PIC S9(08) USAGE COMP    VALUE  6964.
009770     05  WK-806-6965-IDX   PIC S9(08) USAGE COMP    VALUE  6965.
009780     05  WK-806-6966-IDX   PIC S9(08) USAGE COMP    VALUE  6966.
009790     05  WK-806-6967-IDX   PIC S9(08) USAGE COMP    VALUE  6967.
009800     05  WK-806-6968-IDX   PIC S9(08) USAGE COMP    VALUE  6968.
009810     05  WK-806-6969-IDX   PIC S9(08) USAGE COMP    VALUE  6969.
009820     05  WK-806-6970-IDX   PIC S9(08) USAGE COMP    VALUE  6970.
009830     05  WK-806-6971-IDX   PIC S9(08) USAGE COMP    VALUE  6971.
009840     05  WK-806-6972-IDX   PIC S9(08) USAGE COMP    VALUE  6972.
009850     05  WK-806-6973-IDX   PIC S9(08) USAGE COMP    VALUE  6973.
009860     05  WK-806-6974-IDX   PIC S9(08) USAGE COMP    VALUE  6974.
009870     05  WK-806-6975-IDX   PIC S9(08) USAGE COMP    VALUE  6975.
009880     05  WK-806-6976-IDX   PIC S9(08) USAGE COMP    VALUE  6976.
009890     05  WK-806-6977-IDX   PIC S9(08) USAGE COMP    VALUE  6977.
009900     05  WK-806-6978-IDX   PIC S9(08) USAGE COMP    VALUE  6978.
009910     05  WK-806-6979-IDX   PIC S9(08) USAGE COMP    VALUE  6979.
009920     05  WK-806-6980-IDX   PIC S9(08) USAGE COMP    VALUE  6980.
009930     05  WK-806-6981-IDX   PIC S9(08) USAGE COMP    VALUE  6981.
009940     05  WK-806-6982-IDX   PIC S9(08) USAGE COMP    VALUE  6982.
009950     05  WK-806-6983-IDX   PIC S9(08) USAGE COMP    VALUE  6983.
009960     05  WK-806-6984-IDX   PIC S9(08) USAGE COMP    VALUE  6984.
009970     05  WK-806-6985-IDX   PIC S9(08) USAGE COMP    VALUE  6985.
009980     05  WK-806-6986-IDX   PIC S9(08) USAGE COMP    VALUE  6986.
009990     05  WK-806-6987-IDX   PIC S9(08) USAGE COMP    VALUE  6987.
010000     05  WK-806-6988-IDX   PIC S9(08) USAGE COMP    VALUE  6988.
010010     05  WK-806-6989-IDX   PIC S9(08) USAGE COMP    VALUE  6989.
010020     05  WK-806-6990-IDX   PIC S9(08) USAGE COMP    VALUE  6990.
010030     05  WK-806-6991-IDX   PIC S9(08) USAGE COMP    VALUE  6991.
010040     05  WK-806-6992-IDX   PIC S9(08) USAGE COMP    VALUE  6992.
010050     05  WK-806-6993-IDX   PIC S9(08) USAGE COMP    VALUE  6993.
010060     05  WK-806-6994-IDX   PIC S9(08) USAGE COMP    VALUE  6994.
010070     05  WK-806-6995-IDX   PIC S9(08) USAGE COMP    VALUE  6995.
010080     05  WK-806-6996-IDX   PIC S9(08) USAGE COMP    VALUE  6996.
010090     05  WK-806-6997-IDX   PIC S9(08) USAGE COMP    VALUE  6997.
010100     05  WK-806-6998-IDX   PIC S9(08) USAGE COMP    VALUE  6998.
010110     05  WK-806-6999-IDX   PIC S9(08) USAGE COMP    VALUE  6999.
010110     05  WK-806-7000-IDX   PIC S9(08) USAGE COMP    VALUE  7000.
000130     05  WK-806-7001-IDX   PIC S9(08) USAGE COMP    VALUE  7001.
000140     05  WK-806-7002-IDX   PIC S9(08) USAGE COMP    VALUE  7002.
000150     05  WK-806-7003-IDX   PIC S9(08) USAGE COMP    VALUE  7003.
000160     05  WK-806-7004-IDX   PIC S9(08) USAGE COMP    VALUE  7004.
000170     05  WK-806-7005-IDX   PIC S9(08) USAGE COMP    VALUE  7005.
000180     05  WK-806-7006-IDX   PIC S9(08) USAGE COMP    VALUE  7006.
000190     05  WK-806-7007-IDX   PIC S9(08) USAGE COMP    VALUE  7007.
000200     05  WK-806-7008-IDX   PIC S9(08) USAGE COMP    VALUE  7008.
000210     05  WK-806-7009-IDX   PIC S9(08) USAGE COMP    VALUE  7009.
000220     05  WK-806-7010-IDX   PIC S9(08) USAGE COMP    VALUE  7010.
000230     05  WK-806-7011-IDX   PIC S9(08) USAGE COMP    VALUE  7011.
000240     05  WK-806-7012-IDX   PIC S9(08) USAGE COMP    VALUE  7012.
000250     05  WK-806-7013-IDX   PIC S9(08) USAGE COMP    VALUE  7013.
000260     05  WK-806-7014-IDX   PIC S9(08) USAGE COMP    VALUE  7014.
000270     05  WK-806-7015-IDX   PIC S9(08) USAGE COMP    VALUE  7015.
000280     05  WK-806-7016-IDX   PIC S9(08) USAGE COMP    VALUE  7016.
000290     05  WK-806-7017-IDX   PIC S9(08) USAGE COMP    VALUE  7017.
000300     05  WK-806-7018-IDX   PIC S9(08) USAGE COMP    VALUE  7018.
000310     05  WK-806-7019-IDX   PIC S9(08) USAGE COMP    VALUE  7019.
000320     05  WK-806-7020-IDX   PIC S9(08) USAGE COMP    VALUE  7020.
000330     05  WK-806-7021-IDX   PIC S9(08) USAGE COMP    VALUE  7021.
000340     05  WK-806-7022-IDX   PIC S9(08) USAGE COMP    VALUE  7022.
000350     05  WK-806-7023-IDX   PIC S9(08) USAGE COMP    VALUE  7023.
000360     05  WK-806-7024-IDX   PIC S9(08) USAGE COMP    VALUE  7024.
000370     05  WK-806-7025-IDX   PIC S9(08) USAGE COMP    VALUE  7025.
000380     05  WK-806-7026-IDX   PIC S9(08) USAGE COMP    VALUE  7026.
000390     05  WK-806-7027-IDX   PIC S9(08) USAGE COMP    VALUE  7027.
000400     05  WK-806-7028-IDX   PIC S9(08) USAGE COMP    VALUE  7028.
000410     05  WK-806-7029-IDX   PIC S9(08) USAGE COMP    VALUE  7029.
000420     05  WK-806-7030-IDX   PIC S9(08) USAGE COMP    VALUE  7030.
000430     05  WK-806-7031-IDX   PIC S9(08) USAGE COMP    VALUE  7031.
000440     05  WK-806-7032-IDX   PIC S9(08) USAGE COMP    VALUE  7032.
000450     05  WK-806-7033-IDX   PIC S9(08) USAGE COMP    VALUE  7033.
000460     05  WK-806-7034-IDX   PIC S9(08) USAGE COMP    VALUE  7034.
000470     05  WK-806-7035-IDX   PIC S9(08) USAGE COMP    VALUE  7035.
000480     05  WK-806-7036-IDX   PIC S9(08) USAGE COMP    VALUE  7036.
000490     05  WK-806-7037-IDX   PIC S9(08) USAGE COMP    VALUE  7037.
000500     05  WK-806-7038-IDX   PIC S9(08) USAGE COMP    VALUE  7038.
000510     05  WK-806-7039-IDX   PIC S9(08) USAGE COMP    VALUE  7039.
000520     05  WK-806-7040-IDX   PIC S9(08) USAGE COMP    VALUE  7040.
000530     05  WK-806-7041-IDX   PIC S9(08) USAGE COMP    VALUE  7041.
000540     05  WK-806-7042-IDX   PIC S9(08) USAGE COMP    VALUE  7042.
000550     05  WK-806-7043-IDX   PIC S9(08) USAGE COMP    VALUE  7043.
000560     05  WK-806-7044-IDX   PIC S9(08) USAGE COMP    VALUE  7044.
000570     05  WK-806-7045-IDX   PIC S9(08) USAGE COMP    VALUE  7045.
000580     05  WK-806-7046-IDX   PIC S9(08) USAGE COMP    VALUE  7046.
000590     05  WK-806-7047-IDX   PIC S9(08) USAGE COMP    VALUE  7047.
000600     05  WK-806-7048-IDX   PIC S9(08) USAGE COMP    VALUE  7048.
000610     05  WK-806-7049-IDX   PIC S9(08) USAGE COMP    VALUE  7049.
000620     05  WK-806-7050-IDX   PIC S9(08) USAGE COMP    VALUE  7050.
000630     05  WK-806-7051-IDX   PIC S9(08) USAGE COMP    VALUE  7051.
000640     05  WK-806-7052-IDX   PIC S9(08) USAGE COMP    VALUE  7052.
000650     05  WK-806-7053-IDX   PIC S9(08) USAGE COMP    VALUE  7053.
000660     05  WK-806-7054-IDX   PIC S9(08) USAGE COMP    VALUE  7054.
000670     05  WK-806-7055-IDX   PIC S9(08) USAGE COMP    VALUE  7055.
000680     05  WK-806-7056-IDX   PIC S9(08) USAGE COMP    VALUE  7056.
000690     05  WK-806-7057-IDX   PIC S9(08) USAGE COMP    VALUE  7057.
000700     05  WK-806-7058-IDX   PIC S9(08) USAGE COMP    VALUE  7058.
000710     05  WK-806-7059-IDX   PIC S9(08) USAGE COMP    VALUE  7059.
000720     05  WK-806-7060-IDX   PIC S9(08) USAGE COMP    VALUE  7060.
000730     05  WK-806-7061-IDX   PIC S9(08) USAGE COMP    VALUE  7061.
000740     05  WK-806-7062-IDX   PIC S9(08) USAGE COMP    VALUE  7062.
000750     05  WK-806-7063-IDX   PIC S9(08) USAGE COMP    VALUE  7063.
000760     05  WK-806-7064-IDX   PIC S9(08) USAGE COMP    VALUE  7064.
000770     05  WK-806-7065-IDX   PIC S9(08) USAGE COMP    VALUE  7065.
000780     05  WK-806-7066-IDX   PIC S9(08) USAGE COMP    VALUE  7066.
000790     05  WK-806-7067-IDX   PIC S9(08) USAGE COMP    VALUE  7067.
000800     05  WK-806-7068-IDX   PIC S9(08) USAGE COMP    VALUE  7068.
000810     05  WK-806-7069-IDX   PIC S9(08) USAGE COMP    VALUE  7069.
000820     05  WK-806-7070-IDX   PIC S9(08) USAGE COMP    VALUE  7070.
000830     05  WK-806-7071-IDX   PIC S9(08) USAGE COMP    VALUE  7071.
000840     05  WK-806-7072-IDX   PIC S9(08) USAGE COMP    VALUE  7072.
000850     05  WK-806-7073-IDX   PIC S9(08) USAGE COMP    VALUE  7073.
000860     05  WK-806-7074-IDX   PIC S9(08) USAGE COMP    VALUE  7074.
000870     05  WK-806-7075-IDX   PIC S9(08) USAGE COMP    VALUE  7075.
000880     05  WK-806-7076-IDX   PIC S9(08) USAGE COMP    VALUE  7076.
000890     05  WK-806-7077-IDX   PIC S9(08) USAGE COMP    VALUE  7077.
000900     05  WK-806-7078-IDX   PIC S9(08) USAGE COMP    VALUE  7078.
000910     05  WK-806-7079-IDX   PIC S9(08) USAGE COMP    VALUE  7079.
000920     05  WK-806-7080-IDX   PIC S9(08) USAGE COMP    VALUE  7080.
000930     05  WK-806-7081-IDX   PIC S9(08) USAGE COMP    VALUE  7081.
000940     05  WK-806-7082-IDX   PIC S9(08) USAGE COMP    VALUE  7082.
000950     05  WK-806-7083-IDX   PIC S9(08) USAGE COMP    VALUE  7083.
000960     05  WK-806-7084-IDX   PIC S9(08) USAGE COMP    VALUE  7084.
000970     05  WK-806-7085-IDX   PIC S9(08) USAGE COMP    VALUE  7085.
000980     05  WK-806-7086-IDX   PIC S9(08) USAGE COMP    VALUE  7086.
000990     05  WK-806-7087-IDX   PIC S9(08) USAGE COMP    VALUE  7087.
001000     05  WK-806-7088-IDX   PIC S9(08) USAGE COMP    VALUE  7088.
001010     05  WK-806-7089-IDX   PIC S9(08) USAGE COMP    VALUE  7089.
001020     05  WK-806-7090-IDX   PIC S9(08) USAGE COMP    VALUE  7090.
001030     05  WK-806-7091-IDX   PIC S9(08) USAGE COMP    VALUE  7091.
001040     05  WK-806-7092-IDX   PIC S9(08) USAGE COMP    VALUE  7092.
001050     05  WK-806-7093-IDX   PIC S9(08) USAGE COMP    VALUE  7093.
001060     05  WK-806-7094-IDX   PIC S9(08) USAGE COMP    VALUE  7094.
001070     05  WK-806-7095-IDX   PIC S9(08) USAGE COMP    VALUE  7095.
001080     05  WK-806-7096-IDX   PIC S9(08) USAGE COMP    VALUE  7096.
001090     05  WK-806-7097-IDX   PIC S9(08) USAGE COMP    VALUE  7097.
001100     05  WK-806-7098-IDX   PIC S9(08) USAGE COMP    VALUE  7098.
001110     05  WK-806-7099-IDX   PIC S9(08) USAGE COMP    VALUE  7099.
001120     05  WK-806-7100-IDX   PIC S9(08) USAGE COMP    VALUE  7100.
001130     05  WK-806-7101-IDX   PIC S9(08) USAGE COMP    VALUE  7101.
001140     05  WK-806-7102-IDX   PIC S9(08) USAGE COMP    VALUE  7102.
001150     05  WK-806-7103-IDX   PIC S9(08) USAGE COMP    VALUE  7103.
001160     05  WK-806-7104-IDX   PIC S9(08) USAGE COMP    VALUE  7104.
001170     05  WK-806-7105-IDX   PIC S9(08) USAGE COMP    VALUE  7105.
001180     05  WK-806-7106-IDX   PIC S9(08) USAGE COMP    VALUE  7106.
001190     05  WK-806-7107-IDX   PIC S9(08) USAGE COMP    VALUE  7107.
001200     05  WK-806-7108-IDX   PIC S9(08) USAGE COMP    VALUE  7108.
001210     05  WK-806-7109-IDX   PIC S9(08) USAGE COMP    VALUE  7109.
001220     05  WK-806-7110-IDX   PIC S9(08) USAGE COMP    VALUE  7110.
001230     05  WK-806-7111-IDX   PIC S9(08) USAGE COMP    VALUE  7111.
001240     05  WK-806-7112-IDX   PIC S9(08) USAGE COMP    VALUE  7112.
001250     05  WK-806-7113-IDX   PIC S9(08) USAGE COMP    VALUE  7113.
001260     05  WK-806-7114-IDX   PIC S9(08) USAGE COMP    VALUE  7114.
001270     05  WK-806-7115-IDX   PIC S9(08) USAGE COMP    VALUE  7115.
001280     05  WK-806-7116-IDX   PIC S9(08) USAGE COMP    VALUE  7116.
001290     05  WK-806-7117-IDX   PIC S9(08) USAGE COMP    VALUE  7117.
001300     05  WK-806-7118-IDX   PIC S9(08) USAGE COMP    VALUE  7118.
001310     05  WK-806-7119-IDX   PIC S9(08) USAGE COMP    VALUE  7119.
001320     05  WK-806-7120-IDX   PIC S9(08) USAGE COMP    VALUE  7120.
001330     05  WK-806-7121-IDX   PIC S9(08) USAGE COMP    VALUE  7121.
001340     05  WK-806-7122-IDX   PIC S9(08) USAGE COMP    VALUE  7122.
001350     05  WK-806-7123-IDX   PIC S9(08) USAGE COMP    VALUE  7123.
001360     05  WK-806-7124-IDX   PIC S9(08) USAGE COMP    VALUE  7124.
001370     05  WK-806-7125-IDX   PIC S9(08) USAGE COMP    VALUE  7125.
001380     05  WK-806-7126-IDX   PIC S9(08) USAGE COMP    VALUE  7126.
001390     05  WK-806-7127-IDX   PIC S9(08) USAGE COMP    VALUE  7127.
001400     05  WK-806-7128-IDX   PIC S9(08) USAGE COMP    VALUE  7128.
001410     05  WK-806-7129-IDX   PIC S9(08) USAGE COMP    VALUE  7129.
001420     05  WK-806-7130-IDX   PIC S9(08) USAGE COMP    VALUE  7130.
001430     05  WK-806-7131-IDX   PIC S9(08) USAGE COMP    VALUE  7131.
001440     05  WK-806-7132-IDX   PIC S9(08) USAGE COMP    VALUE  7132.
001450     05  WK-806-7133-IDX   PIC S9(08) USAGE COMP    VALUE  7133.
001460     05  WK-806-7134-IDX   PIC S9(08) USAGE COMP    VALUE  7134.
001470     05  WK-806-7135-IDX   PIC S9(08) USAGE COMP    VALUE  7135.
001480     05  WK-806-7136-IDX   PIC S9(08) USAGE COMP    VALUE  7136.
001490     05  WK-806-7137-IDX   PIC S9(08) USAGE COMP    VALUE  7137.
001500     05  WK-806-7138-IDX   PIC S9(08) USAGE COMP    VALUE  7138.
001510     05  WK-806-7139-IDX   PIC S9(08) USAGE COMP    VALUE  7139.
001520     05  WK-806-7140-IDX   PIC S9(08) USAGE COMP    VALUE  7140.
001530     05  WK-806-7141-IDX   PIC S9(08) USAGE COMP    VALUE  7141.
001540     05  WK-806-7142-IDX   PIC S9(08) USAGE COMP    VALUE  7142.
001550     05  WK-806-7143-IDX   PIC S9(08) USAGE COMP    VALUE  7143.
001560     05  WK-806-7144-IDX   PIC S9(08) USAGE COMP    VALUE  7144.
001570     05  WK-806-7145-IDX   PIC S9(08) USAGE COMP    VALUE  7145.
001580     05  WK-806-7146-IDX   PIC S9(08) USAGE COMP    VALUE  7146.
001590     05  WK-806-7147-IDX   PIC S9(08) USAGE COMP    VALUE  7147.
001600     05  WK-806-7148-IDX   PIC S9(08) USAGE COMP    VALUE  7148.
001610     05  WK-806-7149-IDX   PIC S9(08) USAGE COMP    VALUE  7149.
001620     05  WK-806-7150-IDX   PIC S9(08) USAGE COMP    VALUE  7150.
001630     05  WK-806-7151-IDX   PIC S9(08) USAGE COMP    VALUE  7151.
001640     05  WK-806-7152-IDX   PIC S9(08) USAGE COMP    VALUE  7152.
001650     05  WK-806-7153-IDX   PIC S9(08) USAGE COMP    VALUE  7153.
001660     05  WK-806-7154-IDX   PIC S9(08) USAGE COMP    VALUE  7154.
001670     05  WK-806-7155-IDX   PIC S9(08) USAGE COMP    VALUE  7155.
001680     05  WK-806-7156-IDX   PIC S9(08) USAGE COMP    VALUE  7156.
001690     05  WK-806-7157-IDX   PIC S9(08) USAGE COMP    VALUE  7157.
001700     05  WK-806-7158-IDX   PIC S9(08) USAGE COMP    VALUE  7158.
001710     05  WK-806-7159-IDX   PIC S9(08) USAGE COMP    VALUE  7159.
001720     05  WK-806-7160-IDX   PIC S9(08) USAGE COMP    VALUE  7160.
001730     05  WK-806-7161-IDX   PIC S9(08) USAGE COMP    VALUE  7161.
001740     05  WK-806-7162-IDX   PIC S9(08) USAGE COMP    VALUE  7162.
001750     05  WK-806-7163-IDX   PIC S9(08) USAGE COMP    VALUE  7163.
001760     05  WK-806-7164-IDX   PIC S9(08) USAGE COMP    VALUE  7164.
001770     05  WK-806-7165-IDX   PIC S9(08) USAGE COMP    VALUE  7165.
001780     05  WK-806-7166-IDX   PIC S9(08) USAGE COMP    VALUE  7166.
001790     05  WK-806-7167-IDX   PIC S9(08) USAGE COMP    VALUE  7167.
001800     05  WK-806-7168-IDX   PIC S9(08) USAGE COMP    VALUE  7168.
001810     05  WK-806-7169-IDX   PIC S9(08) USAGE COMP    VALUE  7169.
001820     05  WK-806-7170-IDX   PIC S9(08) USAGE COMP    VALUE  7170.
001830     05  WK-806-7171-IDX   PIC S9(08) USAGE COMP    VALUE  7171.
001840     05  WK-806-7172-IDX   PIC S9(08) USAGE COMP    VALUE  7172.
001850     05  WK-806-7173-IDX   PIC S9(08) USAGE COMP    VALUE  7173.
001860     05  WK-806-7174-IDX   PIC S9(08) USAGE COMP    VALUE  7174.
001870     05  WK-806-7175-IDX   PIC S9(08) USAGE COMP    VALUE  7175.
001880     05  WK-806-7176-IDX   PIC S9(08) USAGE COMP    VALUE  7176.
001890     05  WK-806-7177-IDX   PIC S9(08) USAGE COMP    VALUE  7177.
001900     05  WK-806-7178-IDX   PIC S9(08) USAGE COMP    VALUE  7178.
001910     05  WK-806-7179-IDX   PIC S9(08) USAGE COMP    VALUE  7179.
001920     05  WK-806-7180-IDX   PIC S9(08) USAGE COMP    VALUE  7180.
001930     05  WK-806-7181-IDX   PIC S9(08) USAGE COMP    VALUE  7181.
001940     05  WK-806-7182-IDX   PIC S9(08) USAGE COMP    VALUE  7182.
001950     05  WK-806-7183-IDX   PIC S9(08) USAGE COMP    VALUE  7183.
001960     05  WK-806-7184-IDX   PIC S9(08) USAGE COMP    VALUE  7184.
001970     05  WK-806-7185-IDX   PIC S9(08) USAGE COMP    VALUE  7185.
001980     05  WK-806-7186-IDX   PIC S9(08) USAGE COMP    VALUE  7186.
001990     05  WK-806-7187-IDX   PIC S9(08) USAGE COMP    VALUE  7187.
002000     05  WK-806-7188-IDX   PIC S9(08) USAGE COMP    VALUE  7188.
002010     05  WK-806-7189-IDX   PIC S9(08) USAGE COMP    VALUE  7189.
002020     05  WK-806-7190-IDX   PIC S9(08) USAGE COMP    VALUE  7190.
002030     05  WK-806-7191-IDX   PIC S9(08) USAGE COMP    VALUE  7191.
002040     05  WK-806-7192-IDX   PIC S9(08) USAGE COMP    VALUE  7192.
002050     05  WK-806-7193-IDX   PIC S9(08) USAGE COMP    VALUE  7193.
002060     05  WK-806-7194-IDX   PIC S9(08) USAGE COMP    VALUE  7194.
002070     05  WK-806-7195-IDX   PIC S9(08) USAGE COMP    VALUE  7195.
002080     05  WK-806-7196-IDX   PIC S9(08) USAGE COMP    VALUE  7196.
002090     05  WK-806-7197-IDX   PIC S9(08) USAGE COMP    VALUE  7197.
002100     05  WK-806-7198-IDX   PIC S9(08) USAGE COMP    VALUE  7198.
002110     05  WK-806-7199-IDX   PIC S9(08) USAGE COMP    VALUE  7199.
002120     05  WK-806-7200-IDX   PIC S9(08) USAGE COMP    VALUE  7200.
002130     05  WK-806-7201-IDX   PIC S9(08) USAGE COMP    VALUE  7201.
002140     05  WK-806-7202-IDX   PIC S9(08) USAGE COMP    VALUE  7202.
002150     05  WK-806-7203-IDX   PIC S9(08) USAGE COMP    VALUE  7203.
002160     05  WK-806-7204-IDX   PIC S9(08) USAGE COMP    VALUE  7204.
002170     05  WK-806-7205-IDX   PIC S9(08) USAGE COMP    VALUE  7205.
002180     05  WK-806-7206-IDX   PIC S9(08) USAGE COMP    VALUE  7206.
002190     05  WK-806-7207-IDX   PIC S9(08) USAGE COMP    VALUE  7207.
002200     05  WK-806-7208-IDX   PIC S9(08) USAGE COMP    VALUE  7208.
002210     05  WK-806-7209-IDX   PIC S9(08) USAGE COMP    VALUE  7209.
002220     05  WK-806-7210-IDX   PIC S9(08) USAGE COMP    VALUE  7210.
002230     05  WK-806-7211-IDX   PIC S9(08) USAGE COMP    VALUE  7211.
002240     05  WK-806-7212-IDX   PIC S9(08) USAGE COMP    VALUE  7212.
002250     05  WK-806-7213-IDX   PIC S9(08) USAGE COMP    VALUE  7213.
002260     05  WK-806-7214-IDX   PIC S9(08) USAGE COMP    VALUE  7214.
002270     05  WK-806-7215-IDX   PIC S9(08) USAGE COMP    VALUE  7215.
002280     05  WK-806-7216-IDX   PIC S9(08) USAGE COMP    VALUE  7216.
002290     05  WK-806-7217-IDX   PIC S9(08) USAGE COMP    VALUE  7217.
002300     05  WK-806-7218-IDX   PIC S9(08) USAGE COMP    VALUE  7218.
002310     05  WK-806-7219-IDX   PIC S9(08) USAGE COMP    VALUE  7219.
002320     05  WK-806-7220-IDX   PIC S9(08) USAGE COMP    VALUE  7220.
002330     05  WK-806-7221-IDX   PIC S9(08) USAGE COMP    VALUE  7221.
002340     05  WK-806-7222-IDX   PIC S9(08) USAGE COMP    VALUE  7222.
002350     05  WK-806-7223-IDX   PIC S9(08) USAGE COMP    VALUE  7223.
002360     05  WK-806-7224-IDX   PIC S9(08) USAGE COMP    VALUE  7224.
002370     05  WK-806-7225-IDX   PIC S9(08) USAGE COMP    VALUE  7225.
002380     05  WK-806-7226-IDX   PIC S9(08) USAGE COMP    VALUE  7226.
002390     05  WK-806-7227-IDX   PIC S9(08) USAGE COMP    VALUE  7227.
002400     05  WK-806-7228-IDX   PIC S9(08) USAGE COMP    VALUE  7228.
002410     05  WK-806-7229-IDX   PIC S9(08) USAGE COMP    VALUE  7229.
002420     05  WK-806-7230-IDX   PIC S9(08) USAGE COMP    VALUE  7230.
002430     05  WK-806-7231-IDX   PIC S9(08) USAGE COMP    VALUE  7231.
002440     05  WK-806-7232-IDX   PIC S9(08) USAGE COMP    VALUE  7232.
002450     05  WK-806-7233-IDX   PIC S9(08) USAGE COMP    VALUE  7233.
002460     05  WK-806-7234-IDX   PIC S9(08) USAGE COMP    VALUE  7234.
002470     05  WK-806-7235-IDX   PIC S9(08) USAGE COMP    VALUE  7235.
002480     05  WK-806-7236-IDX   PIC S9(08) USAGE COMP    VALUE  7236.
002490     05  WK-806-7237-IDX   PIC S9(08) USAGE COMP    VALUE  7237.
002500     05  WK-806-7238-IDX   PIC S9(08) USAGE COMP    VALUE  7238.
002510     05  WK-806-7239-IDX   PIC S9(08) USAGE COMP    VALUE  7239.
002520     05  WK-806-7240-IDX   PIC S9(08) USAGE COMP    VALUE  7240.
002530     05  WK-806-7241-IDX   PIC S9(08) USAGE COMP    VALUE  7241.
002540     05  WK-806-7242-IDX   PIC S9(08) USAGE COMP    VALUE  7242.
002550     05  WK-806-7243-IDX   PIC S9(08) USAGE COMP    VALUE  7243.
002560     05  WK-806-7244-IDX   PIC S9(08) USAGE COMP    VALUE  7244.
002570     05  WK-806-7245-IDX   PIC S9(08) USAGE COMP    VALUE  7245.
002580     05  WK-806-7246-IDX   PIC S9(08) USAGE COMP    VALUE  7246.
002590     05  WK-806-7247-IDX   PIC S9(08) USAGE COMP    VALUE  7247.
002600     05  WK-806-7248-IDX   PIC S9(08) USAGE COMP    VALUE  7248.
002610     05  WK-806-7249-IDX   PIC S9(08) USAGE COMP    VALUE  7249.
002620     05  WK-806-7250-IDX   PIC S9(08) USAGE COMP    VALUE  7250.
002630     05  WK-806-7251-IDX   PIC S9(08) USAGE COMP    VALUE  7251.
002640     05  WK-806-7252-IDX   PIC S9(08) USAGE COMP    VALUE  7252.
002650     05  WK-806-7253-IDX   PIC S9(08) USAGE COMP    VALUE  7253.
002660     05  WK-806-7254-IDX   PIC S9(08) USAGE COMP    VALUE  7254.
002670     05  WK-806-7255-IDX   PIC S9(08) USAGE COMP    VALUE  7255.
002680     05  WK-806-7256-IDX   PIC S9(08) USAGE COMP    VALUE  7256.
002690     05  WK-806-7257-IDX   PIC S9(08) USAGE COMP    VALUE  7257.
002700     05  WK-806-7258-IDX   PIC S9(08) USAGE COMP    VALUE  7258.
002710     05  WK-806-7259-IDX   PIC S9(08) USAGE COMP    VALUE  7259.
002720     05  WK-806-7260-IDX   PIC S9(08) USAGE COMP    VALUE  7260.
002730     05  WK-806-7261-IDX   PIC S9(08) USAGE COMP    VALUE  7261.
002740     05  WK-806-7262-IDX   PIC S9(08) USAGE COMP    VALUE  7262.
002750     05  WK-806-7263-IDX   PIC S9(08) USAGE COMP    VALUE  7263.
002760     05  WK-806-7264-IDX   PIC S9(08) USAGE COMP    VALUE  7264.
002770     05  WK-806-7265-IDX   PIC S9(08) USAGE COMP    VALUE  7265.
002780     05  WK-806-7266-IDX   PIC S9(08) USAGE COMP    VALUE  7266.
002790     05  WK-806-7267-IDX   PIC S9(08) USAGE COMP    VALUE  7267.
002800     05  WK-806-7268-IDX   PIC S9(08) USAGE COMP    VALUE  7268.
002810     05  WK-806-7269-IDX   PIC S9(08) USAGE COMP    VALUE  7269.
002820     05  WK-806-7270-IDX   PIC S9(08) USAGE COMP    VALUE  7270.
002830     05  WK-806-7271-IDX   PIC S9(08) USAGE COMP    VALUE  7271.
002840     05  WK-806-7272-IDX   PIC S9(08) USAGE COMP    VALUE  7272.
002850     05  WK-806-7273-IDX   PIC S9(08) USAGE COMP    VALUE  7273.
002860     05  WK-806-7274-IDX   PIC S9(08) USAGE COMP    VALUE  7274.
002870     05  WK-806-7275-IDX   PIC S9(08) USAGE COMP    VALUE  7275.
002880     05  WK-806-7276-IDX   PIC S9(08) USAGE COMP    VALUE  7276.
002890     05  WK-806-7277-IDX   PIC S9(08) USAGE COMP    VALUE  7277.
002900     05  WK-806-7278-IDX   PIC S9(08) USAGE COMP    VALUE  7278.
002910     05  WK-806-7279-IDX   PIC S9(08) USAGE COMP    VALUE  7279.
002920     05  WK-806-7280-IDX   PIC S9(08) USAGE COMP    VALUE  7280.
002930     05  WK-806-7281-IDX   PIC S9(08) USAGE COMP    VALUE  7281.
002940     05  WK-806-7282-IDX   PIC S9(08) USAGE COMP    VALUE  7282.
002950     05  WK-806-7283-IDX   PIC S9(08) USAGE COMP    VALUE  7283.
002960     05  WK-806-7284-IDX   PIC S9(08) USAGE COMP    VALUE  7284.
002970     05  WK-806-7285-IDX   PIC S9(08) USAGE COMP    VALUE  7285.
002980     05  WK-806-7286-IDX   PIC S9(08) USAGE COMP    VALUE  7286.
002990     05  WK-806-7287-IDX   PIC S9(08) USAGE COMP    VALUE  7287.
003000     05  WK-806-7288-IDX   PIC S9(08) USAGE COMP    VALUE  7288.
003010     05  WK-806-7289-IDX   PIC S9(08) USAGE COMP    VALUE  7289.
003020     05  WK-806-7290-IDX   PIC S9(08) USAGE COMP    VALUE  7290.
003030     05  WK-806-7291-IDX   PIC S9(08) USAGE COMP    VALUE  7291.
003040     05  WK-806-7292-IDX   PIC S9(08) USAGE COMP    VALUE  7292.
003050     05  WK-806-7293-IDX   PIC S9(08) USAGE COMP    VALUE  7293.
003060     05  WK-806-7294-IDX   PIC S9(08) USAGE COMP    VALUE  7294.
003070     05  WK-806-7295-IDX   PIC S9(08) USAGE COMP    VALUE  7295.
003080     05  WK-806-7296-IDX   PIC S9(08) USAGE COMP    VALUE  7296.
003090     05  WK-806-7297-IDX   PIC S9(08) USAGE COMP    VALUE  7297.
003100     05  WK-806-7298-IDX   PIC S9(08) USAGE COMP    VALUE  7298.
003110     05  WK-806-7299-IDX   PIC S9(08) USAGE COMP    VALUE  7299.
003120     05  WK-806-7300-IDX   PIC S9(08) USAGE COMP    VALUE  7300.
003130     05  WK-806-7301-IDX   PIC S9(08) USAGE COMP    VALUE  7301.
003140     05  WK-806-7302-IDX   PIC S9(08) USAGE COMP    VALUE  7302.
003150     05  WK-806-7303-IDX   PIC S9(08) USAGE COMP    VALUE  7303.
003160     05  WK-806-7304-IDX   PIC S9(08) USAGE COMP    VALUE  7304.
003170     05  WK-806-7305-IDX   PIC S9(08) USAGE COMP    VALUE  7305.
003180     05  WK-806-7306-IDX   PIC S9(08) USAGE COMP    VALUE  7306.
003190     05  WK-806-7307-IDX   PIC S9(08) USAGE COMP    VALUE  7307.
003200     05  WK-806-7308-IDX   PIC S9(08) USAGE COMP    VALUE  7308.
003210     05  WK-806-7309-IDX   PIC S9(08) USAGE COMP    VALUE  7309.
003220     05  WK-806-7310-IDX   PIC S9(08) USAGE COMP    VALUE  7310.
003230     05  WK-806-7311-IDX   PIC S9(08) USAGE COMP    VALUE  7311.
003240     05  WK-806-7312-IDX   PIC S9(08) USAGE COMP    VALUE  7312.
003250     05  WK-806-7313-IDX   PIC S9(08) USAGE COMP    VALUE  7313.
003260     05  WK-806-7314-IDX   PIC S9(08) USAGE COMP    VALUE  7314.
003270     05  WK-806-7315-IDX   PIC S9(08) USAGE COMP    VALUE  7315.
003280     05  WK-806-7316-IDX   PIC S9(08) USAGE COMP    VALUE  7316.
003290     05  WK-806-7317-IDX   PIC S9(08) USAGE COMP    VALUE  7317.
003300     05  WK-806-7318-IDX   PIC S9(08) USAGE COMP    VALUE  7318.
003310     05  WK-806-7319-IDX   PIC S9(08) USAGE COMP    VALUE  7319.
003320     05  WK-806-7320-IDX   PIC S9(08) USAGE COMP    VALUE  7320.
003330     05  WK-806-7321-IDX   PIC S9(08) USAGE COMP    VALUE  7321.
003340     05  WK-806-7322-IDX   PIC S9(08) USAGE COMP    VALUE  7322.
003350     05  WK-806-7323-IDX   PIC S9(08) USAGE COMP    VALUE  7323.
003360     05  WK-806-7324-IDX   PIC S9(08) USAGE COMP    VALUE  7324.
003370     05  WK-806-7325-IDX   PIC S9(08) USAGE COMP    VALUE  7325.
003380     05  WK-806-7326-IDX   PIC S9(08) USAGE COMP    VALUE  7326.
003390     05  WK-806-7327-IDX   PIC S9(08) USAGE COMP    VALUE  7327.
003400     05  WK-806-7328-IDX   PIC S9(08) USAGE COMP    VALUE  7328.
003410     05  WK-806-7329-IDX   PIC S9(08) USAGE COMP    VALUE  7329.
003420     05  WK-806-7330-IDX   PIC S9(08) USAGE COMP    VALUE  7330.
003430     05  WK-806-7331-IDX   PIC S9(08) USAGE COMP    VALUE  7331.
003440     05  WK-806-7332-IDX   PIC S9(08) USAGE COMP    VALUE  7332.
003450     05  WK-806-7333-IDX   PIC S9(08) USAGE COMP    VALUE  7333.
003460     05  WK-806-7334-IDX   PIC S9(08) USAGE COMP    VALUE  7334.
003470     05  WK-806-7335-IDX   PIC S9(08) USAGE COMP    VALUE  7335.
003480     05  WK-806-7336-IDX   PIC S9(08) USAGE COMP    VALUE  7336.
003490     05  WK-806-7337-IDX   PIC S9(08) USAGE COMP    VALUE  7337.
003500     05  WK-806-7338-IDX   PIC S9(08) USAGE COMP    VALUE  7338.
003510     05  WK-806-7339-IDX   PIC S9(08) USAGE COMP    VALUE  7339.
003520     05  WK-806-7340-IDX   PIC S9(08) USAGE COMP    VALUE  7340.
003530     05  WK-806-7341-IDX   PIC S9(08) USAGE COMP    VALUE  7341.
003540     05  WK-806-7342-IDX   PIC S9(08) USAGE COMP    VALUE  7342.
003550     05  WK-806-7343-IDX   PIC S9(08) USAGE COMP    VALUE  7343.
003560     05  WK-806-7344-IDX   PIC S9(08) USAGE COMP    VALUE  7344.
003570     05  WK-806-7345-IDX   PIC S9(08) USAGE COMP    VALUE  7345.
003580     05  WK-806-7346-IDX   PIC S9(08) USAGE COMP    VALUE  7346.
003590     05  WK-806-7347-IDX   PIC S9(08) USAGE COMP    VALUE  7347.
003600     05  WK-806-7348-IDX   PIC S9(08) USAGE COMP    VALUE  7348.
003610     05  WK-806-7349-IDX   PIC S9(08) USAGE COMP    VALUE  7349.
003620     05  WK-806-7350-IDX   PIC S9(08) USAGE COMP    VALUE  7350.
003630     05  WK-806-7351-IDX   PIC S9(08) USAGE COMP    VALUE  7351.
003640     05  WK-806-7352-IDX   PIC S9(08) USAGE COMP    VALUE  7352.
003650     05  WK-806-7353-IDX   PIC S9(08) USAGE COMP    VALUE  7353.
003660     05  WK-806-7354-IDX   PIC S9(08) USAGE COMP    VALUE  7354.
003670     05  WK-806-7355-IDX   PIC S9(08) USAGE COMP    VALUE  7355.
003680     05  WK-806-7356-IDX   PIC S9(08) USAGE COMP    VALUE  7356.
003690     05  WK-806-7357-IDX   PIC S9(08) USAGE COMP    VALUE  7357.
003700     05  WK-806-7358-IDX   PIC S9(08) USAGE COMP    VALUE  7358.
003710     05  WK-806-7359-IDX   PIC S9(08) USAGE COMP    VALUE  7359.
003720     05  WK-806-7360-IDX   PIC S9(08) USAGE COMP    VALUE  7360.
003730     05  WK-806-7361-IDX   PIC S9(08) USAGE COMP    VALUE  7361.
003740     05  WK-806-7362-IDX   PIC S9(08) USAGE COMP    VALUE  7362.
003750     05  WK-806-7363-IDX   PIC S9(08) USAGE COMP    VALUE  7363.
003760     05  WK-806-7364-IDX   PIC S9(08) USAGE COMP    VALUE  7364.
003770     05  WK-806-7365-IDX   PIC S9(08) USAGE COMP    VALUE  7365.
003780     05  WK-806-7366-IDX   PIC S9(08) USAGE COMP    VALUE  7366.
003790     05  WK-806-7367-IDX   PIC S9(08) USAGE COMP    VALUE  7367.
003800     05  WK-806-7368-IDX   PIC S9(08) USAGE COMP    VALUE  7368.
003810     05  WK-806-7369-IDX   PIC S9(08) USAGE COMP    VALUE  7369.
003820     05  WK-806-7370-IDX   PIC S9(08) USAGE COMP    VALUE  7370.
003830     05  WK-806-7371-IDX   PIC S9(08) USAGE COMP    VALUE  7371.
003840     05  WK-806-7372-IDX   PIC S9(08) USAGE COMP    VALUE  7372.
003850     05  WK-806-7373-IDX   PIC S9(08) USAGE COMP    VALUE  7373.
003860     05  WK-806-7374-IDX   PIC S9(08) USAGE COMP    VALUE  7374.
003870     05  WK-806-7375-IDX   PIC S9(08) USAGE COMP    VALUE  7375.
003880     05  WK-806-7376-IDX   PIC S9(08) USAGE COMP    VALUE  7376.
003890     05  WK-806-7377-IDX   PIC S9(08) USAGE COMP    VALUE  7377.
003900     05  WK-806-7378-IDX   PIC S9(08) USAGE COMP    VALUE  7378.
003910     05  WK-806-7379-IDX   PIC S9(08) USAGE COMP    VALUE  7379.
003920     05  WK-806-7380-IDX   PIC S9(08) USAGE COMP    VALUE  7380.
003930     05  WK-806-7381-IDX   PIC S9(08) USAGE COMP    VALUE  7381.
003940     05  WK-806-7382-IDX   PIC S9(08) USAGE COMP    VALUE  7382.
003950     05  WK-806-7383-IDX   PIC S9(08) USAGE COMP    VALUE  7383.
003960     05  WK-806-7384-IDX   PIC S9(08) USAGE COMP    VALUE  7384.
003970     05  WK-806-7385-IDX   PIC S9(08) USAGE COMP    VALUE  7385.
003980     05  WK-806-7386-IDX   PIC S9(08) USAGE COMP    VALUE  7386.
003990     05  WK-806-7387-IDX   PIC S9(08) USAGE COMP    VALUE  7387.
004000     05  WK-806-7388-IDX   PIC S9(08) USAGE COMP    VALUE  7388.
004010     05  WK-806-7389-IDX   PIC S9(08) USAGE COMP    VALUE  7389.
004020     05  WK-806-7390-IDX   PIC S9(08) USAGE COMP    VALUE  7390.
004030     05  WK-806-7391-IDX   PIC S9(08) USAGE COMP    VALUE  7391.
004040     05  WK-806-7392-IDX   PIC S9(08) USAGE COMP    VALUE  7392.
004050     05  WK-806-7393-IDX   PIC S9(08) USAGE COMP    VALUE  7393.
004060     05  WK-806-7394-IDX   PIC S9(08) USAGE COMP    VALUE  7394.
004070     05  WK-806-7395-IDX   PIC S9(08) USAGE COMP    VALUE  7395.
004080     05  WK-806-7396-IDX   PIC S9(08) USAGE COMP    VALUE  7396.
004090     05  WK-806-7397-IDX   PIC S9(08) USAGE COMP    VALUE  7397.
004100     05  WK-806-7398-IDX   PIC S9(08) USAGE COMP    VALUE  7398.
004110     05  WK-806-7399-IDX   PIC S9(08) USAGE COMP    VALUE  7399.
004120     05  WK-806-7400-IDX   PIC S9(08) USAGE COMP    VALUE  7400.
004130     05  WK-806-7401-IDX   PIC S9(08) USAGE COMP    VALUE  7401.
004140     05  WK-806-7402-IDX   PIC S9(08) USAGE COMP    VALUE  7402.
004150     05  WK-806-7403-IDX   PIC S9(08) USAGE COMP    VALUE  7403.
004160     05  WK-806-7404-IDX   PIC S9(08) USAGE COMP    VALUE  7404.
004170     05  WK-806-7405-IDX   PIC S9(08) USAGE COMP    VALUE  7405.
004180     05  WK-806-7406-IDX   PIC S9(08) USAGE COMP    VALUE  7406.
004190     05  WK-806-7407-IDX   PIC S9(08) USAGE COMP    VALUE  7407.
004200     05  WK-806-7408-IDX   PIC S9(08) USAGE COMP    VALUE  7408.
004210     05  WK-806-7409-IDX   PIC S9(08) USAGE COMP    VALUE  7409.
004220     05  WK-806-7410-IDX   PIC S9(08) USAGE COMP    VALUE  7410.
004230     05  WK-806-7411-IDX   PIC S9(08) USAGE COMP    VALUE  7411.
004240     05  WK-806-7412-IDX   PIC S9(08) USAGE COMP    VALUE  7412.
004250     05  WK-806-7413-IDX   PIC S9(08) USAGE COMP    VALUE  7413.
004260     05  WK-806-7414-IDX   PIC S9(08) USAGE COMP    VALUE  7414.
004270     05  WK-806-7415-IDX   PIC S9(08) USAGE COMP    VALUE  7415.
004280     05  WK-806-7416-IDX   PIC S9(08) USAGE COMP    VALUE  7416.
004290     05  WK-806-7417-IDX   PIC S9(08) USAGE COMP    VALUE  7417.
004300     05  WK-806-7418-IDX   PIC S9(08) USAGE COMP    VALUE  7418.
004310     05  WK-806-7419-IDX   PIC S9(08) USAGE COMP    VALUE  7419.
004320     05  WK-806-7420-IDX   PIC S9(08) USAGE COMP    VALUE  7420.
004330     05  WK-806-7421-IDX   PIC S9(08) USAGE COMP    VALUE  7421.
004340     05  WK-806-7422-IDX   PIC S9(08) USAGE COMP    VALUE  7422.
004350     05  WK-806-7423-IDX   PIC S9(08) USAGE COMP    VALUE  7423.
004360     05  WK-806-7424-IDX   PIC S9(08) USAGE COMP    VALUE  7424.
004370     05  WK-806-7425-IDX   PIC S9(08) USAGE COMP    VALUE  7425.
004380     05  WK-806-7426-IDX   PIC S9(08) USAGE COMP    VALUE  7426.
004390     05  WK-806-7427-IDX   PIC S9(08) USAGE COMP    VALUE  7427.
004400     05  WK-806-7428-IDX   PIC S9(08) USAGE COMP    VALUE  7428.
004410     05  WK-806-7429-IDX   PIC S9(08) USAGE COMP    VALUE  7429.
004420     05  WK-806-7430-IDX   PIC S9(08) USAGE COMP    VALUE  7430.
004430     05  WK-806-7431-IDX   PIC S9(08) USAGE COMP    VALUE  7431.
004440     05  WK-806-7432-IDX   PIC S9(08) USAGE COMP    VALUE  7432.
004450     05  WK-806-7433-IDX   PIC S9(08) USAGE COMP    VALUE  7433.
004460     05  WK-806-7434-IDX   PIC S9(08) USAGE COMP    VALUE  7434.
004470     05  WK-806-7435-IDX   PIC S9(08) USAGE COMP    VALUE  7435.
004480     05  WK-806-7436-IDX   PIC S9(08) USAGE COMP    VALUE  7436.
004490     05  WK-806-7437-IDX   PIC S9(08) USAGE COMP    VALUE  7437.
004500     05  WK-806-7438-IDX   PIC S9(08) USAGE COMP    VALUE  7438.
004510     05  WK-806-7439-IDX   PIC S9(08) USAGE COMP    VALUE  7439.
004520     05  WK-806-7440-IDX   PIC S9(08) USAGE COMP    VALUE  7440.
004530     05  WK-806-7441-IDX   PIC S9(08) USAGE COMP    VALUE  7441.
004540     05  WK-806-7442-IDX   PIC S9(08) USAGE COMP    VALUE  7442.
004550     05  WK-806-7443-IDX   PIC S9(08) USAGE COMP    VALUE  7443.
004560     05  WK-806-7444-IDX   PIC S9(08) USAGE COMP    VALUE  7444.
004570     05  WK-806-7445-IDX   PIC S9(08) USAGE COMP    VALUE  7445.
004580     05  WK-806-7446-IDX   PIC S9(08) USAGE COMP    VALUE  7446.
004590     05  WK-806-7447-IDX   PIC S9(08) USAGE COMP    VALUE  7447.
004600     05  WK-806-7448-IDX   PIC S9(08) USAGE COMP    VALUE  7448.
004610     05  WK-806-7449-IDX   PIC S9(08) USAGE COMP    VALUE  7449.
004620     05  WK-806-7450-IDX   PIC S9(08) USAGE COMP    VALUE  7450.
004630     05  WK-806-7451-IDX   PIC S9(08) USAGE COMP    VALUE  7451.
004640     05  WK-806-7452-IDX   PIC S9(08) USAGE COMP    VALUE  7452.
004650     05  WK-806-7453-IDX   PIC S9(08) USAGE COMP    VALUE  7453.
004660     05  WK-806-7454-IDX   PIC S9(08) USAGE COMP    VALUE  7454.
004670     05  WK-806-7455-IDX   PIC S9(08) USAGE COMP    VALUE  7455.
004680     05  WK-806-7456-IDX   PIC S9(08) USAGE COMP    VALUE  7456.
004690     05  WK-806-7457-IDX   PIC S9(08) USAGE COMP    VALUE  7457.
004700     05  WK-806-7458-IDX   PIC S9(08) USAGE COMP    VALUE  7458.
004710     05  WK-806-7459-IDX   PIC S9(08) USAGE COMP    VALUE  7459.
004720     05  WK-806-7460-IDX   PIC S9(08) USAGE COMP    VALUE  7460.
004730     05  WK-806-7461-IDX   PIC S9(08) USAGE COMP    VALUE  7461.
004740     05  WK-806-7462-IDX   PIC S9(08) USAGE COMP    VALUE  7462.
004750     05  WK-806-7463-IDX   PIC S9(08) USAGE COMP    VALUE  7463.
004760     05  WK-806-7464-IDX   PIC S9(08) USAGE COMP    VALUE  7464.
004770     05  WK-806-7465-IDX   PIC S9(08) USAGE COMP    VALUE  7465.
004780     05  WK-806-7466-IDX   PIC S9(08) USAGE COMP    VALUE  7466.
004790     05  WK-806-7467-IDX   PIC S9(08) USAGE COMP    VALUE  7467.
004800     05  WK-806-7468-IDX   PIC S9(08) USAGE COMP    VALUE  7468.
004810     05  WK-806-7469-IDX   PIC S9(08) USAGE COMP    VALUE  7469.
004820     05  WK-806-7470-IDX   PIC S9(08) USAGE COMP    VALUE  7470.
004830     05  WK-806-7471-IDX   PIC S9(08) USAGE COMP    VALUE  7471.
004840     05  WK-806-7472-IDX   PIC S9(08) USAGE COMP    VALUE  7472.
004850     05  WK-806-7473-IDX   PIC S9(08) USAGE COMP    VALUE  7473.
004860     05  WK-806-7474-IDX   PIC S9(08) USAGE COMP    VALUE  7474.
004870     05  WK-806-7475-IDX   PIC S9(08) USAGE COMP    VALUE  7475.
004880     05  WK-806-7476-IDX   PIC S9(08) USAGE COMP    VALUE  7476.
004890     05  WK-806-7477-IDX   PIC S9(08) USAGE COMP    VALUE  7477.
004900     05  WK-806-7478-IDX   PIC S9(08) USAGE COMP    VALUE  7478.
004910     05  WK-806-7479-IDX   PIC S9(08) USAGE COMP    VALUE  7479.
004920     05  WK-806-7480-IDX   PIC S9(08) USAGE COMP    VALUE  7480.
004930     05  WK-806-7481-IDX   PIC S9(08) USAGE COMP    VALUE  7481.
004940     05  WK-806-7482-IDX   PIC S9(08) USAGE COMP    VALUE  7482.
004950     05  WK-806-7483-IDX   PIC S9(08) USAGE COMP    VALUE  7483.
004960     05  WK-806-7484-IDX   PIC S9(08) USAGE COMP    VALUE  7484.
004970     05  WK-806-7485-IDX   PIC S9(08) USAGE COMP    VALUE  7485.
004980     05  WK-806-7486-IDX   PIC S9(08) USAGE COMP    VALUE  7486.
004990     05  WK-806-7487-IDX   PIC S9(08) USAGE COMP    VALUE  7487.
005000     05  WK-806-7488-IDX   PIC S9(08) USAGE COMP    VALUE  7488.
005010     05  WK-806-7489-IDX   PIC S9(08) USAGE COMP    VALUE  7489.
005020     05  WK-806-7490-IDX   PIC S9(08) USAGE COMP    VALUE  7490.
005030     05  WK-806-7491-IDX   PIC S9(08) USAGE COMP    VALUE  7491.
005040     05  WK-806-7492-IDX   PIC S9(08) USAGE COMP    VALUE  7492.
005050     05  WK-806-7493-IDX   PIC S9(08) USAGE COMP    VALUE  7493.
005060     05  WK-806-7494-IDX   PIC S9(08) USAGE COMP    VALUE  7494.
005070     05  WK-806-7495-IDX   PIC S9(08) USAGE COMP    VALUE  7495.
005080     05  WK-806-7496-IDX   PIC S9(08) USAGE COMP    VALUE  7496.
005090     05  WK-806-7497-IDX   PIC S9(08) USAGE COMP    VALUE  7497.
005100     05  WK-806-7498-IDX   PIC S9(08) USAGE COMP    VALUE  7498.
005110     05  WK-806-7499-IDX   PIC S9(08) USAGE COMP    VALUE  7499.
005120     05  WK-806-7500-IDX   PIC S9(08) USAGE COMP    VALUE  7500.
005130     05  WK-806-7501-IDX   PIC S9(08) USAGE COMP    VALUE  7501.
005140     05  WK-806-7502-IDX   PIC S9(08) USAGE COMP    VALUE  7502.
005150     05  WK-806-7503-IDX   PIC S9(08) USAGE COMP    VALUE  7503.
005160     05  WK-806-7504-IDX   PIC S9(08) USAGE COMP    VALUE  7504.
005170     05  WK-806-7505-IDX   PIC S9(08) USAGE COMP    VALUE  7505.
005180     05  WK-806-7506-IDX   PIC S9(08) USAGE COMP    VALUE  7506.
005190     05  WK-806-7507-IDX   PIC S9(08) USAGE COMP    VALUE  7507.
005200     05  WK-806-7508-IDX   PIC S9(08) USAGE COMP    VALUE  7508.
005210     05  WK-806-7509-IDX   PIC S9(08) USAGE COMP    VALUE  7509.
005220     05  WK-806-7510-IDX   PIC S9(08) USAGE COMP    VALUE  7510.
005230     05  WK-806-7511-IDX   PIC S9(08) USAGE COMP    VALUE  7511.
005240     05  WK-806-7512-IDX   PIC S9(08) USAGE COMP    VALUE  7512.
005250     05  WK-806-7513-IDX   PIC S9(08) USAGE COMP    VALUE  7513.
005260     05  WK-806-7514-IDX   PIC S9(08) USAGE COMP    VALUE  7514.
005270     05  WK-806-7515-IDX   PIC S9(08) USAGE COMP    VALUE  7515.
005280     05  WK-806-7516-IDX   PIC S9(08) USAGE COMP    VALUE  7516.
005290     05  WK-806-7517-IDX   PIC S9(08) USAGE COMP    VALUE  7517.
005300     05  WK-806-7518-IDX   PIC S9(08) USAGE COMP    VALUE  7518.
005310     05  WK-806-7519-IDX   PIC S9(08) USAGE COMP    VALUE  7519.
005320     05  WK-806-7520-IDX   PIC S9(08) USAGE COMP    VALUE  7520.
005330     05  WK-806-7521-IDX   PIC S9(08) USAGE COMP    VALUE  7521.
005340     05  WK-806-7522-IDX   PIC S9(08) USAGE COMP    VALUE  7522.
005350     05  WK-806-7523-IDX   PIC S9(08) USAGE COMP    VALUE  7523.
005360     05  WK-806-7524-IDX   PIC S9(08) USAGE COMP    VALUE  7524.
005370     05  WK-806-7525-IDX   PIC S9(08) USAGE COMP    VALUE  7525.
005380     05  WK-806-7526-IDX   PIC S9(08) USAGE COMP    VALUE  7526.
005390     05  WK-806-7527-IDX   PIC S9(08) USAGE COMP    VALUE  7527.
005400     05  WK-806-7528-IDX   PIC S9(08) USAGE COMP    VALUE  7528.
005410     05  WK-806-7529-IDX   PIC S9(08) USAGE COMP    VALUE  7529.
005420     05  WK-806-7530-IDX   PIC S9(08) USAGE COMP    VALUE  7530.
005430     05  WK-806-7531-IDX   PIC S9(08) USAGE COMP    VALUE  7531.
005440     05  WK-806-7532-IDX   PIC S9(08) USAGE COMP    VALUE  7532.
005450     05  WK-806-7533-IDX   PIC S9(08) USAGE COMP    VALUE  7533.
005460     05  WK-806-7534-IDX   PIC S9(08) USAGE COMP    VALUE  7534.
005470     05  WK-806-7535-IDX   PIC S9(08) USAGE COMP    VALUE  7535.
005480     05  WK-806-7536-IDX   PIC S9(08) USAGE COMP    VALUE  7536.
005490     05  WK-806-7537-IDX   PIC S9(08) USAGE COMP    VALUE  7537.
005500     05  WK-806-7538-IDX   PIC S9(08) USAGE COMP    VALUE  7538.
005510     05  WK-806-7539-IDX   PIC S9(08) USAGE COMP    VALUE  7539.
005520     05  WK-806-7540-IDX   PIC S9(08) USAGE COMP    VALUE  7540.
005530     05  WK-806-7541-IDX   PIC S9(08) USAGE COMP    VALUE  7541.
005540     05  WK-806-7542-IDX   PIC S9(08) USAGE COMP    VALUE  7542.
005550     05  WK-806-7543-IDX   PIC S9(08) USAGE COMP    VALUE  7543.
005560     05  WK-806-7544-IDX   PIC S9(08) USAGE COMP    VALUE  7544.
005570     05  WK-806-7545-IDX   PIC S9(08) USAGE COMP    VALUE  7545.
005580     05  WK-806-7546-IDX   PIC S9(08) USAGE COMP    VALUE  7546.
005590     05  WK-806-7547-IDX   PIC S9(08) USAGE COMP    VALUE  7547.
005600     05  WK-806-7548-IDX   PIC S9(08) USAGE COMP    VALUE  7548.
005610     05  WK-806-7549-IDX   PIC S9(08) USAGE COMP    VALUE  7549.
005620     05  WK-806-7550-IDX   PIC S9(08) USAGE COMP    VALUE  7550.
005630     05  WK-806-7551-IDX   PIC S9(08) USAGE COMP    VALUE  7551.
005640     05  WK-806-7552-IDX   PIC S9(08) USAGE COMP    VALUE  7552.
005650     05  WK-806-7553-IDX   PIC S9(08) USAGE COMP    VALUE  7553.
005660     05  WK-806-7554-IDX   PIC S9(08) USAGE COMP    VALUE  7554.
005670     05  WK-806-7555-IDX   PIC S9(08) USAGE COMP    VALUE  7555.
005680     05  WK-806-7556-IDX   PIC S9(08) USAGE COMP    VALUE  7556.
005690     05  WK-806-7557-IDX   PIC S9(08) USAGE COMP    VALUE  7557.
005700     05  WK-806-7558-IDX   PIC S9(08) USAGE COMP    VALUE  7558.
005710     05  WK-806-7559-IDX   PIC S9(08) USAGE COMP    VALUE  7559.
005720     05  WK-806-7560-IDX   PIC S9(08) USAGE COMP    VALUE  7560.
005730     05  WK-806-7561-IDX   PIC S9(08) USAGE COMP    VALUE  7561.
005740     05  WK-806-7562-IDX   PIC S9(08) USAGE COMP    VALUE  7562.
005750     05  WK-806-7563-IDX   PIC S9(08) USAGE COMP    VALUE  7563.
005760     05  WK-806-7564-IDX   PIC S9(08) USAGE COMP    VALUE  7564.
005770     05  WK-806-7565-IDX   PIC S9(08) USAGE COMP    VALUE  7565.
005780     05  WK-806-7566-IDX   PIC S9(08) USAGE COMP    VALUE  7566.
005790     05  WK-806-7567-IDX   PIC S9(08) USAGE COMP    VALUE  7567.
005800     05  WK-806-7568-IDX   PIC S9(08) USAGE COMP    VALUE  7568.
005810     05  WK-806-7569-IDX   PIC S9(08) USAGE COMP    VALUE  7569.
005820     05  WK-806-7570-IDX   PIC S9(08) USAGE COMP    VALUE  7570.
005830     05  WK-806-7571-IDX   PIC S9(08) USAGE COMP    VALUE  7571.
005840     05  WK-806-7572-IDX   PIC S9(08) USAGE COMP    VALUE  7572.
005850     05  WK-806-7573-IDX   PIC S9(08) USAGE COMP    VALUE  7573.
005860     05  WK-806-7574-IDX   PIC S9(08) USAGE COMP    VALUE  7574.
005870     05  WK-806-7575-IDX   PIC S9(08) USAGE COMP    VALUE  7575.
005880     05  WK-806-7576-IDX   PIC S9(08) USAGE COMP    VALUE  7576.
005890     05  WK-806-7577-IDX   PIC S9(08) USAGE COMP    VALUE  7577.
005900     05  WK-806-7578-IDX   PIC S9(08) USAGE COMP    VALUE  7578.
005910     05  WK-806-7579-IDX   PIC S9(08) USAGE COMP    VALUE  7579.
005920     05  WK-806-7580-IDX   PIC S9(08) USAGE COMP    VALUE  7580.
005930     05  WK-806-7581-IDX   PIC S9(08) USAGE COMP    VALUE  7581.
005940     05  WK-806-7582-IDX   PIC S9(08) USAGE COMP    VALUE  7582.
005950     05  WK-806-7583-IDX   PIC S9(08) USAGE COMP    VALUE  7583.
005960     05  WK-806-7584-IDX   PIC S9(08) USAGE COMP    VALUE  7584.
005970     05  WK-806-7585-IDX   PIC S9(08) USAGE COMP    VALUE  7585.
005980     05  WK-806-7586-IDX   PIC S9(08) USAGE COMP    VALUE  7586.
005990     05  WK-806-7587-IDX   PIC S9(08) USAGE COMP    VALUE  7587.
006000     05  WK-806-7588-IDX   PIC S9(08) USAGE COMP    VALUE  7588.
006010     05  WK-806-7589-IDX   PIC S9(08) USAGE COMP    VALUE  7589.
006020     05  WK-806-7590-IDX   PIC S9(08) USAGE COMP    VALUE  7590.
006030     05  WK-806-7591-IDX   PIC S9(08) USAGE COMP    VALUE  7591.
006040     05  WK-806-7592-IDX   PIC S9(08) USAGE COMP    VALUE  7592.
006050     05  WK-806-7593-IDX   PIC S9(08) USAGE COMP    VALUE  7593.
006060     05  WK-806-7594-IDX   PIC S9(08) USAGE COMP    VALUE  7594.
006070     05  WK-806-7595-IDX   PIC S9(08) USAGE COMP    VALUE  7595.
006080     05  WK-806-7596-IDX   PIC S9(08) USAGE COMP    VALUE  7596.
006090     05  WK-806-7597-IDX   PIC S9(08) USAGE COMP    VALUE  7597.
006100     05  WK-806-7598-IDX   PIC S9(08) USAGE COMP    VALUE  7598.
006110     05  WK-806-7599-IDX   PIC S9(08) USAGE COMP    VALUE  7599.
006120     05  WK-806-7600-IDX   PIC S9(08) USAGE COMP    VALUE  7600.
006130     05  WK-806-7601-IDX   PIC S9(08) USAGE COMP    VALUE  7601.
006140     05  WK-806-7602-IDX   PIC S9(08) USAGE COMP    VALUE  7602.
006150     05  WK-806-7603-IDX   PIC S9(08) USAGE COMP    VALUE  7603.
006160     05  WK-806-7604-IDX   PIC S9(08) USAGE COMP    VALUE  7604.
006170     05  WK-806-7605-IDX   PIC S9(08) USAGE COMP    VALUE  7605.
006180     05  WK-806-7606-IDX   PIC S9(08) USAGE COMP    VALUE  7606.
006190     05  WK-806-7607-IDX   PIC S9(08) USAGE COMP    VALUE  7607.
006200     05  WK-806-7608-IDX   PIC S9(08) USAGE COMP    VALUE  7608.
006210     05  WK-806-7609-IDX   PIC S9(08) USAGE COMP    VALUE  7609.
006220     05  WK-806-7610-IDX   PIC S9(08) USAGE COMP    VALUE  7610.
006230     05  WK-806-7611-IDX   PIC S9(08) USAGE COMP    VALUE  7611.
006240     05  WK-806-7612-IDX   PIC S9(08) USAGE COMP    VALUE  7612.
006250     05  WK-806-7613-IDX   PIC S9(08) USAGE COMP    VALUE  7613.
006260     05  WK-806-7614-IDX   PIC S9(08) USAGE COMP    VALUE  7614.
006270     05  WK-806-7615-IDX   PIC S9(08) USAGE COMP    VALUE  7615.
006280     05  WK-806-7616-IDX   PIC S9(08) USAGE COMP    VALUE  7616.
006290     05  WK-806-7617-IDX   PIC S9(08) USAGE COMP    VALUE  7617.
006300     05  WK-806-7618-IDX   PIC S9(08) USAGE COMP    VALUE  7618.
006310     05  WK-806-7619-IDX   PIC S9(08) USAGE COMP    VALUE  7619.
006320     05  WK-806-7620-IDX   PIC S9(08) USAGE COMP    VALUE  7620.
006330     05  WK-806-7621-IDX   PIC S9(08) USAGE COMP    VALUE  7621.
006340     05  WK-806-7622-IDX   PIC S9(08) USAGE COMP    VALUE  7622.
006350     05  WK-806-7623-IDX   PIC S9(08) USAGE COMP    VALUE  7623.
006360     05  WK-806-7624-IDX   PIC S9(08) USAGE COMP    VALUE  7624.
006370     05  WK-806-7625-IDX   PIC S9(08) USAGE COMP    VALUE  7625.
006380     05  WK-806-7626-IDX   PIC S9(08) USAGE COMP    VALUE  7626.
006390     05  WK-806-7627-IDX   PIC S9(08) USAGE COMP    VALUE  7627.
006400     05  WK-806-7628-IDX   PIC S9(08) USAGE COMP    VALUE  7628.
006410     05  WK-806-7629-IDX   PIC S9(08) USAGE COMP    VALUE  7629.
006420     05  WK-806-7630-IDX   PIC S9(08) USAGE COMP    VALUE  7630.
006430     05  WK-806-7631-IDX   PIC S9(08) USAGE COMP    VALUE  7631.
006440     05  WK-806-7632-IDX   PIC S9(08) USAGE COMP    VALUE  7632.
006450     05  WK-806-7633-IDX   PIC S9(08) USAGE COMP    VALUE  7633.
006460     05  WK-806-7634-IDX   PIC S9(08) USAGE COMP    VALUE  7634.
006470     05  WK-806-7635-IDX   PIC S9(08) USAGE COMP    VALUE  7635.
006480     05  WK-806-7636-IDX   PIC S9(08) USAGE COMP    VALUE  7636.
006490     05  WK-806-7637-IDX   PIC S9(08) USAGE COMP    VALUE  7637.
006500     05  WK-806-7638-IDX   PIC S9(08) USAGE COMP    VALUE  7638.
006510     05  WK-806-7639-IDX   PIC S9(08) USAGE COMP    VALUE  7639.
006520     05  WK-806-7640-IDX   PIC S9(08) USAGE COMP    VALUE  7640.
006530     05  WK-806-7641-IDX   PIC S9(08) USAGE COMP    VALUE  7641.
006540     05  WK-806-7642-IDX   PIC S9(08) USAGE COMP    VALUE  7642.
006550     05  WK-806-7643-IDX   PIC S9(08) USAGE COMP    VALUE  7643.
006560     05  WK-806-7644-IDX   PIC S9(08) USAGE COMP    VALUE  7644.
006570     05  WK-806-7645-IDX   PIC S9(08) USAGE COMP    VALUE  7645.
006580     05  WK-806-7646-IDX   PIC S9(08) USAGE COMP    VALUE  7646.
006590     05  WK-806-7647-IDX   PIC S9(08) USAGE COMP    VALUE  7647.
006600     05  WK-806-7648-IDX   PIC S9(08) USAGE COMP    VALUE  7648.
006610     05  WK-806-7649-IDX   PIC S9(08) USAGE COMP    VALUE  7649.
006620     05  WK-806-7650-IDX   PIC S9(08) USAGE COMP    VALUE  7650.
006630     05  WK-806-7651-IDX   PIC S9(08) USAGE COMP    VALUE  7651.
006640     05  WK-806-7652-IDX   PIC S9(08) USAGE COMP    VALUE  7652.
006650     05  WK-806-7653-IDX   PIC S9(08) USAGE COMP    VALUE  7653.
006660     05  WK-806-7654-IDX   PIC S9(08) USAGE COMP    VALUE  7654.
006670     05  WK-806-7655-IDX   PIC S9(08) USAGE COMP    VALUE  7655.
006680     05  WK-806-7656-IDX   PIC S9(08) USAGE COMP    VALUE  7656.
006690     05  WK-806-7657-IDX   PIC S9(08) USAGE COMP    VALUE  7657.
006700     05  WK-806-7658-IDX   PIC S9(08) USAGE COMP    VALUE  7658.
006710     05  WK-806-7659-IDX   PIC S9(08) USAGE COMP    VALUE  7659.
006720     05  WK-806-7660-IDX   PIC S9(08) USAGE COMP    VALUE  7660.
006730     05  WK-806-7661-IDX   PIC S9(08) USAGE COMP    VALUE  7661.
006740     05  WK-806-7662-IDX   PIC S9(08) USAGE COMP    VALUE  7662.
006750     05  WK-806-7663-IDX   PIC S9(08) USAGE COMP    VALUE  7663.
006760     05  WK-806-7664-IDX   PIC S9(08) USAGE COMP    VALUE  7664.
006770     05  WK-806-7665-IDX   PIC S9(08) USAGE COMP    VALUE  7665.
006780     05  WK-806-7666-IDX   PIC S9(08) USAGE COMP    VALUE  7666.
006790     05  WK-806-7667-IDX   PIC S9(08) USAGE COMP    VALUE  7667.
006800     05  WK-806-7668-IDX   PIC S9(08) USAGE COMP    VALUE  7668.
006810     05  WK-806-7669-IDX   PIC S9(08) USAGE COMP    VALUE  7669.
006820     05  WK-806-7670-IDX   PIC S9(08) USAGE COMP    VALUE  7670.
006830     05  WK-806-7671-IDX   PIC S9(08) USAGE COMP    VALUE  7671.
006840     05  WK-806-7672-IDX   PIC S9(08) USAGE COMP    VALUE  7672.
006850     05  WK-806-7673-IDX   PIC S9(08) USAGE COMP    VALUE  7673.
006860     05  WK-806-7674-IDX   PIC S9(08) USAGE COMP    VALUE  7674.
006870     05  WK-806-7675-IDX   PIC S9(08) USAGE COMP    VALUE  7675.
006880     05  WK-806-7676-IDX   PIC S9(08) USAGE COMP    VALUE  7676.
006890     05  WK-806-7677-IDX   PIC S9(08) USAGE COMP    VALUE  7677.
006900     05  WK-806-7678-IDX   PIC S9(08) USAGE COMP    VALUE  7678.
006910     05  WK-806-7679-IDX   PIC S9(08) USAGE COMP    VALUE  7679.
006920     05  WK-806-7680-IDX   PIC S9(08) USAGE COMP    VALUE  7680.
006930     05  WK-806-7681-IDX   PIC S9(08) USAGE COMP    VALUE  7681.
006940     05  WK-806-7682-IDX   PIC S9(08) USAGE COMP    VALUE  7682.
006950     05  WK-806-7683-IDX   PIC S9(08) USAGE COMP    VALUE  7683.
006960     05  WK-806-7684-IDX   PIC S9(08) USAGE COMP    VALUE  7684.
006970     05  WK-806-7685-IDX   PIC S9(08) USAGE COMP    VALUE  7685.
006980     05  WK-806-7686-IDX   PIC S9(08) USAGE COMP    VALUE  7686.
006990     05  WK-806-7687-IDX   PIC S9(08) USAGE COMP    VALUE  7687.
007000     05  WK-806-7688-IDX   PIC S9(08) USAGE COMP    VALUE  7688.
007010     05  WK-806-7689-IDX   PIC S9(08) USAGE COMP    VALUE  7689.
007020     05  WK-806-7690-IDX   PIC S9(08) USAGE COMP    VALUE  7690.
007030     05  WK-806-7691-IDX   PIC S9(08) USAGE COMP    VALUE  7691.
007040     05  WK-806-7692-IDX   PIC S9(08) USAGE COMP    VALUE  7692.
007050     05  WK-806-7693-IDX   PIC S9(08) USAGE COMP    VALUE  7693.
007060     05  WK-806-7694-IDX   PIC S9(08) USAGE COMP    VALUE  7694.
007070     05  WK-806-7695-IDX   PIC S9(08) USAGE COMP    VALUE  7695.
007080     05  WK-806-7696-IDX   PIC S9(08) USAGE COMP    VALUE  7696.
007090     05  WK-806-7697-IDX   PIC S9(08) USAGE COMP    VALUE  7697.
007100     05  WK-806-7698-IDX   PIC S9(08) USAGE COMP    VALUE  7698.
007110     05  WK-806-7699-IDX   PIC S9(08) USAGE COMP    VALUE  7699.
007120     05  WK-806-7700-IDX   PIC S9(08) USAGE COMP    VALUE  7700.
007130     05  WK-806-7701-IDX   PIC S9(08) USAGE COMP    VALUE  7701.
007140     05  WK-806-7702-IDX   PIC S9(08) USAGE COMP    VALUE  7702.
007150     05  WK-806-7703-IDX   PIC S9(08) USAGE COMP    VALUE  7703.
007160     05  WK-806-7704-IDX   PIC S9(08) USAGE COMP    VALUE  7704.
007170     05  WK-806-7705-IDX   PIC S9(08) USAGE COMP    VALUE  7705.
007180     05  WK-806-7706-IDX   PIC S9(08) USAGE COMP    VALUE  7706.
007190     05  WK-806-7707-IDX   PIC S9(08) USAGE COMP    VALUE  7707.
007200     05  WK-806-7708-IDX   PIC S9(08) USAGE COMP    VALUE  7708.
007210     05  WK-806-7709-IDX   PIC S9(08) USAGE COMP    VALUE  7709.
007220     05  WK-806-7710-IDX   PIC S9(08) USAGE COMP    VALUE  7710.
007230     05  WK-806-7711-IDX   PIC S9(08) USAGE COMP    VALUE  7711.
007240     05  WK-806-7712-IDX   PIC S9(08) USAGE COMP    VALUE  7712.
007250     05  WK-806-7713-IDX   PIC S9(08) USAGE COMP    VALUE  7713.
007260     05  WK-806-7714-IDX   PIC S9(08) USAGE COMP    VALUE  7714.
007270     05  WK-806-7715-IDX   PIC S9(08) USAGE COMP    VALUE  7715.
007280     05  WK-806-7716-IDX   PIC S9(08) USAGE COMP    VALUE  7716.
007290     05  WK-806-7717-IDX   PIC S9(08) USAGE COMP    VALUE  7717.
007300     05  WK-806-7718-IDX   PIC S9(08) USAGE COMP    VALUE  7718.
007310     05  WK-806-7719-IDX   PIC S9(08) USAGE COMP    VALUE  7719.
007320     05  WK-806-7720-IDX   PIC S9(08) USAGE COMP    VALUE  7720.
007330     05  WK-806-7721-IDX   PIC S9(08) USAGE COMP    VALUE  7721.
007340     05  WK-806-7722-IDX   PIC S9(08) USAGE COMP    VALUE  7722.
007350     05  WK-806-7723-IDX   PIC S9(08) USAGE COMP    VALUE  7723.
007360     05  WK-806-7724-IDX   PIC S9(08) USAGE COMP    VALUE  7724.
007370     05  WK-806-7725-IDX   PIC S9(08) USAGE COMP    VALUE  7725.
007380     05  WK-806-7726-IDX   PIC S9(08) USAGE COMP    VALUE  7726.
007390     05  WK-806-7727-IDX   PIC S9(08) USAGE COMP    VALUE  7727.
007400     05  WK-806-7728-IDX   PIC S9(08) USAGE COMP    VALUE  7728.
007410     05  WK-806-7729-IDX   PIC S9(08) USAGE COMP    VALUE  7729.
007420     05  WK-806-7730-IDX   PIC S9(08) USAGE COMP    VALUE  7730.
007430     05  WK-806-7731-IDX   PIC S9(08) USAGE COMP    VALUE  7731.
007440     05  WK-806-7732-IDX   PIC S9(08) USAGE COMP    VALUE  7732.
007450     05  WK-806-7733-IDX   PIC S9(08) USAGE COMP    VALUE  7733.
007460     05  WK-806-7734-IDX   PIC S9(08) USAGE COMP    VALUE  7734.
007470     05  WK-806-7735-IDX   PIC S9(08) USAGE COMP    VALUE  7735.
007480     05  WK-806-7736-IDX   PIC S9(08) USAGE COMP    VALUE  7736.
007490     05  WK-806-7737-IDX   PIC S9(08) USAGE COMP    VALUE  7737.
007500     05  WK-806-7738-IDX   PIC S9(08) USAGE COMP    VALUE  7738.
007510     05  WK-806-7739-IDX   PIC S9(08) USAGE COMP    VALUE  7739.
007520     05  WK-806-7740-IDX   PIC S9(08) USAGE COMP    VALUE  7740.
007530     05  WK-806-7741-IDX   PIC S9(08) USAGE COMP    VALUE  7741.
007540     05  WK-806-7742-IDX   PIC S9(08) USAGE COMP    VALUE  7742.
007550     05  WK-806-7743-IDX   PIC S9(08) USAGE COMP    VALUE  7743.
007560     05  WK-806-7744-IDX   PIC S9(08) USAGE COMP    VALUE  7744.
007570     05  WK-806-7745-IDX   PIC S9(08) USAGE COMP    VALUE  7745.
007580     05  WK-806-7746-IDX   PIC S9(08) USAGE COMP    VALUE  7746.
007590     05  WK-806-7747-IDX   PIC S9(08) USAGE COMP    VALUE  7747.
007600     05  WK-806-7748-IDX   PIC S9(08) USAGE COMP    VALUE  7748.
007610     05  WK-806-7749-IDX   PIC S9(08) USAGE COMP    VALUE  7749.
007620     05  WK-806-7750-IDX   PIC S9(08) USAGE COMP    VALUE  7750.
007630     05  WK-806-7751-IDX   PIC S9(08) USAGE COMP    VALUE  7751.
007640     05  WK-806-7752-IDX   PIC S9(08) USAGE COMP    VALUE  7752.
007650     05  WK-806-7753-IDX   PIC S9(08) USAGE COMP    VALUE  7753.
007660     05  WK-806-7754-IDX   PIC S9(08) USAGE COMP    VALUE  7754.
007670     05  WK-806-7755-IDX   PIC S9(08) USAGE COMP    VALUE  7755.
007680     05  WK-806-7756-IDX   PIC S9(08) USAGE COMP    VALUE  7756.
007690     05  WK-806-7757-IDX   PIC S9(08) USAGE COMP    VALUE  7757.
007700     05  WK-806-7758-IDX   PIC S9(08) USAGE COMP    VALUE  7758.
007710     05  WK-806-7759-IDX   PIC S9(08) USAGE COMP    VALUE  7759.
007720     05  WK-806-7760-IDX   PIC S9(08) USAGE COMP    VALUE  7760.
007730     05  WK-806-7761-IDX   PIC S9(08) USAGE COMP    VALUE  7761.
007740     05  WK-806-7762-IDX   PIC S9(08) USAGE COMP    VALUE  7762.
007750     05  WK-806-7763-IDX   PIC S9(08) USAGE COMP    VALUE  7763.
007760     05  WK-806-7764-IDX   PIC S9(08) USAGE COMP    VALUE  7764.
007770     05  WK-806-7765-IDX   PIC S9(08) USAGE COMP    VALUE  7765.
007780     05  WK-806-7766-IDX   PIC S9(08) USAGE COMP    VALUE  7766.
007790     05  WK-806-7767-IDX   PIC S9(08) USAGE COMP    VALUE  7767.
007800     05  WK-806-7768-IDX   PIC S9(08) USAGE COMP    VALUE  7768.
007810     05  WK-806-7769-IDX   PIC S9(08) USAGE COMP    VALUE  7769.
007820     05  WK-806-7770-IDX   PIC S9(08) USAGE COMP    VALUE  7770.
007830     05  WK-806-7771-IDX   PIC S9(08) USAGE COMP    VALUE  7771.
007840     05  WK-806-7772-IDX   PIC S9(08) USAGE COMP    VALUE  7772.
007850     05  WK-806-7773-IDX   PIC S9(08) USAGE COMP    VALUE  7773.
007860     05  WK-806-7774-IDX   PIC S9(08) USAGE COMP    VALUE  7774.
007870     05  WK-806-7775-IDX   PIC S9(08) USAGE COMP    VALUE  7775.
007880     05  WK-806-7776-IDX   PIC S9(08) USAGE COMP    VALUE  7776.
007890     05  WK-806-7777-IDX   PIC S9(08) USAGE COMP    VALUE  7777.
007900     05  WK-806-7778-IDX   PIC S9(08) USAGE COMP    VALUE  7778.
007910     05  WK-806-7779-IDX   PIC S9(08) USAGE COMP    VALUE  7779.
007920     05  WK-806-7780-IDX   PIC S9(08) USAGE COMP    VALUE  7780.
007930     05  WK-806-7781-IDX   PIC S9(08) USAGE COMP    VALUE  7781.
007940     05  WK-806-7782-IDX   PIC S9(08) USAGE COMP    VALUE  7782.
007950     05  WK-806-7783-IDX   PIC S9(08) USAGE COMP    VALUE  7783.
007960     05  WK-806-7784-IDX   PIC S9(08) USAGE COMP    VALUE  7784.
007970     05  WK-806-7785-IDX   PIC S9(08) USAGE COMP    VALUE  7785.
007980     05  WK-806-7786-IDX   PIC S9(08) USAGE COMP    VALUE  7786.
007990     05  WK-806-7787-IDX   PIC S9(08) USAGE COMP    VALUE  7787.
008000     05  WK-806-7788-IDX   PIC S9(08) USAGE COMP    VALUE  7788.
008010     05  WK-806-7789-IDX   PIC S9(08) USAGE COMP    VALUE  7789.
008020     05  WK-806-7790-IDX   PIC S9(08) USAGE COMP    VALUE  7790.
008030     05  WK-806-7791-IDX   PIC S9(08) USAGE COMP    VALUE  7791.
008040     05  WK-806-7792-IDX   PIC S9(08) USAGE COMP    VALUE  7792.
008050     05  WK-806-7793-IDX   PIC S9(08) USAGE COMP    VALUE  7793.
008060     05  WK-806-7794-IDX   PIC S9(08) USAGE COMP    VALUE  7794.
008070     05  WK-806-7795-IDX   PIC S9(08) USAGE COMP    VALUE  7795.
008080     05  WK-806-7796-IDX   PIC S9(08) USAGE COMP    VALUE  7796.
008090     05  WK-806-7797-IDX   PIC S9(08) USAGE COMP    VALUE  7797.
008100     05  WK-806-7798-IDX   PIC S9(08) USAGE COMP    VALUE  7798.
008110     05  WK-806-7799-IDX   PIC S9(08) USAGE COMP    VALUE  7799.
008120     05  WK-806-7800-IDX   PIC S9(08) USAGE COMP    VALUE  7800.
008130     05  WK-806-7801-IDX   PIC S9(08) USAGE COMP    VALUE  7801.
008140     05  WK-806-7802-IDX   PIC S9(08) USAGE COMP    VALUE  7802.
008150     05  WK-806-7803-IDX   PIC S9(08) USAGE COMP    VALUE  7803.
008160     05  WK-806-7804-IDX   PIC S9(08) USAGE COMP    VALUE  7804.
008170     05  WK-806-7805-IDX   PIC S9(08) USAGE COMP    VALUE  7805.
008180     05  WK-806-7806-IDX   PIC S9(08) USAGE COMP    VALUE  7806.
008190     05  WK-806-7807-IDX   PIC S9(08) USAGE COMP    VALUE  7807.
008200     05  WK-806-7808-IDX   PIC S9(08) USAGE COMP    VALUE  7808.
008210     05  WK-806-7809-IDX   PIC S9(08) USAGE COMP    VALUE  7809.
008220     05  WK-806-7810-IDX   PIC S9(08) USAGE COMP    VALUE  7810.
008230     05  WK-806-7811-IDX   PIC S9(08) USAGE COMP    VALUE  7811.
008240     05  WK-806-7812-IDX   PIC S9(08) USAGE COMP    VALUE  7812.
008250     05  WK-806-7813-IDX   PIC S9(08) USAGE COMP    VALUE  7813.
008260     05  WK-806-7814-IDX   PIC S9(08) USAGE COMP    VALUE  7814.
008270     05  WK-806-7815-IDX   PIC S9(08) USAGE COMP    VALUE  7815.
008280     05  WK-806-7816-IDX   PIC S9(08) USAGE COMP    VALUE  7816.
008290     05  WK-806-7817-IDX   PIC S9(08) USAGE COMP    VALUE  7817.
008300     05  WK-806-7818-IDX   PIC S9(08) USAGE COMP    VALUE  7818.
008310     05  WK-806-7819-IDX   PIC S9(08) USAGE COMP    VALUE  7819.
008320     05  WK-806-7820-IDX   PIC S9(08) USAGE COMP    VALUE  7820.
008330     05  WK-806-7821-IDX   PIC S9(08) USAGE COMP    VALUE  7821.
008340     05  WK-806-7822-IDX   PIC S9(08) USAGE COMP    VALUE  7822.
008350     05  WK-806-7823-IDX   PIC S9(08) USAGE COMP    VALUE  7823.
008360     05  WK-806-7824-IDX   PIC S9(08) USAGE COMP    VALUE  7824.
008370     05  WK-806-7825-IDX   PIC S9(08) USAGE COMP    VALUE  7825.
008380     05  WK-806-7826-IDX   PIC S9(08) USAGE COMP    VALUE  7826.
008390     05  WK-806-7827-IDX   PIC S9(08) USAGE COMP    VALUE  7827.
008400     05  WK-806-7828-IDX   PIC S9(08) USAGE COMP    VALUE  7828.
008410     05  WK-806-7829-IDX   PIC S9(08) USAGE COMP    VALUE  7829.
008420     05  WK-806-7830-IDX   PIC S9(08) USAGE COMP    VALUE  7830.
008430     05  WK-806-7831-IDX   PIC S9(08) USAGE COMP    VALUE  7831.
008440     05  WK-806-7832-IDX   PIC S9(08) USAGE COMP    VALUE  7832.
008450     05  WK-806-7833-IDX   PIC S9(08) USAGE COMP    VALUE  7833.
008460     05  WK-806-7834-IDX   PIC S9(08) USAGE COMP    VALUE  7834.
008470     05  WK-806-7835-IDX   PIC S9(08) USAGE COMP    VALUE  7835.
008480     05  WK-806-7836-IDX   PIC S9(08) USAGE COMP    VALUE  7836.
008490     05  WK-806-7837-IDX   PIC S9(08) USAGE COMP    VALUE  7837.
008500     05  WK-806-7838-IDX   PIC S9(08) USAGE COMP    VALUE  7838.
008510     05  WK-806-7839-IDX   PIC S9(08) USAGE COMP    VALUE  7839.
008520     05  WK-806-7840-IDX   PIC S9(08) USAGE COMP    VALUE  7840.
008530     05  WK-806-7841-IDX   PIC S9(08) USAGE COMP    VALUE  7841.
008540     05  WK-806-7842-IDX   PIC S9(08) USAGE COMP    VALUE  7842.
008550     05  WK-806-7843-IDX   PIC S9(08) USAGE COMP    VALUE  7843.
008560     05  WK-806-7844-IDX   PIC S9(08) USAGE COMP    VALUE  7844.
008570     05  WK-806-7845-IDX   PIC S9(08) USAGE COMP    VALUE  7845.
008580     05  WK-806-7846-IDX   PIC S9(08) USAGE COMP    VALUE  7846.
008590     05  WK-806-7847-IDX   PIC S9(08) USAGE COMP    VALUE  7847.
008600     05  WK-806-7848-IDX   PIC S9(08) USAGE COMP    VALUE  7848.
008610     05  WK-806-7849-IDX   PIC S9(08) USAGE COMP    VALUE  7849.
008620     05  WK-806-7850-IDX   PIC S9(08) USAGE COMP    VALUE  7850.
008630     05  WK-806-7851-IDX   PIC S9(08) USAGE COMP    VALUE  7851.
008640     05  WK-806-7852-IDX   PIC S9(08) USAGE COMP    VALUE  7852.
008650     05  WK-806-7853-IDX   PIC S9(08) USAGE COMP    VALUE  7853.
008660     05  WK-806-7854-IDX   PIC S9(08) USAGE COMP    VALUE  7854.
008670     05  WK-806-7855-IDX   PIC S9(08) USAGE COMP    VALUE  7855.
008680     05  WK-806-7856-IDX   PIC S9(08) USAGE COMP    VALUE  7856.
008690     05  WK-806-7857-IDX   PIC S9(08) USAGE COMP    VALUE  7857.
008700     05  WK-806-7858-IDX   PIC S9(08) USAGE COMP    VALUE  7858.
008710     05  WK-806-7859-IDX   PIC S9(08) USAGE COMP    VALUE  7859.
008720     05  WK-806-7860-IDX   PIC S9(08) USAGE COMP    VALUE  7860.
008730     05  WK-806-7861-IDX   PIC S9(08) USAGE COMP    VALUE  7861.
008740     05  WK-806-7862-IDX   PIC S9(08) USAGE COMP    VALUE  7862.
008750     05  WK-806-7863-IDX   PIC S9(08) USAGE COMP    VALUE  7863.
008760     05  WK-806-7864-IDX   PIC S9(08) USAGE COMP    VALUE  7864.
008770     05  WK-806-7865-IDX   PIC S9(08) USAGE COMP    VALUE  7865.
008780     05  WK-806-7866-IDX   PIC S9(08) USAGE COMP    VALUE  7866.
008790     05  WK-806-7867-IDX   PIC S9(08) USAGE COMP    VALUE  7867.
008800     05  WK-806-7868-IDX   PIC S9(08) USAGE COMP    VALUE  7868.
008810     05  WK-806-7869-IDX   PIC S9(08) USAGE COMP    VALUE  7869.
008820     05  WK-806-7870-IDX   PIC S9(08) USAGE COMP    VALUE  7870.
008830     05  WK-806-7871-IDX   PIC S9(08) USAGE COMP    VALUE  7871.
008840     05  WK-806-7872-IDX   PIC S9(08) USAGE COMP    VALUE  7872.
008850     05  WK-806-7873-IDX   PIC S9(08) USAGE COMP    VALUE  7873.
008860     05  WK-806-7874-IDX   PIC S9(08) USAGE COMP    VALUE  7874.
008870     05  WK-806-7875-IDX   PIC S9(08) USAGE COMP    VALUE  7875.
008880     05  WK-806-7876-IDX   PIC S9(08) USAGE COMP    VALUE  7876.
008890     05  WK-806-7877-IDX   PIC S9(08) USAGE COMP    VALUE  7877.
008900     05  WK-806-7878-IDX   PIC S9(08) USAGE COMP    VALUE  7878.
008910     05  WK-806-7879-IDX   PIC S9(08) USAGE COMP    VALUE  7879.
008920     05  WK-806-7880-IDX   PIC S9(08) USAGE COMP    VALUE  7880.
008930     05  WK-806-7881-IDX   PIC S9(08) USAGE COMP    VALUE  7881.
008940     05  WK-806-7882-IDX   PIC S9(08) USAGE COMP    VALUE  7882.
008950     05  WK-806-7883-IDX   PIC S9(08) USAGE COMP    VALUE  7883.
008960     05  WK-806-7884-IDX   PIC S9(08) USAGE COMP    VALUE  7884.
008970     05  WK-806-7885-IDX   PIC S9(08) USAGE COMP    VALUE  7885.
008980     05  WK-806-7886-IDX   PIC S9(08) USAGE COMP    VALUE  7886.
008990     05  WK-806-7887-IDX   PIC S9(08) USAGE COMP    VALUE  7887.
009000     05  WK-806-7888-IDX   PIC S9(08) USAGE COMP    VALUE  7888.
009010     05  WK-806-7889-IDX   PIC S9(08) USAGE COMP    VALUE  7889.
009020     05  WK-806-7890-IDX   PIC S9(08) USAGE COMP    VALUE  7890.
009030     05  WK-806-7891-IDX   PIC S9(08) USAGE COMP    VALUE  7891.
009040     05  WK-806-7892-IDX   PIC S9(08) USAGE COMP    VALUE  7892.
009050     05  WK-806-7893-IDX   PIC S9(08) USAGE COMP    VALUE  7893.
009060     05  WK-806-7894-IDX   PIC S9(08) USAGE COMP    VALUE  7894.
009070     05  WK-806-7895-IDX   PIC S9(08) USAGE COMP    VALUE  7895.
009080     05  WK-806-7896-IDX   PIC S9(08) USAGE COMP    VALUE  7896.
009090     05  WK-806-7897-IDX   PIC S9(08) USAGE COMP    VALUE  7897.
009100     05  WK-806-7898-IDX   PIC S9(08) USAGE COMP    VALUE  7898.
009110     05  WK-806-7899-IDX   PIC S9(08) USAGE COMP    VALUE  7899.
009120     05  WK-806-7900-IDX   PIC S9(08) USAGE COMP    VALUE  7900.
009130     05  WK-806-7901-IDX   PIC S9(08) USAGE COMP    VALUE  7901.
009140     05  WK-806-7902-IDX   PIC S9(08) USAGE COMP    VALUE  7902.
009150     05  WK-806-7903-IDX   PIC S9(08) USAGE COMP    VALUE  7903.
009160     05  WK-806-7904-IDX   PIC S9(08) USAGE COMP    VALUE  7904.
009170     05  WK-806-7905-IDX   PIC S9(08) USAGE COMP    VALUE  7905.
009180     05  WK-806-7906-IDX   PIC S9(08) USAGE COMP    VALUE  7906.
009190     05  WK-806-7907-IDX   PIC S9(08) USAGE COMP    VALUE  7907.
009200     05  WK-806-7908-IDX   PIC S9(08) USAGE COMP    VALUE  7908.
009210     05  WK-806-7909-IDX   PIC S9(08) USAGE COMP    VALUE  7909.
009220     05  WK-806-7910-IDX   PIC S9(08) USAGE COMP    VALUE  7910.
009230     05  WK-806-7911-IDX   PIC S9(08) USAGE COMP    VALUE  7911.
009240     05  WK-806-7912-IDX   PIC S9(08) USAGE COMP    VALUE  7912.
009250     05  WK-806-7913-IDX   PIC S9(08) USAGE COMP    VALUE  7913.
009260     05  WK-806-7914-IDX   PIC S9(08) USAGE COMP    VALUE  7914.
009270     05  WK-806-7915-IDX   PIC S9(08) USAGE COMP    VALUE  7915.
009280     05  WK-806-7916-IDX   PIC S9(08) USAGE COMP    VALUE  7916.
009290     05  WK-806-7917-IDX   PIC S9(08) USAGE COMP    VALUE  7917.
009300     05  WK-806-7918-IDX   PIC S9(08) USAGE COMP    VALUE  7918.
009310     05  WK-806-7919-IDX   PIC S9(08) USAGE COMP    VALUE  7919.
009320     05  WK-806-7920-IDX   PIC S9(08) USAGE COMP    VALUE  7920.
009330     05  WK-806-7921-IDX   PIC S9(08) USAGE COMP    VALUE  7921.
009340     05  WK-806-7922-IDX   PIC S9(08) USAGE COMP    VALUE  7922.
009350     05  WK-806-7923-IDX   PIC S9(08) USAGE COMP    VALUE  7923.
009360     05  WK-806-7924-IDX   PIC S9(08) USAGE COMP    VALUE  7924.
009370     05  WK-806-7925-IDX   PIC S9(08) USAGE COMP    VALUE  7925.
009380     05  WK-806-7926-IDX   PIC S9(08) USAGE COMP    VALUE  7926.
009390     05  WK-806-7927-IDX   PIC S9(08) USAGE COMP    VALUE  7927.
009400     05  WK-806-7928-IDX   PIC S9(08) USAGE COMP    VALUE  7928.
009410     05  WK-806-7929-IDX   PIC S9(08) USAGE COMP    VALUE  7929.
009420     05  WK-806-7930-IDX   PIC S9(08) USAGE COMP    VALUE  7930.
009430     05  WK-806-7931-IDX   PIC S9(08) USAGE COMP    VALUE  7931.
009440     05  WK-806-7932-IDX   PIC S9(08) USAGE COMP    VALUE  7932.
009450     05  WK-806-7933-IDX   PIC S9(08) USAGE COMP    VALUE  7933.
009460     05  WK-806-7934-IDX   PIC S9(08) USAGE COMP    VALUE  7934.
009470     05  WK-806-7935-IDX   PIC S9(08) USAGE COMP    VALUE  7935.
009480     05  WK-806-7936-IDX   PIC S9(08) USAGE COMP    VALUE  7936.
009490     05  WK-806-7937-IDX   PIC S9(08) USAGE COMP    VALUE  7937.
009500     05  WK-806-7938-IDX   PIC S9(08) USAGE COMP    VALUE  7938.
009510     05  WK-806-7939-IDX   PIC S9(08) USAGE COMP    VALUE  7939.
009520     05  WK-806-7940-IDX   PIC S9(08) USAGE COMP    VALUE  7940.
009530     05  WK-806-7941-IDX   PIC S9(08) USAGE COMP    VALUE  7941.
009540     05  WK-806-7942-IDX   PIC S9(08) USAGE COMP    VALUE  7942.
009550     05  WK-806-7943-IDX   PIC S9(08) USAGE COMP    VALUE  7943.
009560     05  WK-806-7944-IDX   PIC S9(08) USAGE COMP    VALUE  7944.
009570     05  WK-806-7945-IDX   PIC S9(08) USAGE COMP    VALUE  7945.
009580     05  WK-806-7946-IDX   PIC S9(08) USAGE COMP    VALUE  7946.
009590     05  WK-806-7947-IDX   PIC S9(08) USAGE COMP    VALUE  7947.
009600     05  WK-806-7948-IDX   PIC S9(08) USAGE COMP    VALUE  7948.
009610     05  WK-806-7949-IDX   PIC S9(08) USAGE COMP    VALUE  7949.
009620     05  WK-806-7950-IDX   PIC S9(08) USAGE COMP    VALUE  7950.
009630     05  WK-806-7951-IDX   PIC S9(08) USAGE COMP    VALUE  7951.
009640     05  WK-806-7952-IDX   PIC S9(08) USAGE COMP    VALUE  7952.
009650     05  WK-806-7953-IDX   PIC S9(08) USAGE COMP    VALUE  7953.
009660     05  WK-806-7954-IDX   PIC S9(08) USAGE COMP    VALUE  7954.
009670     05  WK-806-7955-IDX   PIC S9(08) USAGE COMP    VALUE  7955.
009680     05  WK-806-7956-IDX   PIC S9(08) USAGE COMP    VALUE  7956.
009690     05  WK-806-7957-IDX   PIC S9(08) USAGE COMP    VALUE  7957.
009700     05  WK-806-7958-IDX   PIC S9(08) USAGE COMP    VALUE  7958.
009710     05  WK-806-7959-IDX   PIC S9(08) USAGE COMP    VALUE  7959.
009720     05  WK-806-7960-IDX   PIC S9(08) USAGE COMP    VALUE  7960.
009730     05  WK-806-7961-IDX   PIC S9(08) USAGE COMP    VALUE  7961.
009740     05  WK-806-7962-IDX   PIC S9(08) USAGE COMP    VALUE  7962.
009750     05  WK-806-7963-IDX   PIC S9(08) USAGE COMP    VALUE  7963.
009760     05  WK-806-7964-IDX   PIC S9(08) USAGE COMP    VALUE  7964.
009770     05  WK-806-7965-IDX   PIC S9(08) USAGE COMP    VALUE  7965.
009780     05  WK-806-7966-IDX   PIC S9(08) USAGE COMP    VALUE  7966.
009790     05  WK-806-7967-IDX   PIC S9(08) USAGE COMP    VALUE  7967.
009800     05  WK-806-7968-IDX   PIC S9(08) USAGE COMP    VALUE  7968.
009810     05  WK-806-7969-IDX   PIC S9(08) USAGE COMP    VALUE  7969.
009820     05  WK-806-7970-IDX   PIC S9(08) USAGE COMP    VALUE  7970.
009830     05  WK-806-7971-IDX   PIC S9(08) USAGE COMP    VALUE  7971.
009840     05  WK-806-7972-IDX   PIC S9(08) USAGE COMP    VALUE  7972.
009850     05  WK-806-7973-IDX   PIC S9(08) USAGE COMP    VALUE  7973.
009860     05  WK-806-7974-IDX   PIC S9(08) USAGE COMP    VALUE  7974.
009870     05  WK-806-7975-IDX   PIC S9(08) USAGE COMP    VALUE  7975.
009880     05  WK-806-7976-IDX   PIC S9(08) USAGE COMP    VALUE  7976.
009890     05  WK-806-7977-IDX   PIC S9(08) USAGE COMP    VALUE  7977.
009900     05  WK-806-7978-IDX   PIC S9(08) USAGE COMP    VALUE  7978.
009910     05  WK-806-7979-IDX   PIC S9(08) USAGE COMP    VALUE  7979.
009920     05  WK-806-7980-IDX   PIC S9(08) USAGE COMP    VALUE  7980.
009930     05  WK-806-7981-IDX   PIC S9(08) USAGE COMP    VALUE  7981.
009940     05  WK-806-7982-IDX   PIC S9(08) USAGE COMP    VALUE  7982.
009950     05  WK-806-7983-IDX   PIC S9(08) USAGE COMP    VALUE  7983.
009960     05  WK-806-7984-IDX   PIC S9(08) USAGE COMP    VALUE  7984.
009970     05  WK-806-7985-IDX   PIC S9(08) USAGE COMP    VALUE  7985.
009980     05  WK-806-7986-IDX   PIC S9(08) USAGE COMP    VALUE  7986.
009990     05  WK-806-7987-IDX   PIC S9(08) USAGE COMP    VALUE  7987.
010000     05  WK-806-7988-IDX   PIC S9(08) USAGE COMP    VALUE  7988.
010010     05  WK-806-7989-IDX   PIC S9(08) USAGE COMP    VALUE  7989.
010020     05  WK-806-7990-IDX   PIC S9(08) USAGE COMP    VALUE  7990.
010030     05  WK-806-7991-IDX   PIC S9(08) USAGE COMP    VALUE  7991.
010040     05  WK-806-7992-IDX   PIC S9(08) USAGE COMP    VALUE  7992.
010050     05  WK-806-7993-IDX   PIC S9(08) USAGE COMP    VALUE  7993.
010060     05  WK-806-7994-IDX   PIC S9(08) USAGE COMP    VALUE  7994.
010070     05  WK-806-7995-IDX   PIC S9(08) USAGE COMP    VALUE  7995.
010080     05  WK-806-7996-IDX   PIC S9(08) USAGE COMP    VALUE  7996.
010090     05  WK-806-7997-IDX   PIC S9(08) USAGE COMP    VALUE  7997.
010100     05  WK-806-7998-IDX   PIC S9(08) USAGE COMP    VALUE  7998.
010110     05  WK-806-7999-IDX   PIC S9(08) USAGE COMP    VALUE  7999.
010110     05  WK-806-8000-IDX   PIC S9(08) USAGE COMP    VALUE  8000.
000130     05  WK-806-8001-IDX   PIC S9(08) USAGE COMP    VALUE  8001.
000140     05  WK-806-8002-IDX   PIC S9(08) USAGE COMP    VALUE  8002.
000150     05  WK-806-8003-IDX   PIC S9(08) USAGE COMP    VALUE  8003.
000160     05  WK-806-8004-IDX   PIC S9(08) USAGE COMP    VALUE  8004.
000170     05  WK-806-8005-IDX   PIC S9(08) USAGE COMP    VALUE  8005.
000180     05  WK-806-8006-IDX   PIC S9(08) USAGE COMP    VALUE  8006.
000190     05  WK-806-8007-IDX   PIC S9(08) USAGE COMP    VALUE  8007.
000200     05  WK-806-8008-IDX   PIC S9(08) USAGE COMP    VALUE  8008.
000210     05  WK-806-8009-IDX   PIC S9(08) USAGE COMP    VALUE  8009.
000220     05  WK-806-8010-IDX   PIC S9(08) USAGE COMP    VALUE  8010.
000230     05  WK-806-8011-IDX   PIC S9(08) USAGE COMP    VALUE  8011.
000240     05  WK-806-8012-IDX   PIC S9(08) USAGE COMP    VALUE  8012.
000250     05  WK-806-8013-IDX   PIC S9(08) USAGE COMP    VALUE  8013.
000260     05  WK-806-8014-IDX   PIC S9(08) USAGE COMP    VALUE  8014.
000270     05  WK-806-8015-IDX   PIC S9(08) USAGE COMP    VALUE  8015.
000280     05  WK-806-8016-IDX   PIC S9(08) USAGE COMP    VALUE  8016.
000290     05  WK-806-8017-IDX   PIC S9(08) USAGE COMP    VALUE  8017.
000300     05  WK-806-8018-IDX   PIC S9(08) USAGE COMP    VALUE  8018.
000310     05  WK-806-8019-IDX   PIC S9(08) USAGE COMP    VALUE  8019.
000320     05  WK-806-8020-IDX   PIC S9(08) USAGE COMP    VALUE  8020.
000330     05  WK-806-8021-IDX   PIC S9(08) USAGE COMP    VALUE  8021.
000340     05  WK-806-8022-IDX   PIC S9(08) USAGE COMP    VALUE  8022.
000350     05  WK-806-8023-IDX   PIC S9(08) USAGE COMP    VALUE  8023.
000360     05  WK-806-8024-IDX   PIC S9(08) USAGE COMP    VALUE  8024.
000370     05  WK-806-8025-IDX   PIC S9(08) USAGE COMP    VALUE  8025.
000380     05  WK-806-8026-IDX   PIC S9(08) USAGE COMP    VALUE  8026.
000390     05  WK-806-8027-IDX   PIC S9(08) USAGE COMP    VALUE  8027.
000400     05  WK-806-8028-IDX   PIC S9(08) USAGE COMP    VALUE  8028.
000410     05  WK-806-8029-IDX   PIC S9(08) USAGE COMP    VALUE  8029.
000420     05  WK-806-8030-IDX   PIC S9(08) USAGE COMP    VALUE  8030.
000430     05  WK-806-8031-IDX   PIC S9(08) USAGE COMP    VALUE  8031.
000440     05  WK-806-8032-IDX   PIC S9(08) USAGE COMP    VALUE  8032.
000450     05  WK-806-8033-IDX   PIC S9(08) USAGE COMP    VALUE  8033.
000460     05  WK-806-8034-IDX   PIC S9(08) USAGE COMP    VALUE  8034.
000470     05  WK-806-8035-IDX   PIC S9(08) USAGE COMP    VALUE  8035.
000480     05  WK-806-8036-IDX   PIC S9(08) USAGE COMP    VALUE  8036.
000490     05  WK-806-8037-IDX   PIC S9(08) USAGE COMP    VALUE  8037.
000500     05  WK-806-8038-IDX   PIC S9(08) USAGE COMP    VALUE  8038.
000510     05  WK-806-8039-IDX   PIC S9(08) USAGE COMP    VALUE  8039.
000520     05  WK-806-8040-IDX   PIC S9(08) USAGE COMP    VALUE  8040.
000530     05  WK-806-8041-IDX   PIC S9(08) USAGE COMP    VALUE  8041.
000540     05  WK-806-8042-IDX   PIC S9(08) USAGE COMP    VALUE  8042.
000550     05  WK-806-8043-IDX   PIC S9(08) USAGE COMP    VALUE  8043.
000560     05  WK-806-8044-IDX   PIC S9(08) USAGE COMP    VALUE  8044.
000570     05  WK-806-8045-IDX   PIC S9(08) USAGE COMP    VALUE  8045.
000580     05  WK-806-8046-IDX   PIC S9(08) USAGE COMP    VALUE  8046.
000590     05  WK-806-8047-IDX   PIC S9(08) USAGE COMP    VALUE  8047.
000600     05  WK-806-8048-IDX   PIC S9(08) USAGE COMP    VALUE  8048.
000610     05  WK-806-8049-IDX   PIC S9(08) USAGE COMP    VALUE  8049.
000620     05  WK-806-8050-IDX   PIC S9(08) USAGE COMP    VALUE  8050.
000630     05  WK-806-8051-IDX   PIC S9(08) USAGE COMP    VALUE  8051.
000640     05  WK-806-8052-IDX   PIC S9(08) USAGE COMP    VALUE  8052.
000650     05  WK-806-8053-IDX   PIC S9(08) USAGE COMP    VALUE  8053.
000660     05  WK-806-8054-IDX   PIC S9(08) USAGE COMP    VALUE  8054.
000670     05  WK-806-8055-IDX   PIC S9(08) USAGE COMP    VALUE  8055.
000680     05  WK-806-8056-IDX   PIC S9(08) USAGE COMP    VALUE  8056.
000690     05  WK-806-8057-IDX   PIC S9(08) USAGE COMP    VALUE  8057.
000700     05  WK-806-8058-IDX   PIC S9(08) USAGE COMP    VALUE  8058.
000710     05  WK-806-8059-IDX   PIC S9(08) USAGE COMP    VALUE  8059.
000720     05  WK-806-8060-IDX   PIC S9(08) USAGE COMP    VALUE  8060.
000730     05  WK-806-8061-IDX   PIC S9(08) USAGE COMP    VALUE  8061.
000740     05  WK-806-8062-IDX   PIC S9(08) USAGE COMP    VALUE  8062.
000750     05  WK-806-8063-IDX   PIC S9(08) USAGE COMP    VALUE  8063.
000760     05  WK-806-8064-IDX   PIC S9(08) USAGE COMP    VALUE  8064.
000770     05  WK-806-8065-IDX   PIC S9(08) USAGE COMP    VALUE  8065.
000780     05  WK-806-8066-IDX   PIC S9(08) USAGE COMP    VALUE  8066.
000790     05  WK-806-8067-IDX   PIC S9(08) USAGE COMP    VALUE  8067.
000800     05  WK-806-8068-IDX   PIC S9(08) USAGE COMP    VALUE  8068.
000810     05  WK-806-8069-IDX   PIC S9(08) USAGE COMP    VALUE  8069.
000820     05  WK-806-8070-IDX   PIC S9(08) USAGE COMP    VALUE  8070.
000830     05  WK-806-8071-IDX   PIC S9(08) USAGE COMP    VALUE  8071.
000840     05  WK-806-8072-IDX   PIC S9(08) USAGE COMP    VALUE  8072.
000850     05  WK-806-8073-IDX   PIC S9(08) USAGE COMP    VALUE  8073.
000860     05  WK-806-8074-IDX   PIC S9(08) USAGE COMP    VALUE  8074.
000870     05  WK-806-8075-IDX   PIC S9(08) USAGE COMP    VALUE  8075.
000880     05  WK-806-8076-IDX   PIC S9(08) USAGE COMP    VALUE  8076.
000890     05  WK-806-8077-IDX   PIC S9(08) USAGE COMP    VALUE  8077.
000900     05  WK-806-8078-IDX   PIC S9(08) USAGE COMP    VALUE  8078.
000910     05  WK-806-8079-IDX   PIC S9(08) USAGE COMP    VALUE  8079.
000920     05  WK-806-8080-IDX   PIC S9(08) USAGE COMP    VALUE  8080.
000930     05  WK-806-8081-IDX   PIC S9(08) USAGE COMP    VALUE  8081.
000940     05  WK-806-8082-IDX   PIC S9(08) USAGE COMP    VALUE  8082.
000950     05  WK-806-8083-IDX   PIC S9(08) USAGE COMP    VALUE  8083.
000960     05  WK-806-8084-IDX   PIC S9(08) USAGE COMP    VALUE  8084.
000970     05  WK-806-8085-IDX   PIC S9(08) USAGE COMP    VALUE  8085.
000980     05  WK-806-8086-IDX   PIC S9(08) USAGE COMP    VALUE  8086.
000990     05  WK-806-8087-IDX   PIC S9(08) USAGE COMP    VALUE  8087.
001000     05  WK-806-8088-IDX   PIC S9(08) USAGE COMP    VALUE  8088.
001010     05  WK-806-8089-IDX   PIC S9(08) USAGE COMP    VALUE  8089.
001020     05  WK-806-8090-IDX   PIC S9(08) USAGE COMP    VALUE  8090.
001030     05  WK-806-8091-IDX   PIC S9(08) USAGE COMP    VALUE  8091.
001040     05  WK-806-8092-IDX   PIC S9(08) USAGE COMP    VALUE  8092.
001050     05  WK-806-8093-IDX   PIC S9(08) USAGE COMP    VALUE  8093.
001060     05  WK-806-8094-IDX   PIC S9(08) USAGE COMP    VALUE  8094.
001070     05  WK-806-8095-IDX   PIC S9(08) USAGE COMP    VALUE  8095.
001080     05  WK-806-8096-IDX   PIC S9(08) USAGE COMP    VALUE  8096.
001090     05  WK-806-8097-IDX   PIC S9(08) USAGE COMP    VALUE  8097.
001100     05  WK-806-8098-IDX   PIC S9(08) USAGE COMP    VALUE  8098.
001110     05  WK-806-8099-IDX   PIC S9(08) USAGE COMP    VALUE  8099.
001120     05  WK-806-8100-IDX   PIC S9(08) USAGE COMP    VALUE  8100.
001130     05  WK-806-8101-IDX   PIC S9(08) USAGE COMP    VALUE  8101.
001140     05  WK-806-8102-IDX   PIC S9(08) USAGE COMP    VALUE  8102.
001150     05  WK-806-8103-IDX   PIC S9(08) USAGE COMP    VALUE  8103.
001160     05  WK-806-8104-IDX   PIC S9(08) USAGE COMP    VALUE  8104.
001170     05  WK-806-8105-IDX   PIC S9(08) USAGE COMP    VALUE  8105.
001180     05  WK-806-8106-IDX   PIC S9(08) USAGE COMP    VALUE  8106.
001190     05  WK-806-8107-IDX   PIC S9(08) USAGE COMP    VALUE  8107.
001200     05  WK-806-8108-IDX   PIC S9(08) USAGE COMP    VALUE  8108.
001210     05  WK-806-8109-IDX   PIC S9(08) USAGE COMP    VALUE  8109.
001220     05  WK-806-8110-IDX   PIC S9(08) USAGE COMP    VALUE  8110.
001230     05  WK-806-8111-IDX   PIC S9(08) USAGE COMP    VALUE  8111.
001240     05  WK-806-8112-IDX   PIC S9(08) USAGE COMP    VALUE  8112.
001250     05  WK-806-8113-IDX   PIC S9(08) USAGE COMP    VALUE  8113.
001260     05  WK-806-8114-IDX   PIC S9(08) USAGE COMP    VALUE  8114.
001270     05  WK-806-8115-IDX   PIC S9(08) USAGE COMP    VALUE  8115.
001280     05  WK-806-8116-IDX   PIC S9(08) USAGE COMP    VALUE  8116.
001290     05  WK-806-8117-IDX   PIC S9(08) USAGE COMP    VALUE  8117.
001300     05  WK-806-8118-IDX   PIC S9(08) USAGE COMP    VALUE  8118.
001310     05  WK-806-8119-IDX   PIC S9(08) USAGE COMP    VALUE  8119.
001320     05  WK-806-8120-IDX   PIC S9(08) USAGE COMP    VALUE  8120.
001330     05  WK-806-8121-IDX   PIC S9(08) USAGE COMP    VALUE  8121.
001340     05  WK-806-8122-IDX   PIC S9(08) USAGE COMP    VALUE  8122.
001350     05  WK-806-8123-IDX   PIC S9(08) USAGE COMP    VALUE  8123.
001360     05  WK-806-8124-IDX   PIC S9(08) USAGE COMP    VALUE  8124.
001370     05  WK-806-8125-IDX   PIC S9(08) USAGE COMP    VALUE  8125.
001380     05  WK-806-8126-IDX   PIC S9(08) USAGE COMP    VALUE  8126.
001390     05  WK-806-8127-IDX   PIC S9(08) USAGE COMP    VALUE  8127.
001400     05  WK-806-8128-IDX   PIC S9(08) USAGE COMP    VALUE  8128.
001410     05  WK-806-8129-IDX   PIC S9(08) USAGE COMP    VALUE  8129.
001420     05  WK-806-8130-IDX   PIC S9(08) USAGE COMP    VALUE  8130.
001430     05  WK-806-8131-IDX   PIC S9(08) USAGE COMP    VALUE  8131.
001440     05  WK-806-8132-IDX   PIC S9(08) USAGE COMP    VALUE  8132.
001450     05  WK-806-8133-IDX   PIC S9(08) USAGE COMP    VALUE  8133.
001460     05  WK-806-8134-IDX   PIC S9(08) USAGE COMP    VALUE  8134.
001470     05  WK-806-8135-IDX   PIC S9(08) USAGE COMP    VALUE  8135.
001480     05  WK-806-8136-IDX   PIC S9(08) USAGE COMP    VALUE  8136.
001490     05  WK-806-8137-IDX   PIC S9(08) USAGE COMP    VALUE  8137.
001500     05  WK-806-8138-IDX   PIC S9(08) USAGE COMP    VALUE  8138.
001510     05  WK-806-8139-IDX   PIC S9(08) USAGE COMP    VALUE  8139.
001520     05  WK-806-8140-IDX   PIC S9(08) USAGE COMP    VALUE  8140.
001530     05  WK-806-8141-IDX   PIC S9(08) USAGE COMP    VALUE  8141.
001540     05  WK-806-8142-IDX   PIC S9(08) USAGE COMP    VALUE  8142.
001550     05  WK-806-8143-IDX   PIC S9(08) USAGE COMP    VALUE  8143.
001560     05  WK-806-8144-IDX   PIC S9(08) USAGE COMP    VALUE  8144.
001570     05  WK-806-8145-IDX   PIC S9(08) USAGE COMP    VALUE  8145.
001580     05  WK-806-8146-IDX   PIC S9(08) USAGE COMP    VALUE  8146.
001590     05  WK-806-8147-IDX   PIC S9(08) USAGE COMP    VALUE  8147.
001600     05  WK-806-8148-IDX   PIC S9(08) USAGE COMP    VALUE  8148.
001610     05  WK-806-8149-IDX   PIC S9(08) USAGE COMP    VALUE  8149.
001620     05  WK-806-8150-IDX   PIC S9(08) USAGE COMP    VALUE  8150.
001630     05  WK-806-8151-IDX   PIC S9(08) USAGE COMP    VALUE  8151.
001640     05  WK-806-8152-IDX   PIC S9(08) USAGE COMP    VALUE  8152.
001650     05  WK-806-8153-IDX   PIC S9(08) USAGE COMP    VALUE  8153.
001660     05  WK-806-8154-IDX   PIC S9(08) USAGE COMP    VALUE  8154.
001670     05  WK-806-8155-IDX   PIC S9(08) USAGE COMP    VALUE  8155.
001680     05  WK-806-8156-IDX   PIC S9(08) USAGE COMP    VALUE  8156.
001690     05  WK-806-8157-IDX   PIC S9(08) USAGE COMP    VALUE  8157.
001700     05  WK-806-8158-IDX   PIC S9(08) USAGE COMP    VALUE  8158.
001710     05  WK-806-8159-IDX   PIC S9(08) USAGE COMP    VALUE  8159.
001720     05  WK-806-8160-IDX   PIC S9(08) USAGE COMP    VALUE  8160.
001730     05  WK-806-8161-IDX   PIC S9(08) USAGE COMP    VALUE  8161.
001740     05  WK-806-8162-IDX   PIC S9(08) USAGE COMP    VALUE  8162.
001750     05  WK-806-8163-IDX   PIC S9(08) USAGE COMP    VALUE  8163.
001760     05  WK-806-8164-IDX   PIC S9(08) USAGE COMP    VALUE  8164.
001770     05  WK-806-8165-IDX   PIC S9(08) USAGE COMP    VALUE  8165.
001780     05  WK-806-8166-IDX   PIC S9(08) USAGE COMP    VALUE  8166.
001790     05  WK-806-8167-IDX   PIC S9(08) USAGE COMP    VALUE  8167.
001800     05  WK-806-8168-IDX   PIC S9(08) USAGE COMP    VALUE  8168.
001810     05  WK-806-8169-IDX   PIC S9(08) USAGE COMP    VALUE  8169.
001820     05  WK-806-8170-IDX   PIC S9(08) USAGE COMP    VALUE  8170.
001830     05  WK-806-8171-IDX   PIC S9(08) USAGE COMP    VALUE  8171.
001840     05  WK-806-8172-IDX   PIC S9(08) USAGE COMP    VALUE  8172.
001850     05  WK-806-8173-IDX   PIC S9(08) USAGE COMP    VALUE  8173.
001860     05  WK-806-8174-IDX   PIC S9(08) USAGE COMP    VALUE  8174.
001870     05  WK-806-8175-IDX   PIC S9(08) USAGE COMP    VALUE  8175.
001880     05  WK-806-8176-IDX   PIC S9(08) USAGE COMP    VALUE  8176.
001890     05  WK-806-8177-IDX   PIC S9(08) USAGE COMP    VALUE  8177.
001900     05  WK-806-8178-IDX   PIC S9(08) USAGE COMP    VALUE  8178.
001910     05  WK-806-8179-IDX   PIC S9(08) USAGE COMP    VALUE  8179.
001920     05  WK-806-8180-IDX   PIC S9(08) USAGE COMP    VALUE  8180.
001930     05  WK-806-8181-IDX   PIC S9(08) USAGE COMP    VALUE  8181.
001940     05  WK-806-8182-IDX   PIC S9(08) USAGE COMP    VALUE  8182.
001950     05  WK-806-8183-IDX   PIC S9(08) USAGE COMP    VALUE  8183.
001960     05  WK-806-8184-IDX   PIC S9(08) USAGE COMP    VALUE  8184.
001970     05  WK-806-8185-IDX   PIC S9(08) USAGE COMP    VALUE  8185.
001980     05  WK-806-8186-IDX   PIC S9(08) USAGE COMP    VALUE  8186.
001990     05  WK-806-8187-IDX   PIC S9(08) USAGE COMP    VALUE  8187.
002000     05  WK-806-8188-IDX   PIC S9(08) USAGE COMP    VALUE  8188.
002010     05  WK-806-8189-IDX   PIC S9(08) USAGE COMP    VALUE  8189.
002020     05  WK-806-8190-IDX   PIC S9(08) USAGE COMP    VALUE  8190.
002030     05  WK-806-8191-IDX   PIC S9(08) USAGE COMP    VALUE  8191.
002040     05  WK-806-8192-IDX   PIC S9(08) USAGE COMP    VALUE  8192.
002050     05  WK-806-8193-IDX   PIC S9(08) USAGE COMP    VALUE  8193.
002060     05  WK-806-8194-IDX   PIC S9(08) USAGE COMP    VALUE  8194.
002070     05  WK-806-8195-IDX   PIC S9(08) USAGE COMP    VALUE  8195.
002080     05  WK-806-8196-IDX   PIC S9(08) USAGE COMP    VALUE  8196.
002090     05  WK-806-8197-IDX   PIC S9(08) USAGE COMP    VALUE  8197.
002100     05  WK-806-8198-IDX   PIC S9(08) USAGE COMP    VALUE  8198.
002110     05  WK-806-8199-IDX   PIC S9(08) USAGE COMP    VALUE  8199.
002120     05  WK-806-8200-IDX   PIC S9(08) USAGE COMP    VALUE  8200.
002130     05  WK-806-8201-IDX   PIC S9(08) USAGE COMP    VALUE  8201.
002140     05  WK-806-8202-IDX   PIC S9(08) USAGE COMP    VALUE  8202.
002150     05  WK-806-8203-IDX   PIC S9(08) USAGE COMP    VALUE  8203.
002160     05  WK-806-8204-IDX   PIC S9(08) USAGE COMP    VALUE  8204.
002170     05  WK-806-8205-IDX   PIC S9(08) USAGE COMP    VALUE  8205.
002180     05  WK-806-8206-IDX   PIC S9(08) USAGE COMP    VALUE  8206.
002190     05  WK-806-8207-IDX   PIC S9(08) USAGE COMP    VALUE  8207.
002200     05  WK-806-8208-IDX   PIC S9(08) USAGE COMP    VALUE  8208.
002210     05  WK-806-8209-IDX   PIC S9(08) USAGE COMP    VALUE  8209.
002220     05  WK-806-8210-IDX   PIC S9(08) USAGE COMP    VALUE  8210.
002230     05  WK-806-8211-IDX   PIC S9(08) USAGE COMP    VALUE  8211.
002240     05  WK-806-8212-IDX   PIC S9(08) USAGE COMP    VALUE  8212.
002250     05  WK-806-8213-IDX   PIC S9(08) USAGE COMP    VALUE  8213.
002260     05  WK-806-8214-IDX   PIC S9(08) USAGE COMP    VALUE  8214.
002270     05  WK-806-8215-IDX   PIC S9(08) USAGE COMP    VALUE  8215.
002280     05  WK-806-8216-IDX   PIC S9(08) USAGE COMP    VALUE  8216.
002290     05  WK-806-8217-IDX   PIC S9(08) USAGE COMP    VALUE  8217.
002300     05  WK-806-8218-IDX   PIC S9(08) USAGE COMP    VALUE  8218.
002310     05  WK-806-8219-IDX   PIC S9(08) USAGE COMP    VALUE  8219.
002320     05  WK-806-8220-IDX   PIC S9(08) USAGE COMP    VALUE  8220.
002330     05  WK-806-8221-IDX   PIC S9(08) USAGE COMP    VALUE  8221.
002340     05  WK-806-8222-IDX   PIC S9(08) USAGE COMP    VALUE  8222.
002350     05  WK-806-8223-IDX   PIC S9(08) USAGE COMP    VALUE  8223.
002360     05  WK-806-8224-IDX   PIC S9(08) USAGE COMP    VALUE  8224.
002370     05  WK-806-8225-IDX   PIC S9(08) USAGE COMP    VALUE  8225.
002380     05  WK-806-8226-IDX   PIC S9(08) USAGE COMP    VALUE  8226.
002390     05  WK-806-8227-IDX   PIC S9(08) USAGE COMP    VALUE  8227.
002400     05  WK-806-8228-IDX   PIC S9(08) USAGE COMP    VALUE  8228.
002410     05  WK-806-8229-IDX   PIC S9(08) USAGE COMP    VALUE  8229.
002420     05  WK-806-8230-IDX   PIC S9(08) USAGE COMP    VALUE  8230.
002430     05  WK-806-8231-IDX   PIC S9(08) USAGE COMP    VALUE  8231.
002440     05  WK-806-8232-IDX   PIC S9(08) USAGE COMP    VALUE  8232.
002450     05  WK-806-8233-IDX   PIC S9(08) USAGE COMP    VALUE  8233.
002460     05  WK-806-8234-IDX   PIC S9(08) USAGE COMP    VALUE  8234.
002470     05  WK-806-8235-IDX   PIC S9(08) USAGE COMP    VALUE  8235.
002480     05  WK-806-8236-IDX   PIC S9(08) USAGE COMP    VALUE  8236.
002490     05  WK-806-8237-IDX   PIC S9(08) USAGE COMP    VALUE  8237.
002500     05  WK-806-8238-IDX   PIC S9(08) USAGE COMP    VALUE  8238.
002510     05  WK-806-8239-IDX   PIC S9(08) USAGE COMP    VALUE  8239.
002520     05  WK-806-8240-IDX   PIC S9(08) USAGE COMP    VALUE  8240.
002530     05  WK-806-8241-IDX   PIC S9(08) USAGE COMP    VALUE  8241.
002540     05  WK-806-8242-IDX   PIC S9(08) USAGE COMP    VALUE  8242.
002550     05  WK-806-8243-IDX   PIC S9(08) USAGE COMP    VALUE  8243.
002560     05  WK-806-8244-IDX   PIC S9(08) USAGE COMP    VALUE  8244.
002570     05  WK-806-8245-IDX   PIC S9(08) USAGE COMP    VALUE  8245.
002580     05  WK-806-8246-IDX   PIC S9(08) USAGE COMP    VALUE  8246.
002590     05  WK-806-8247-IDX   PIC S9(08) USAGE COMP    VALUE  8247.
002600     05  WK-806-8248-IDX   PIC S9(08) USAGE COMP    VALUE  8248.
002610     05  WK-806-8249-IDX   PIC S9(08) USAGE COMP    VALUE  8249.
002620     05  WK-806-8250-IDX   PIC S9(08) USAGE COMP    VALUE  8250.
002630     05  WK-806-8251-IDX   PIC S9(08) USAGE COMP    VALUE  8251.
002640     05  WK-806-8252-IDX   PIC S9(08) USAGE COMP    VALUE  8252.
002650     05  WK-806-8253-IDX   PIC S9(08) USAGE COMP    VALUE  8253.
002660     05  WK-806-8254-IDX   PIC S9(08) USAGE COMP    VALUE  8254.
002670     05  WK-806-8255-IDX   PIC S9(08) USAGE COMP    VALUE  8255.
002680     05  WK-806-8256-IDX   PIC S9(08) USAGE COMP    VALUE  8256.
002690     05  WK-806-8257-IDX   PIC S9(08) USAGE COMP    VALUE  8257.
002700     05  WK-806-8258-IDX   PIC S9(08) USAGE COMP    VALUE  8258.
002710     05  WK-806-8259-IDX   PIC S9(08) USAGE COMP    VALUE  8259.
002720     05  WK-806-8260-IDX   PIC S9(08) USAGE COMP    VALUE  8260.
002730     05  WK-806-8261-IDX   PIC S9(08) USAGE COMP    VALUE  8261.
002740     05  WK-806-8262-IDX   PIC S9(08) USAGE COMP    VALUE  8262.
002750     05  WK-806-8263-IDX   PIC S9(08) USAGE COMP    VALUE  8263.
002760     05  WK-806-8264-IDX   PIC S9(08) USAGE COMP    VALUE  8264.
002770     05  WK-806-8265-IDX   PIC S9(08) USAGE COMP    VALUE  8265.
002780     05  WK-806-8266-IDX   PIC S9(08) USAGE COMP    VALUE  8266.
002790     05  WK-806-8267-IDX   PIC S9(08) USAGE COMP    VALUE  8267.
002800     05  WK-806-8268-IDX   PIC S9(08) USAGE COMP    VALUE  8268.
002810     05  WK-806-8269-IDX   PIC S9(08) USAGE COMP    VALUE  8269.
002820     05  WK-806-8270-IDX   PIC S9(08) USAGE COMP    VALUE  8270.
002830     05  WK-806-8271-IDX   PIC S9(08) USAGE COMP    VALUE  8271.
002840     05  WK-806-8272-IDX   PIC S9(08) USAGE COMP    VALUE  8272.
002850     05  WK-806-8273-IDX   PIC S9(08) USAGE COMP    VALUE  8273.
002860     05  WK-806-8274-IDX   PIC S9(08) USAGE COMP    VALUE  8274.
002870     05  WK-806-8275-IDX   PIC S9(08) USAGE COMP    VALUE  8275.
002880     05  WK-806-8276-IDX   PIC S9(08) USAGE COMP    VALUE  8276.
002890     05  WK-806-8277-IDX   PIC S9(08) USAGE COMP    VALUE  8277.
002900     05  WK-806-8278-IDX   PIC S9(08) USAGE COMP    VALUE  8278.
002910     05  WK-806-8279-IDX   PIC S9(08) USAGE COMP    VALUE  8279.
002920     05  WK-806-8280-IDX   PIC S9(08) USAGE COMP    VALUE  8280.
002930     05  WK-806-8281-IDX   PIC S9(08) USAGE COMP    VALUE  8281.
002940     05  WK-806-8282-IDX   PIC S9(08) USAGE COMP    VALUE  8282.
002950     05  WK-806-8283-IDX   PIC S9(08) USAGE COMP    VALUE  8283.
002960     05  WK-806-8284-IDX   PIC S9(08) USAGE COMP    VALUE  8284.
002970     05  WK-806-8285-IDX   PIC S9(08) USAGE COMP    VALUE  8285.
002980     05  WK-806-8286-IDX   PIC S9(08) USAGE COMP    VALUE  8286.
002990     05  WK-806-8287-IDX   PIC S9(08) USAGE COMP    VALUE  8287.
003000     05  WK-806-8288-IDX   PIC S9(08) USAGE COMP    VALUE  8288.
003010     05  WK-806-8289-IDX   PIC S9(08) USAGE COMP    VALUE  8289.
003020     05  WK-806-8290-IDX   PIC S9(08) USAGE COMP    VALUE  8290.
003030     05  WK-806-8291-IDX   PIC S9(08) USAGE COMP    VALUE  8291.
003040     05  WK-806-8292-IDX   PIC S9(08) USAGE COMP    VALUE  8292.
003050     05  WK-806-8293-IDX   PIC S9(08) USAGE COMP    VALUE  8293.
003060     05  WK-806-8294-IDX   PIC S9(08) USAGE COMP    VALUE  8294.
003070     05  WK-806-8295-IDX   PIC S9(08) USAGE COMP    VALUE  8295.
003080     05  WK-806-8296-IDX   PIC S9(08) USAGE COMP    VALUE  8296.
003090     05  WK-806-8297-IDX   PIC S9(08) USAGE COMP    VALUE  8297.
003100     05  WK-806-8298-IDX   PIC S9(08) USAGE COMP    VALUE  8298.
003110     05  WK-806-8299-IDX   PIC S9(08) USAGE COMP    VALUE  8299.
003120     05  WK-806-8300-IDX   PIC S9(08) USAGE COMP    VALUE  8300.
003130     05  WK-806-8301-IDX   PIC S9(08) USAGE COMP    VALUE  8301.
003140     05  WK-806-8302-IDX   PIC S9(08) USAGE COMP    VALUE  8302.
003150     05  WK-806-8303-IDX   PIC S9(08) USAGE COMP    VALUE  8303.
003160     05  WK-806-8304-IDX   PIC S9(08) USAGE COMP    VALUE  8304.
003170     05  WK-806-8305-IDX   PIC S9(08) USAGE COMP    VALUE  8305.
003180     05  WK-806-8306-IDX   PIC S9(08) USAGE COMP    VALUE  8306.
003190     05  WK-806-8307-IDX   PIC S9(08) USAGE COMP    VALUE  8307.
003200     05  WK-806-8308-IDX   PIC S9(08) USAGE COMP    VALUE  8308.
003210     05  WK-806-8309-IDX   PIC S9(08) USAGE COMP    VALUE  8309.
003220     05  WK-806-8310-IDX   PIC S9(08) USAGE COMP    VALUE  8310.
003230     05  WK-806-8311-IDX   PIC S9(08) USAGE COMP    VALUE  8311.
003240     05  WK-806-8312-IDX   PIC S9(08) USAGE COMP    VALUE  8312.
003250     05  WK-806-8313-IDX   PIC S9(08) USAGE COMP    VALUE  8313.
003260     05  WK-806-8314-IDX   PIC S9(08) USAGE COMP    VALUE  8314.
003270     05  WK-806-8315-IDX   PIC S9(08) USAGE COMP    VALUE  8315.
003280     05  WK-806-8316-IDX   PIC S9(08) USAGE COMP    VALUE  8316.
003290     05  WK-806-8317-IDX   PIC S9(08) USAGE COMP    VALUE  8317.
003300     05  WK-806-8318-IDX   PIC S9(08) USAGE COMP    VALUE  8318.
003310     05  WK-806-8319-IDX   PIC S9(08) USAGE COMP    VALUE  8319.
003320     05  WK-806-8320-IDX   PIC S9(08) USAGE COMP    VALUE  8320.
003330     05  WK-806-8321-IDX   PIC S9(08) USAGE COMP    VALUE  8321.
003340     05  WK-806-8322-IDX   PIC S9(08) USAGE COMP    VALUE  8322.
003350     05  WK-806-8323-IDX   PIC S9(08) USAGE COMP    VALUE  8323.
003360     05  WK-806-8324-IDX   PIC S9(08) USAGE COMP    VALUE  8324.
003370     05  WK-806-8325-IDX   PIC S9(08) USAGE COMP    VALUE  8325.
003380     05  WK-806-8326-IDX   PIC S9(08) USAGE COMP    VALUE  8326.
003390     05  WK-806-8327-IDX   PIC S9(08) USAGE COMP    VALUE  8327.
003400     05  WK-806-8328-IDX   PIC S9(08) USAGE COMP    VALUE  8328.
003410     05  WK-806-8329-IDX   PIC S9(08) USAGE COMP    VALUE  8329.
003420     05  WK-806-8330-IDX   PIC S9(08) USAGE COMP    VALUE  8330.
003430     05  WK-806-8331-IDX   PIC S9(08) USAGE COMP    VALUE  8331.
003440     05  WK-806-8332-IDX   PIC S9(08) USAGE COMP    VALUE  8332.
003450     05  WK-806-8333-IDX   PIC S9(08) USAGE COMP    VALUE  8333.
003460     05  WK-806-8334-IDX   PIC S9(08) USAGE COMP    VALUE  8334.
003470     05  WK-806-8335-IDX   PIC S9(08) USAGE COMP    VALUE  8335.
003480     05  WK-806-8336-IDX   PIC S9(08) USAGE COMP    VALUE  8336.
003490     05  WK-806-8337-IDX   PIC S9(08) USAGE COMP    VALUE  8337.
003500     05  WK-806-8338-IDX   PIC S9(08) USAGE COMP    VALUE  8338.
003510     05  WK-806-8339-IDX   PIC S9(08) USAGE COMP    VALUE  8339.
003520     05  WK-806-8340-IDX   PIC S9(08) USAGE COMP    VALUE  8340.
003530     05  WK-806-8341-IDX   PIC S9(08) USAGE COMP    VALUE  8341.
003540     05  WK-806-8342-IDX   PIC S9(08) USAGE COMP    VALUE  8342.
003550     05  WK-806-8343-IDX   PIC S9(08) USAGE COMP    VALUE  8343.
003560     05  WK-806-8344-IDX   PIC S9(08) USAGE COMP    VALUE  8344.
003570     05  WK-806-8345-IDX   PIC S9(08) USAGE COMP    VALUE  8345.
003580     05  WK-806-8346-IDX   PIC S9(08) USAGE COMP    VALUE  8346.
003590     05  WK-806-8347-IDX   PIC S9(08) USAGE COMP    VALUE  8347.
003600     05  WK-806-8348-IDX   PIC S9(08) USAGE COMP    VALUE  8348.
003610     05  WK-806-8349-IDX   PIC S9(08) USAGE COMP    VALUE  8349.
003620     05  WK-806-8350-IDX   PIC S9(08) USAGE COMP    VALUE  8350.
003630     05  WK-806-8351-IDX   PIC S9(08) USAGE COMP    VALUE  8351.
003640     05  WK-806-8352-IDX   PIC S9(08) USAGE COMP    VALUE  8352.
003650     05  WK-806-8353-IDX   PIC S9(08) USAGE COMP    VALUE  8353.
003660     05  WK-806-8354-IDX   PIC S9(08) USAGE COMP    VALUE  8354.
003670     05  WK-806-8355-IDX   PIC S9(08) USAGE COMP    VALUE  8355.
003680     05  WK-806-8356-IDX   PIC S9(08) USAGE COMP    VALUE  8356.
003690     05  WK-806-8357-IDX   PIC S9(08) USAGE COMP    VALUE  8357.
003700     05  WK-806-8358-IDX   PIC S9(08) USAGE COMP    VALUE  8358.
003710     05  WK-806-8359-IDX   PIC S9(08) USAGE COMP    VALUE  8359.
003720     05  WK-806-8360-IDX   PIC S9(08) USAGE COMP    VALUE  8360.
003730     05  WK-806-8361-IDX   PIC S9(08) USAGE COMP    VALUE  8361.
003740     05  WK-806-8362-IDX   PIC S9(08) USAGE COMP    VALUE  8362.
003750     05  WK-806-8363-IDX   PIC S9(08) USAGE COMP    VALUE  8363.
003760     05  WK-806-8364-IDX   PIC S9(08) USAGE COMP    VALUE  8364.
003770     05  WK-806-8365-IDX   PIC S9(08) USAGE COMP    VALUE  8365.
003780     05  WK-806-8366-IDX   PIC S9(08) USAGE COMP    VALUE  8366.
003790     05  WK-806-8367-IDX   PIC S9(08) USAGE COMP    VALUE  8367.
003800     05  WK-806-8368-IDX   PIC S9(08) USAGE COMP    VALUE  8368.
003810     05  WK-806-8369-IDX   PIC S9(08) USAGE COMP    VALUE  8369.
003820     05  WK-806-8370-IDX   PIC S9(08) USAGE COMP    VALUE  8370.
003830     05  WK-806-8371-IDX   PIC S9(08) USAGE COMP    VALUE  8371.
003840     05  WK-806-8372-IDX   PIC S9(08) USAGE COMP    VALUE  8372.
003850     05  WK-806-8373-IDX   PIC S9(08) USAGE COMP    VALUE  8373.
003860     05  WK-806-8374-IDX   PIC S9(08) USAGE COMP    VALUE  8374.
003870     05  WK-806-8375-IDX   PIC S9(08) USAGE COMP    VALUE  8375.
003880     05  WK-806-8376-IDX   PIC S9(08) USAGE COMP    VALUE  8376.
003890     05  WK-806-8377-IDX   PIC S9(08) USAGE COMP    VALUE  8377.
003900     05  WK-806-8378-IDX   PIC S9(08) USAGE COMP    VALUE  8378.
003910     05  WK-806-8379-IDX   PIC S9(08) USAGE COMP    VALUE  8379.
003920     05  WK-806-8380-IDX   PIC S9(08) USAGE COMP    VALUE  8380.
003930     05  WK-806-8381-IDX   PIC S9(08) USAGE COMP    VALUE  8381.
003940     05  WK-806-8382-IDX   PIC S9(08) USAGE COMP    VALUE  8382.
003950     05  WK-806-8383-IDX   PIC S9(08) USAGE COMP    VALUE  8383.
003960     05  WK-806-8384-IDX   PIC S9(08) USAGE COMP    VALUE  8384.
003970     05  WK-806-8385-IDX   PIC S9(08) USAGE COMP    VALUE  8385.
003980     05  WK-806-8386-IDX   PIC S9(08) USAGE COMP    VALUE  8386.
003990     05  WK-806-8387-IDX   PIC S9(08) USAGE COMP    VALUE  8387.
004000     05  WK-806-8388-IDX   PIC S9(08) USAGE COMP    VALUE  8388.
004010     05  WK-806-8389-IDX   PIC S9(08) USAGE COMP    VALUE  8389.
004020     05  WK-806-8390-IDX   PIC S9(08) USAGE COMP    VALUE  8390.
004030     05  WK-806-8391-IDX   PIC S9(08) USAGE COMP    VALUE  8391.
004040     05  WK-806-8392-IDX   PIC S9(08) USAGE COMP    VALUE  8392.
004050     05  WK-806-8393-IDX   PIC S9(08) USAGE COMP    VALUE  8393.
004060     05  WK-806-8394-IDX   PIC S9(08) USAGE COMP    VALUE  8394.
004070     05  WK-806-8395-IDX   PIC S9(08) USAGE COMP    VALUE  8395.
004080     05  WK-806-8396-IDX   PIC S9(08) USAGE COMP    VALUE  8396.
004090     05  WK-806-8397-IDX   PIC S9(08) USAGE COMP    VALUE  8397.
004100     05  WK-806-8398-IDX   PIC S9(08) USAGE COMP    VALUE  8398.
004110     05  WK-806-8399-IDX   PIC S9(08) USAGE COMP    VALUE  8399.
004120     05  WK-806-8400-IDX   PIC S9(08) USAGE COMP    VALUE  8400.
004130     05  WK-806-8401-IDX   PIC S9(08) USAGE COMP    VALUE  8401.
004140     05  WK-806-8402-IDX   PIC S9(08) USAGE COMP    VALUE  8402.
004150     05  WK-806-8403-IDX   PIC S9(08) USAGE COMP    VALUE  8403.
004160     05  WK-806-8404-IDX   PIC S9(08) USAGE COMP    VALUE  8404.
004170     05  WK-806-8405-IDX   PIC S9(08) USAGE COMP    VALUE  8405.
004180     05  WK-806-8406-IDX   PIC S9(08) USAGE COMP    VALUE  8406.
004190     05  WK-806-8407-IDX   PIC S9(08) USAGE COMP    VALUE  8407.
004200     05  WK-806-8408-IDX   PIC S9(08) USAGE COMP    VALUE  8408.
004210     05  WK-806-8409-IDX   PIC S9(08) USAGE COMP    VALUE  8409.
004220     05  WK-806-8410-IDX   PIC S9(08) USAGE COMP    VALUE  8410.
004230     05  WK-806-8411-IDX   PIC S9(08) USAGE COMP    VALUE  8411.
004240     05  WK-806-8412-IDX   PIC S9(08) USAGE COMP    VALUE  8412.
004250     05  WK-806-8413-IDX   PIC S9(08) USAGE COMP    VALUE  8413.
004260     05  WK-806-8414-IDX   PIC S9(08) USAGE COMP    VALUE  8414.
004270     05  WK-806-8415-IDX   PIC S9(08) USAGE COMP    VALUE  8415.
004280     05  WK-806-8416-IDX   PIC S9(08) USAGE COMP    VALUE  8416.
004290     05  WK-806-8417-IDX   PIC S9(08) USAGE COMP    VALUE  8417.
004300     05  WK-806-8418-IDX   PIC S9(08) USAGE COMP    VALUE  8418.
004310     05  WK-806-8419-IDX   PIC S9(08) USAGE COMP    VALUE  8419.
004320     05  WK-806-8420-IDX   PIC S9(08) USAGE COMP    VALUE  8420.
004330     05  WK-806-8421-IDX   PIC S9(08) USAGE COMP    VALUE  8421.
004340     05  WK-806-8422-IDX   PIC S9(08) USAGE COMP    VALUE  8422.
004350     05  WK-806-8423-IDX   PIC S9(08) USAGE COMP    VALUE  8423.
004360     05  WK-806-8424-IDX   PIC S9(08) USAGE COMP    VALUE  8424.
004370     05  WK-806-8425-IDX   PIC S9(08) USAGE COMP    VALUE  8425.
004380     05  WK-806-8426-IDX   PIC S9(08) USAGE COMP    VALUE  8426.
004390     05  WK-806-8427-IDX   PIC S9(08) USAGE COMP    VALUE  8427.
004400     05  WK-806-8428-IDX   PIC S9(08) USAGE COMP    VALUE  8428.
004410     05  WK-806-8429-IDX   PIC S9(08) USAGE COMP    VALUE  8429.
004420     05  WK-806-8430-IDX   PIC S9(08) USAGE COMP    VALUE  8430.
004430     05  WK-806-8431-IDX   PIC S9(08) USAGE COMP    VALUE  8431.
004440     05  WK-806-8432-IDX   PIC S9(08) USAGE COMP    VALUE  8432.
004450     05  WK-806-8433-IDX   PIC S9(08) USAGE COMP    VALUE  8433.
004460     05  WK-806-8434-IDX   PIC S9(08) USAGE COMP    VALUE  8434.
004470     05  WK-806-8435-IDX   PIC S9(08) USAGE COMP    VALUE  8435.
004480     05  WK-806-8436-IDX   PIC S9(08) USAGE COMP    VALUE  8436.
004490     05  WK-806-8437-IDX   PIC S9(08) USAGE COMP    VALUE  8437.
004500     05  WK-806-8438-IDX   PIC S9(08) USAGE COMP    VALUE  8438.
004510     05  WK-806-8439-IDX   PIC S9(08) USAGE COMP    VALUE  8439.
004520     05  WK-806-8440-IDX   PIC S9(08) USAGE COMP    VALUE  8440.
004530     05  WK-806-8441-IDX   PIC S9(08) USAGE COMP    VALUE  8441.
004540     05  WK-806-8442-IDX   PIC S9(08) USAGE COMP    VALUE  8442.
004550     05  WK-806-8443-IDX   PIC S9(08) USAGE COMP    VALUE  8443.
004560     05  WK-806-8444-IDX   PIC S9(08) USAGE COMP    VALUE  8444.
004570     05  WK-806-8445-IDX   PIC S9(08) USAGE COMP    VALUE  8445.
004580     05  WK-806-8446-IDX   PIC S9(08) USAGE COMP    VALUE  8446.
004590     05  WK-806-8447-IDX   PIC S9(08) USAGE COMP    VALUE  8447.
004600     05  WK-806-8448-IDX   PIC S9(08) USAGE COMP    VALUE  8448.
004610     05  WK-806-8449-IDX   PIC S9(08) USAGE COMP    VALUE  8449.
004620     05  WK-806-8450-IDX   PIC S9(08) USAGE COMP    VALUE  8450.
004630     05  WK-806-8451-IDX   PIC S9(08) USAGE COMP    VALUE  8451.
004640     05  WK-806-8452-IDX   PIC S9(08) USAGE COMP    VALUE  8452.
004650     05  WK-806-8453-IDX   PIC S9(08) USAGE COMP    VALUE  8453.
004660     05  WK-806-8454-IDX   PIC S9(08) USAGE COMP    VALUE  8454.
004670     05  WK-806-8455-IDX   PIC S9(08) USAGE COMP    VALUE  8455.
004680     05  WK-806-8456-IDX   PIC S9(08) USAGE COMP    VALUE  8456.
004690     05  WK-806-8457-IDX   PIC S9(08) USAGE COMP    VALUE  8457.
004700     05  WK-806-8458-IDX   PIC S9(08) USAGE COMP    VALUE  8458.
004710     05  WK-806-8459-IDX   PIC S9(08) USAGE COMP    VALUE  8459.
004720     05  WK-806-8460-IDX   PIC S9(08) USAGE COMP    VALUE  8460.
004730     05  WK-806-8461-IDX   PIC S9(08) USAGE COMP    VALUE  8461.
004740     05  WK-806-8462-IDX   PIC S9(08) USAGE COMP    VALUE  8462.
004750     05  WK-806-8463-IDX   PIC S9(08) USAGE COMP    VALUE  8463.
004760     05  WK-806-8464-IDX   PIC S9(08) USAGE COMP    VALUE  8464.
004770     05  WK-806-8465-IDX   PIC S9(08) USAGE COMP    VALUE  8465.
004780     05  WK-806-8466-IDX   PIC S9(08) USAGE COMP    VALUE  8466.
004790     05  WK-806-8467-IDX   PIC S9(08) USAGE COMP    VALUE  8467.
004800     05  WK-806-8468-IDX   PIC S9(08) USAGE COMP    VALUE  8468.
004810     05  WK-806-8469-IDX   PIC S9(08) USAGE COMP    VALUE  8469.
004820     05  WK-806-8470-IDX   PIC S9(08) USAGE COMP    VALUE  8470.
004830     05  WK-806-8471-IDX   PIC S9(08) USAGE COMP    VALUE  8471.
004840     05  WK-806-8472-IDX   PIC S9(08) USAGE COMP    VALUE  8472.
004850     05  WK-806-8473-IDX   PIC S9(08) USAGE COMP    VALUE  8473.
004860     05  WK-806-8474-IDX   PIC S9(08) USAGE COMP    VALUE  8474.
004870     05  WK-806-8475-IDX   PIC S9(08) USAGE COMP    VALUE  8475.
004880     05  WK-806-8476-IDX   PIC S9(08) USAGE COMP    VALUE  8476.
004890     05  WK-806-8477-IDX   PIC S9(08) USAGE COMP    VALUE  8477.
004900     05  WK-806-8478-IDX   PIC S9(08) USAGE COMP    VALUE  8478.
004910     05  WK-806-8479-IDX   PIC S9(08) USAGE COMP    VALUE  8479.
004920     05  WK-806-8480-IDX   PIC S9(08) USAGE COMP    VALUE  8480.
004930     05  WK-806-8481-IDX   PIC S9(08) USAGE COMP    VALUE  8481.
004940     05  WK-806-8482-IDX   PIC S9(08) USAGE COMP    VALUE  8482.
004950     05  WK-806-8483-IDX   PIC S9(08) USAGE COMP    VALUE  8483.
004960     05  WK-806-8484-IDX   PIC S9(08) USAGE COMP    VALUE  8484.
004970     05  WK-806-8485-IDX   PIC S9(08) USAGE COMP    VALUE  8485.
004980     05  WK-806-8486-IDX   PIC S9(08) USAGE COMP    VALUE  8486.
004990     05  WK-806-8487-IDX   PIC S9(08) USAGE COMP    VALUE  8487.
005000     05  WK-806-8488-IDX   PIC S9(08) USAGE COMP    VALUE  8488.
005010     05  WK-806-8489-IDX   PIC S9(08) USAGE COMP    VALUE  8489.
005020     05  WK-806-8490-IDX   PIC S9(08) USAGE COMP    VALUE  8490.
005030     05  WK-806-8491-IDX   PIC S9(08) USAGE COMP    VALUE  8491.
005040     05  WK-806-8492-IDX   PIC S9(08) USAGE COMP    VALUE  8492.
005050     05  WK-806-8493-IDX   PIC S9(08) USAGE COMP    VALUE  8493.
005060     05  WK-806-8494-IDX   PIC S9(08) USAGE COMP    VALUE  8494.
005070     05  WK-806-8495-IDX   PIC S9(08) USAGE COMP    VALUE  8495.
005080     05  WK-806-8496-IDX   PIC S9(08) USAGE COMP    VALUE  8496.
005090     05  WK-806-8497-IDX   PIC S9(08) USAGE COMP    VALUE  8497.
005100     05  WK-806-8498-IDX   PIC S9(08) USAGE COMP    VALUE  8498.
005110     05  WK-806-8499-IDX   PIC S9(08) USAGE COMP    VALUE  8499.
005120     05  WK-806-8500-IDX   PIC S9(08) USAGE COMP    VALUE  8500.
005130     05  WK-806-8501-IDX   PIC S9(08) USAGE COMP    VALUE  8501.
005140     05  WK-806-8502-IDX   PIC S9(08) USAGE COMP    VALUE  8502.
005150     05  WK-806-8503-IDX   PIC S9(08) USAGE COMP    VALUE  8503.
005160     05  WK-806-8504-IDX   PIC S9(08) USAGE COMP    VALUE  8504.
005170     05  WK-806-8505-IDX   PIC S9(08) USAGE COMP    VALUE  8505.
005180     05  WK-806-8506-IDX   PIC S9(08) USAGE COMP    VALUE  8506.
005190     05  WK-806-8507-IDX   PIC S9(08) USAGE COMP    VALUE  8507.
005200     05  WK-806-8508-IDX   PIC S9(08) USAGE COMP    VALUE  8508.
005210     05  WK-806-8509-IDX   PIC S9(08) USAGE COMP    VALUE  8509.
005220     05  WK-806-8510-IDX   PIC S9(08) USAGE COMP    VALUE  8510.
005230     05  WK-806-8511-IDX   PIC S9(08) USAGE COMP    VALUE  8511.
005240     05  WK-806-8512-IDX   PIC S9(08) USAGE COMP    VALUE  8512.
005250     05  WK-806-8513-IDX   PIC S9(08) USAGE COMP    VALUE  8513.
005260     05  WK-806-8514-IDX   PIC S9(08) USAGE COMP    VALUE  8514.
005270     05  WK-806-8515-IDX   PIC S9(08) USAGE COMP    VALUE  8515.
005280     05  WK-806-8516-IDX   PIC S9(08) USAGE COMP    VALUE  8516.
005290     05  WK-806-8517-IDX   PIC S9(08) USAGE COMP    VALUE  8517.
005300     05  WK-806-8518-IDX   PIC S9(08) USAGE COMP    VALUE  8518.
005310     05  WK-806-8519-IDX   PIC S9(08) USAGE COMP    VALUE  8519.
005320     05  WK-806-8520-IDX   PIC S9(08) USAGE COMP    VALUE  8520.
005330     05  WK-806-8521-IDX   PIC S9(08) USAGE COMP    VALUE  8521.
005340     05  WK-806-8522-IDX   PIC S9(08) USAGE COMP    VALUE  8522.
005350     05  WK-806-8523-IDX   PIC S9(08) USAGE COMP    VALUE  8523.
005360     05  WK-806-8524-IDX   PIC S9(08) USAGE COMP    VALUE  8524.
005370     05  WK-806-8525-IDX   PIC S9(08) USAGE COMP    VALUE  8525.
005380     05  WK-806-8526-IDX   PIC S9(08) USAGE COMP    VALUE  8526.
005390     05  WK-806-8527-IDX   PIC S9(08) USAGE COMP    VALUE  8527.
005400     05  WK-806-8528-IDX   PIC S9(08) USAGE COMP    VALUE  8528.
005410     05  WK-806-8529-IDX   PIC S9(08) USAGE COMP    VALUE  8529.
005420     05  WK-806-8530-IDX   PIC S9(08) USAGE COMP    VALUE  8530.
005430     05  WK-806-8531-IDX   PIC S9(08) USAGE COMP    VALUE  8531.
005440     05  WK-806-8532-IDX   PIC S9(08) USAGE COMP    VALUE  8532.
005450     05  WK-806-8533-IDX   PIC S9(08) USAGE COMP    VALUE  8533.
005460     05  WK-806-8534-IDX   PIC S9(08) USAGE COMP    VALUE  8534.
005470     05  WK-806-8535-IDX   PIC S9(08) USAGE COMP    VALUE  8535.
005480     05  WK-806-8536-IDX   PIC S9(08) USAGE COMP    VALUE  8536.
005490     05  WK-806-8537-IDX   PIC S9(08) USAGE COMP    VALUE  8537.
005500     05  WK-806-8538-IDX   PIC S9(08) USAGE COMP    VALUE  8538.
005510     05  WK-806-8539-IDX   PIC S9(08) USAGE COMP    VALUE  8539.
005520     05  WK-806-8540-IDX   PIC S9(08) USAGE COMP    VALUE  8540.
005530     05  WK-806-8541-IDX   PIC S9(08) USAGE COMP    VALUE  8541.
005540     05  WK-806-8542-IDX   PIC S9(08) USAGE COMP    VALUE  8542.
005550     05  WK-806-8543-IDX   PIC S9(08) USAGE COMP    VALUE  8543.
005560     05  WK-806-8544-IDX   PIC S9(08) USAGE COMP    VALUE  8544.
005570     05  WK-806-8545-IDX   PIC S9(08) USAGE COMP    VALUE  8545.
005580     05  WK-806-8546-IDX   PIC S9(08) USAGE COMP    VALUE  8546.
005590     05  WK-806-8547-IDX   PIC S9(08) USAGE COMP    VALUE  8547.
005600     05  WK-806-8548-IDX   PIC S9(08) USAGE COMP    VALUE  8548.
005610     05  WK-806-8549-IDX   PIC S9(08) USAGE COMP    VALUE  8549.
005620     05  WK-806-8550-IDX   PIC S9(08) USAGE COMP    VALUE  8550.
005630     05  WK-806-8551-IDX   PIC S9(08) USAGE COMP    VALUE  8551.
005640     05  WK-806-8552-IDX   PIC S9(08) USAGE COMP    VALUE  8552.
005650     05  WK-806-8553-IDX   PIC S9(08) USAGE COMP    VALUE  8553.
005660     05  WK-806-8554-IDX   PIC S9(08) USAGE COMP    VALUE  8554.
005670     05  WK-806-8555-IDX   PIC S9(08) USAGE COMP    VALUE  8555.
005680     05  WK-806-8556-IDX   PIC S9(08) USAGE COMP    VALUE  8556.
005690     05  WK-806-8557-IDX   PIC S9(08) USAGE COMP    VALUE  8557.
005700     05  WK-806-8558-IDX   PIC S9(08) USAGE COMP    VALUE  8558.
005710     05  WK-806-8559-IDX   PIC S9(08) USAGE COMP    VALUE  8559.
005720     05  WK-806-8560-IDX   PIC S9(08) USAGE COMP    VALUE  8560.
005730     05  WK-806-8561-IDX   PIC S9(08) USAGE COMP    VALUE  8561.
005740     05  WK-806-8562-IDX   PIC S9(08) USAGE COMP    VALUE  8562.
005750     05  WK-806-8563-IDX   PIC S9(08) USAGE COMP    VALUE  8563.
005760     05  WK-806-8564-IDX   PIC S9(08) USAGE COMP    VALUE  8564.
005770     05  WK-806-8565-IDX   PIC S9(08) USAGE COMP    VALUE  8565.
005780     05  WK-806-8566-IDX   PIC S9(08) USAGE COMP    VALUE  8566.
005790     05  WK-806-8567-IDX   PIC S9(08) USAGE COMP    VALUE  8567.
005800     05  WK-806-8568-IDX   PIC S9(08) USAGE COMP    VALUE  8568.
005810     05  WK-806-8569-IDX   PIC S9(08) USAGE COMP    VALUE  8569.
005820     05  WK-806-8570-IDX   PIC S9(08) USAGE COMP    VALUE  8570.
005830     05  WK-806-8571-IDX   PIC S9(08) USAGE COMP    VALUE  8571.
005840     05  WK-806-8572-IDX   PIC S9(08) USAGE COMP    VALUE  8572.
005850     05  WK-806-8573-IDX   PIC S9(08) USAGE COMP    VALUE  8573.
005860     05  WK-806-8574-IDX   PIC S9(08) USAGE COMP    VALUE  8574.
005870     05  WK-806-8575-IDX   PIC S9(08) USAGE COMP    VALUE  8575.
005880     05  WK-806-8576-IDX   PIC S9(08) USAGE COMP    VALUE  8576.
005890     05  WK-806-8577-IDX   PIC S9(08) USAGE COMP    VALUE  8577.
005900     05  WK-806-8578-IDX   PIC S9(08) USAGE COMP    VALUE  8578.
005910     05  WK-806-8579-IDX   PIC S9(08) USAGE COMP    VALUE  8579.
005920     05  WK-806-8580-IDX   PIC S9(08) USAGE COMP    VALUE  8580.
005930     05  WK-806-8581-IDX   PIC S9(08) USAGE COMP    VALUE  8581.
005940     05  WK-806-8582-IDX   PIC S9(08) USAGE COMP    VALUE  8582.
005950     05  WK-806-8583-IDX   PIC S9(08) USAGE COMP    VALUE  8583.
005960     05  WK-806-8584-IDX   PIC S9(08) USAGE COMP    VALUE  8584.
005970     05  WK-806-8585-IDX   PIC S9(08) USAGE COMP    VALUE  8585.
005980     05  WK-806-8586-IDX   PIC S9(08) USAGE COMP    VALUE  8586.
005990     05  WK-806-8587-IDX   PIC S9(08) USAGE COMP    VALUE  8587.
006000     05  WK-806-8588-IDX   PIC S9(08) USAGE COMP    VALUE  8588.
006010     05  WK-806-8589-IDX   PIC S9(08) USAGE COMP    VALUE  8589.
006020     05  WK-806-8590-IDX   PIC S9(08) USAGE COMP    VALUE  8590.
006030     05  WK-806-8591-IDX   PIC S9(08) USAGE COMP    VALUE  8591.
006040     05  WK-806-8592-IDX   PIC S9(08) USAGE COMP    VALUE  8592.
006050     05  WK-806-8593-IDX   PIC S9(08) USAGE COMP    VALUE  8593.
006060     05  WK-806-8594-IDX   PIC S9(08) USAGE COMP    VALUE  8594.
006070     05  WK-806-8595-IDX   PIC S9(08) USAGE COMP    VALUE  8595.
006080     05  WK-806-8596-IDX   PIC S9(08) USAGE COMP    VALUE  8596.
006090     05  WK-806-8597-IDX   PIC S9(08) USAGE COMP    VALUE  8597.
006100     05  WK-806-8598-IDX   PIC S9(08) USAGE COMP    VALUE  8598.
006110     05  WK-806-8599-IDX   PIC S9(08) USAGE COMP    VALUE  8599.
006120     05  WK-806-8600-IDX   PIC S9(08) USAGE COMP    VALUE  8600.
006130     05  WK-806-8601-IDX   PIC S9(08) USAGE COMP    VALUE  8601.
006140     05  WK-806-8602-IDX   PIC S9(08) USAGE COMP    VALUE  8602.
006150     05  WK-806-8603-IDX   PIC S9(08) USAGE COMP    VALUE  8603.
006160     05  WK-806-8604-IDX   PIC S9(08) USAGE COMP    VALUE  8604.
006170     05  WK-806-8605-IDX   PIC S9(08) USAGE COMP    VALUE  8605.
006180     05  WK-806-8606-IDX   PIC S9(08) USAGE COMP    VALUE  8606.
006190     05  WK-806-8607-IDX   PIC S9(08) USAGE COMP    VALUE  8607.
006200     05  WK-806-8608-IDX   PIC S9(08) USAGE COMP    VALUE  8608.
006210     05  WK-806-8609-IDX   PIC S9(08) USAGE COMP    VALUE  8609.
006220     05  WK-806-8610-IDX   PIC S9(08) USAGE COMP    VALUE  8610.
006230     05  WK-806-8611-IDX   PIC S9(08) USAGE COMP    VALUE  8611.
006240     05  WK-806-8612-IDX   PIC S9(08) USAGE COMP    VALUE  8612.
006250     05  WK-806-8613-IDX   PIC S9(08) USAGE COMP    VALUE  8613.
006260     05  WK-806-8614-IDX   PIC S9(08) USAGE COMP    VALUE  8614.
006270     05  WK-806-8615-IDX   PIC S9(08) USAGE COMP    VALUE  8615.
006280     05  WK-806-8616-IDX   PIC S9(08) USAGE COMP    VALUE  8616.
006290     05  WK-806-8617-IDX   PIC S9(08) USAGE COMP    VALUE  8617.
006300     05  WK-806-8618-IDX   PIC S9(08) USAGE COMP    VALUE  8618.
006310     05  WK-806-8619-IDX   PIC S9(08) USAGE COMP    VALUE  8619.
006320     05  WK-806-8620-IDX   PIC S9(08) USAGE COMP    VALUE  8620.
006330     05  WK-806-8621-IDX   PIC S9(08) USAGE COMP    VALUE  8621.
006340     05  WK-806-8622-IDX   PIC S9(08) USAGE COMP    VALUE  8622.
006350     05  WK-806-8623-IDX   PIC S9(08) USAGE COMP    VALUE  8623.
006360     05  WK-806-8624-IDX   PIC S9(08) USAGE COMP    VALUE  8624.
006370     05  WK-806-8625-IDX   PIC S9(08) USAGE COMP    VALUE  8625.
006380     05  WK-806-8626-IDX   PIC S9(08) USAGE COMP    VALUE  8626.
006390     05  WK-806-8627-IDX   PIC S9(08) USAGE COMP    VALUE  8627.
006400     05  WK-806-8628-IDX   PIC S9(08) USAGE COMP    VALUE  8628.
006410     05  WK-806-8629-IDX   PIC S9(08) USAGE COMP    VALUE  8629.
006420     05  WK-806-8630-IDX   PIC S9(08) USAGE COMP    VALUE  8630.
006430     05  WK-806-8631-IDX   PIC S9(08) USAGE COMP    VALUE  8631.
006440     05  WK-806-8632-IDX   PIC S9(08) USAGE COMP    VALUE  8632.
006450     05  WK-806-8633-IDX   PIC S9(08) USAGE COMP    VALUE  8633.
006460     05  WK-806-8634-IDX   PIC S9(08) USAGE COMP    VALUE  8634.
006470     05  WK-806-8635-IDX   PIC S9(08) USAGE COMP    VALUE  8635.
006480     05  WK-806-8636-IDX   PIC S9(08) USAGE COMP    VALUE  8636.
006490     05  WK-806-8637-IDX   PIC S9(08) USAGE COMP    VALUE  8637.
006500     05  WK-806-8638-IDX   PIC S9(08) USAGE COMP    VALUE  8638.
006510     05  WK-806-8639-IDX   PIC S9(08) USAGE COMP    VALUE  8639.
006520     05  WK-806-8640-IDX   PIC S9(08) USAGE COMP    VALUE  8640.
006530     05  WK-806-8641-IDX   PIC S9(08) USAGE COMP    VALUE  8641.
006540     05  WK-806-8642-IDX   PIC S9(08) USAGE COMP    VALUE  8642.
006550     05  WK-806-8643-IDX   PIC S9(08) USAGE COMP    VALUE  8643.
006560     05  WK-806-8644-IDX   PIC S9(08) USAGE COMP    VALUE  8644.
006570     05  WK-806-8645-IDX   PIC S9(08) USAGE COMP    VALUE  8645.
006580     05  WK-806-8646-IDX   PIC S9(08) USAGE COMP    VALUE  8646.
006590     05  WK-806-8647-IDX   PIC S9(08) USAGE COMP    VALUE  8647.
006600     05  WK-806-8648-IDX   PIC S9(08) USAGE COMP    VALUE  8648.
006610     05  WK-806-8649-IDX   PIC S9(08) USAGE COMP    VALUE  8649.
006620     05  WK-806-8650-IDX   PIC S9(08) USAGE COMP    VALUE  8650.
006630     05  WK-806-8651-IDX   PIC S9(08) USAGE COMP    VALUE  8651.
006640     05  WK-806-8652-IDX   PIC S9(08) USAGE COMP    VALUE  8652.
006650     05  WK-806-8653-IDX   PIC S9(08) USAGE COMP    VALUE  8653.
006660     05  WK-806-8654-IDX   PIC S9(08) USAGE COMP    VALUE  8654.
006670     05  WK-806-8655-IDX   PIC S9(08) USAGE COMP    VALUE  8655.
006680     05  WK-806-8656-IDX   PIC S9(08) USAGE COMP    VALUE  8656.
006690     05  WK-806-8657-IDX   PIC S9(08) USAGE COMP    VALUE  8657.
006700     05  WK-806-8658-IDX   PIC S9(08) USAGE COMP    VALUE  8658.
006710     05  WK-806-8659-IDX   PIC S9(08) USAGE COMP    VALUE  8659.
006720     05  WK-806-8660-IDX   PIC S9(08) USAGE COMP    VALUE  8660.
006730     05  WK-806-8661-IDX   PIC S9(08) USAGE COMP    VALUE  8661.
006740     05  WK-806-8662-IDX   PIC S9(08) USAGE COMP    VALUE  8662.
006750     05  WK-806-8663-IDX   PIC S9(08) USAGE COMP    VALUE  8663.
006760     05  WK-806-8664-IDX   PIC S9(08) USAGE COMP    VALUE  8664.
006770     05  WK-806-8665-IDX   PIC S9(08) USAGE COMP    VALUE  8665.
006780     05  WK-806-8666-IDX   PIC S9(08) USAGE COMP    VALUE  8666.
006790     05  WK-806-8667-IDX   PIC S9(08) USAGE COMP    VALUE  8667.
006800     05  WK-806-8668-IDX   PIC S9(08) USAGE COMP    VALUE  8668.
006810     05  WK-806-8669-IDX   PIC S9(08) USAGE COMP    VALUE  8669.
006820     05  WK-806-8670-IDX   PIC S9(08) USAGE COMP    VALUE  8670.
006830     05  WK-806-8671-IDX   PIC S9(08) USAGE COMP    VALUE  8671.
006840     05  WK-806-8672-IDX   PIC S9(08) USAGE COMP    VALUE  8672.
006850     05  WK-806-8673-IDX   PIC S9(08) USAGE COMP    VALUE  8673.
006860     05  WK-806-8674-IDX   PIC S9(08) USAGE COMP    VALUE  8674.
006870     05  WK-806-8675-IDX   PIC S9(08) USAGE COMP    VALUE  8675.
006880     05  WK-806-8676-IDX   PIC S9(08) USAGE COMP    VALUE  8676.
006890     05  WK-806-8677-IDX   PIC S9(08) USAGE COMP    VALUE  8677.
006900     05  WK-806-8678-IDX   PIC S9(08) USAGE COMP    VALUE  8678.
006910     05  WK-806-8679-IDX   PIC S9(08) USAGE COMP    VALUE  8679.
006920     05  WK-806-8680-IDX   PIC S9(08) USAGE COMP    VALUE  8680.
006930     05  WK-806-8681-IDX   PIC S9(08) USAGE COMP    VALUE  8681.
006940     05  WK-806-8682-IDX   PIC S9(08) USAGE COMP    VALUE  8682.
006950     05  WK-806-8683-IDX   PIC S9(08) USAGE COMP    VALUE  8683.
006960     05  WK-806-8684-IDX   PIC S9(08) USAGE COMP    VALUE  8684.
006970     05  WK-806-8685-IDX   PIC S9(08) USAGE COMP    VALUE  8685.
006980     05  WK-806-8686-IDX   PIC S9(08) USAGE COMP    VALUE  8686.
006990     05  WK-806-8687-IDX   PIC S9(08) USAGE COMP    VALUE  8687.
007000     05  WK-806-8688-IDX   PIC S9(08) USAGE COMP    VALUE  8688.
007010     05  WK-806-8689-IDX   PIC S9(08) USAGE COMP    VALUE  8689.
007020     05  WK-806-8690-IDX   PIC S9(08) USAGE COMP    VALUE  8690.
007030     05  WK-806-8691-IDX   PIC S9(08) USAGE COMP    VALUE  8691.
007040     05  WK-806-8692-IDX   PIC S9(08) USAGE COMP    VALUE  8692.
007050     05  WK-806-8693-IDX   PIC S9(08) USAGE COMP    VALUE  8693.
007060     05  WK-806-8694-IDX   PIC S9(08) USAGE COMP    VALUE  8694.
007070     05  WK-806-8695-IDX   PIC S9(08) USAGE COMP    VALUE  8695.
007080     05  WK-806-8696-IDX   PIC S9(08) USAGE COMP    VALUE  8696.
007090     05  WK-806-8697-IDX   PIC S9(08) USAGE COMP    VALUE  8697.
007100     05  WK-806-8698-IDX   PIC S9(08) USAGE COMP    VALUE  8698.
007110     05  WK-806-8699-IDX   PIC S9(08) USAGE COMP    VALUE  8699.
007120     05  WK-806-8700-IDX   PIC S9(08) USAGE COMP    VALUE  8700.
007130     05  WK-806-8701-IDX   PIC S9(08) USAGE COMP    VALUE  8701.
007140     05  WK-806-8702-IDX   PIC S9(08) USAGE COMP    VALUE  8702.
007150     05  WK-806-8703-IDX   PIC S9(08) USAGE COMP    VALUE  8703.
007160     05  WK-806-8704-IDX   PIC S9(08) USAGE COMP    VALUE  8704.
007170     05  WK-806-8705-IDX   PIC S9(08) USAGE COMP    VALUE  8705.
007180     05  WK-806-8706-IDX   PIC S9(08) USAGE COMP    VALUE  8706.
007190     05  WK-806-8707-IDX   PIC S9(08) USAGE COMP    VALUE  8707.
007200     05  WK-806-8708-IDX   PIC S9(08) USAGE COMP    VALUE  8708.
007210     05  WK-806-8709-IDX   PIC S9(08) USAGE COMP    VALUE  8709.
007220     05  WK-806-8710-IDX   PIC S9(08) USAGE COMP    VALUE  8710.
007230     05  WK-806-8711-IDX   PIC S9(08) USAGE COMP    VALUE  8711.
007240     05  WK-806-8712-IDX   PIC S9(08) USAGE COMP    VALUE  8712.
007250     05  WK-806-8713-IDX   PIC S9(08) USAGE COMP    VALUE  8713.
007260     05  WK-806-8714-IDX   PIC S9(08) USAGE COMP    VALUE  8714.
007270     05  WK-806-8715-IDX   PIC S9(08) USAGE COMP    VALUE  8715.
007280     05  WK-806-8716-IDX   PIC S9(08) USAGE COMP    VALUE  8716.
007290     05  WK-806-8717-IDX   PIC S9(08) USAGE COMP    VALUE  8717.
007300     05  WK-806-8718-IDX   PIC S9(08) USAGE COMP    VALUE  8718.
007310     05  WK-806-8719-IDX   PIC S9(08) USAGE COMP    VALUE  8719.
007320     05  WK-806-8720-IDX   PIC S9(08) USAGE COMP    VALUE  8720.
007330     05  WK-806-8721-IDX   PIC S9(08) USAGE COMP    VALUE  8721.
007340     05  WK-806-8722-IDX   PIC S9(08) USAGE COMP    VALUE  8722.
007350     05  WK-806-8723-IDX   PIC S9(08) USAGE COMP    VALUE  8723.
007360     05  WK-806-8724-IDX   PIC S9(08) USAGE COMP    VALUE  8724.
007370     05  WK-806-8725-IDX   PIC S9(08) USAGE COMP    VALUE  8725.
007380     05  WK-806-8726-IDX   PIC S9(08) USAGE COMP    VALUE  8726.
007390     05  WK-806-8727-IDX   PIC S9(08) USAGE COMP    VALUE  8727.
007400     05  WK-806-8728-IDX   PIC S9(08) USAGE COMP    VALUE  8728.
007410     05  WK-806-8729-IDX   PIC S9(08) USAGE COMP    VALUE  8729.
007420     05  WK-806-8730-IDX   PIC S9(08) USAGE COMP    VALUE  8730.
007430     05  WK-806-8731-IDX   PIC S9(08) USAGE COMP    VALUE  8731.
007440     05  WK-806-8732-IDX   PIC S9(08) USAGE COMP    VALUE  8732.
007450     05  WK-806-8733-IDX   PIC S9(08) USAGE COMP    VALUE  8733.
007460     05  WK-806-8734-IDX   PIC S9(08) USAGE COMP    VALUE  8734.
007470     05  WK-806-8735-IDX   PIC S9(08) USAGE COMP    VALUE  8735.
007480     05  WK-806-8736-IDX   PIC S9(08) USAGE COMP    VALUE  8736.
007490     05  WK-806-8737-IDX   PIC S9(08) USAGE COMP    VALUE  8737.
007500     05  WK-806-8738-IDX   PIC S9(08) USAGE COMP    VALUE  8738.
007510     05  WK-806-8739-IDX   PIC S9(08) USAGE COMP    VALUE  8739.
007520     05  WK-806-8740-IDX   PIC S9(08) USAGE COMP    VALUE  8740.
007530     05  WK-806-8741-IDX   PIC S9(08) USAGE COMP    VALUE  8741.
007540     05  WK-806-8742-IDX   PIC S9(08) USAGE COMP    VALUE  8742.
007550     05  WK-806-8743-IDX   PIC S9(08) USAGE COMP    VALUE  8743.
007560     05  WK-806-8744-IDX   PIC S9(08) USAGE COMP    VALUE  8744.
007570     05  WK-806-8745-IDX   PIC S9(08) USAGE COMP    VALUE  8745.
007580     05  WK-806-8746-IDX   PIC S9(08) USAGE COMP    VALUE  8746.
007590     05  WK-806-8747-IDX   PIC S9(08) USAGE COMP    VALUE  8747.
007600     05  WK-806-8748-IDX   PIC S9(08) USAGE COMP    VALUE  8748.
007610     05  WK-806-8749-IDX   PIC S9(08) USAGE COMP    VALUE  8749.
007620     05  WK-806-8750-IDX   PIC S9(08) USAGE COMP    VALUE  8750.
007630     05  WK-806-8751-IDX   PIC S9(08) USAGE COMP    VALUE  8751.
007640     05  WK-806-8752-IDX   PIC S9(08) USAGE COMP    VALUE  8752.
007650     05  WK-806-8753-IDX   PIC S9(08) USAGE COMP    VALUE  8753.
007660     05  WK-806-8754-IDX   PIC S9(08) USAGE COMP    VALUE  8754.
007670     05  WK-806-8755-IDX   PIC S9(08) USAGE COMP    VALUE  8755.
007680     05  WK-806-8756-IDX   PIC S9(08) USAGE COMP    VALUE  8756.
007690     05  WK-806-8757-IDX   PIC S9(08) USAGE COMP    VALUE  8757.
007700     05  WK-806-8758-IDX   PIC S9(08) USAGE COMP    VALUE  8758.
007710     05  WK-806-8759-IDX   PIC S9(08) USAGE COMP    VALUE  8759.
007720     05  WK-806-8760-IDX   PIC S9(08) USAGE COMP    VALUE  8760.
007730     05  WK-806-8761-IDX   PIC S9(08) USAGE COMP    VALUE  8761.
007740     05  WK-806-8762-IDX   PIC S9(08) USAGE COMP    VALUE  8762.
007750     05  WK-806-8763-IDX   PIC S9(08) USAGE COMP    VALUE  8763.
007760     05  WK-806-8764-IDX   PIC S9(08) USAGE COMP    VALUE  8764.
007770     05  WK-806-8765-IDX   PIC S9(08) USAGE COMP    VALUE  8765.
007780     05  WK-806-8766-IDX   PIC S9(08) USAGE COMP    VALUE  8766.
007790     05  WK-806-8767-IDX   PIC S9(08) USAGE COMP    VALUE  8767.
007800     05  WK-806-8768-IDX   PIC S9(08) USAGE COMP    VALUE  8768.
007810     05  WK-806-8769-IDX   PIC S9(08) USAGE COMP    VALUE  8769.
007820     05  WK-806-8770-IDX   PIC S9(08) USAGE COMP    VALUE  8770.
007830     05  WK-806-8771-IDX   PIC S9(08) USAGE COMP    VALUE  8771.
007840     05  WK-806-8772-IDX   PIC S9(08) USAGE COMP    VALUE  8772.
007850     05  WK-806-8773-IDX   PIC S9(08) USAGE COMP    VALUE  8773.
007860     05  WK-806-8774-IDX   PIC S9(08) USAGE COMP    VALUE  8774.
007870     05  WK-806-8775-IDX   PIC S9(08) USAGE COMP    VALUE  8775.
007880     05  WK-806-8776-IDX   PIC S9(08) USAGE COMP    VALUE  8776.
007890     05  WK-806-8777-IDX   PIC S9(08) USAGE COMP    VALUE  8777.
007900     05  WK-806-8778-IDX   PIC S9(08) USAGE COMP    VALUE  8778.
007910     05  WK-806-8779-IDX   PIC S9(08) USAGE COMP    VALUE  8779.
007920     05  WK-806-8780-IDX   PIC S9(08) USAGE COMP    VALUE  8780.
007930     05  WK-806-8781-IDX   PIC S9(08) USAGE COMP    VALUE  8781.
007940     05  WK-806-8782-IDX   PIC S9(08) USAGE COMP    VALUE  8782.
007950     05  WK-806-8783-IDX   PIC S9(08) USAGE COMP    VALUE  8783.
007960     05  WK-806-8784-IDX   PIC S9(08) USAGE COMP    VALUE  8784.
007970     05  WK-806-8785-IDX   PIC S9(08) USAGE COMP    VALUE  8785.
007980     05  WK-806-8786-IDX   PIC S9(08) USAGE COMP    VALUE  8786.
007990     05  WK-806-8787-IDX   PIC S9(08) USAGE COMP    VALUE  8787.
008000     05  WK-806-8788-IDX   PIC S9(08) USAGE COMP    VALUE  8788.
008010     05  WK-806-8789-IDX   PIC S9(08) USAGE COMP    VALUE  8789.
008020     05  WK-806-8790-IDX   PIC S9(08) USAGE COMP    VALUE  8790.
008030     05  WK-806-8791-IDX   PIC S9(08) USAGE COMP    VALUE  8791.
008040     05  WK-806-8792-IDX   PIC S9(08) USAGE COMP    VALUE  8792.
008050     05  WK-806-8793-IDX   PIC S9(08) USAGE COMP    VALUE  8793.
008060     05  WK-806-8794-IDX   PIC S9(08) USAGE COMP    VALUE  8794.
008070     05  WK-806-8795-IDX   PIC S9(08) USAGE COMP    VALUE  8795.
008080     05  WK-806-8796-IDX   PIC S9(08) USAGE COMP    VALUE  8796.
008090     05  WK-806-8797-IDX   PIC S9(08) USAGE COMP    VALUE  8797.
008100     05  WK-806-8798-IDX   PIC S9(08) USAGE COMP    VALUE  8798.
008110     05  WK-806-8799-IDX   PIC S9(08) USAGE COMP    VALUE  8799.
008120     05  WK-806-8800-IDX   PIC S9(08) USAGE COMP    VALUE  8800.
008130     05  WK-806-8801-IDX   PIC S9(08) USAGE COMP    VALUE  8801.
008140     05  WK-806-8802-IDX   PIC S9(08) USAGE COMP    VALUE  8802.
008150     05  WK-806-8803-IDX   PIC S9(08) USAGE COMP    VALUE  8803.
008160     05  WK-806-8804-IDX   PIC S9(08) USAGE COMP    VALUE  8804.
008170     05  WK-806-8805-IDX   PIC S9(08) USAGE COMP    VALUE  8805.
008180     05  WK-806-8806-IDX   PIC S9(08) USAGE COMP    VALUE  8806.
008190     05  WK-806-8807-IDX   PIC S9(08) USAGE COMP    VALUE  8807.
008200     05  WK-806-8808-IDX   PIC S9(08) USAGE COMP    VALUE  8808.
008210     05  WK-806-8809-IDX   PIC S9(08) USAGE COMP    VALUE  8809.
008220     05  WK-806-8810-IDX   PIC S9(08) USAGE COMP    VALUE  8810.
008230     05  WK-806-8811-IDX   PIC S9(08) USAGE COMP    VALUE  8811.
008240     05  WK-806-8812-IDX   PIC S9(08) USAGE COMP    VALUE  8812.
008250     05  WK-806-8813-IDX   PIC S9(08) USAGE COMP    VALUE  8813.
008260     05  WK-806-8814-IDX   PIC S9(08) USAGE COMP    VALUE  8814.
008270     05  WK-806-8815-IDX   PIC S9(08) USAGE COMP    VALUE  8815.
008280     05  WK-806-8816-IDX   PIC S9(08) USAGE COMP    VALUE  8816.
008290     05  WK-806-8817-IDX   PIC S9(08) USAGE COMP    VALUE  8817.
008300     05  WK-806-8818-IDX   PIC S9(08) USAGE COMP    VALUE  8818.
008310     05  WK-806-8819-IDX   PIC S9(08) USAGE COMP    VALUE  8819.
008320     05  WK-806-8820-IDX   PIC S9(08) USAGE COMP    VALUE  8820.
008330     05  WK-806-8821-IDX   PIC S9(08) USAGE COMP    VALUE  8821.
008340     05  WK-806-8822-IDX   PIC S9(08) USAGE COMP    VALUE  8822.
008350     05  WK-806-8823-IDX   PIC S9(08) USAGE COMP    VALUE  8823.
008360     05  WK-806-8824-IDX   PIC S9(08) USAGE COMP    VALUE  8824.
008370     05  WK-806-8825-IDX   PIC S9(08) USAGE COMP    VALUE  8825.
008380     05  WK-806-8826-IDX   PIC S9(08) USAGE COMP    VALUE  8826.
008390     05  WK-806-8827-IDX   PIC S9(08) USAGE COMP    VALUE  8827.
008400     05  WK-806-8828-IDX   PIC S9(08) USAGE COMP    VALUE  8828.
008410     05  WK-806-8829-IDX   PIC S9(08) USAGE COMP    VALUE  8829.
008420     05  WK-806-8830-IDX   PIC S9(08) USAGE COMP    VALUE  8830.
008430     05  WK-806-8831-IDX   PIC S9(08) USAGE COMP    VALUE  8831.
008440     05  WK-806-8832-IDX   PIC S9(08) USAGE COMP    VALUE  8832.
008450     05  WK-806-8833-IDX   PIC S9(08) USAGE COMP    VALUE  8833.
008460     05  WK-806-8834-IDX   PIC S9(08) USAGE COMP    VALUE  8834.
008470     05  WK-806-8835-IDX   PIC S9(08) USAGE COMP    VALUE  8835.
008480     05  WK-806-8836-IDX   PIC S9(08) USAGE COMP    VALUE  8836.
008490     05  WK-806-8837-IDX   PIC S9(08) USAGE COMP    VALUE  8837.
008500     05  WK-806-8838-IDX   PIC S9(08) USAGE COMP    VALUE  8838.
008510     05  WK-806-8839-IDX   PIC S9(08) USAGE COMP    VALUE  8839.
008520     05  WK-806-8840-IDX   PIC S9(08) USAGE COMP    VALUE  8840.
008530     05  WK-806-8841-IDX   PIC S9(08) USAGE COMP    VALUE  8841.
008540     05  WK-806-8842-IDX   PIC S9(08) USAGE COMP    VALUE  8842.
008550     05  WK-806-8843-IDX   PIC S9(08) USAGE COMP    VALUE  8843.
008560     05  WK-806-8844-IDX   PIC S9(08) USAGE COMP    VALUE  8844.
008570     05  WK-806-8845-IDX   PIC S9(08) USAGE COMP    VALUE  8845.
008580     05  WK-806-8846-IDX   PIC S9(08) USAGE COMP    VALUE  8846.
008590     05  WK-806-8847-IDX   PIC S9(08) USAGE COMP    VALUE  8847.
008600     05  WK-806-8848-IDX   PIC S9(08) USAGE COMP    VALUE  8848.
008610     05  WK-806-8849-IDX   PIC S9(08) USAGE COMP    VALUE  8849.
008620     05  WK-806-8850-IDX   PIC S9(08) USAGE COMP    VALUE  8850.
008630     05  WK-806-8851-IDX   PIC S9(08) USAGE COMP    VALUE  8851.
008640     05  WK-806-8852-IDX   PIC S9(08) USAGE COMP    VALUE  8852.
008650     05  WK-806-8853-IDX   PIC S9(08) USAGE COMP    VALUE  8853.
008660     05  WK-806-8854-IDX   PIC S9(08) USAGE COMP    VALUE  8854.
008670     05  WK-806-8855-IDX   PIC S9(08) USAGE COMP    VALUE  8855.
008680     05  WK-806-8856-IDX   PIC S9(08) USAGE COMP    VALUE  8856.
008690     05  WK-806-8857-IDX   PIC S9(08) USAGE COMP    VALUE  8857.
008700     05  WK-806-8858-IDX   PIC S9(08) USAGE COMP    VALUE  8858.
008710     05  WK-806-8859-IDX   PIC S9(08) USAGE COMP    VALUE  8859.
008720     05  WK-806-8860-IDX   PIC S9(08) USAGE COMP    VALUE  8860.
008730     05  WK-806-8861-IDX   PIC S9(08) USAGE COMP    VALUE  8861.
008740     05  WK-806-8862-IDX   PIC S9(08) USAGE COMP    VALUE  8862.
008750     05  WK-806-8863-IDX   PIC S9(08) USAGE COMP    VALUE  8863.
008760     05  WK-806-8864-IDX   PIC S9(08) USAGE COMP    VALUE  8864.
008770     05  WK-806-8865-IDX   PIC S9(08) USAGE COMP    VALUE  8865.
008780     05  WK-806-8866-IDX   PIC S9(08) USAGE COMP    VALUE  8866.
008790     05  WK-806-8867-IDX   PIC S9(08) USAGE COMP    VALUE  8867.
008800     05  WK-806-8868-IDX   PIC S9(08) USAGE COMP    VALUE  8868.
008810     05  WK-806-8869-IDX   PIC S9(08) USAGE COMP    VALUE  8869.
008820     05  WK-806-8870-IDX   PIC S9(08) USAGE COMP    VALUE  8870.
008830     05  WK-806-8871-IDX   PIC S9(08) USAGE COMP    VALUE  8871.
008840     05  WK-806-8872-IDX   PIC S9(08) USAGE COMP    VALUE  8872.
008850     05  WK-806-8873-IDX   PIC S9(08) USAGE COMP    VALUE  8873.
008860     05  WK-806-8874-IDX   PIC S9(08) USAGE COMP    VALUE  8874.
008870     05  WK-806-8875-IDX   PIC S9(08) USAGE COMP    VALUE  8875.
008880     05  WK-806-8876-IDX   PIC S9(08) USAGE COMP    VALUE  8876.
008890     05  WK-806-8877-IDX   PIC S9(08) USAGE COMP    VALUE  8877.
008900     05  WK-806-8878-IDX   PIC S9(08) USAGE COMP    VALUE  8878.
008910     05  WK-806-8879-IDX   PIC S9(08) USAGE COMP    VALUE  8879.
008920     05  WK-806-8880-IDX   PIC S9(08) USAGE COMP    VALUE  8880.
008930     05  WK-806-8881-IDX   PIC S9(08) USAGE COMP    VALUE  8881.
008940     05  WK-806-8882-IDX   PIC S9(08) USAGE COMP    VALUE  8882.
008950     05  WK-806-8883-IDX   PIC S9(08) USAGE COMP    VALUE  8883.
008960     05  WK-806-8884-IDX   PIC S9(08) USAGE COMP    VALUE  8884.
008970     05  WK-806-8885-IDX   PIC S9(08) USAGE COMP    VALUE  8885.
008980     05  WK-806-8886-IDX   PIC S9(08) USAGE COMP    VALUE  8886.
008990     05  WK-806-8887-IDX   PIC S9(08) USAGE COMP    VALUE  8887.
009000     05  WK-806-8888-IDX   PIC S9(08) USAGE COMP    VALUE  8888.
009010     05  WK-806-8889-IDX   PIC S9(08) USAGE COMP    VALUE  8889.
009020     05  WK-806-8890-IDX   PIC S9(08) USAGE COMP    VALUE  8890.
009030     05  WK-806-8891-IDX   PIC S9(08) USAGE COMP    VALUE  8891.
009040     05  WK-806-8892-IDX   PIC S9(08) USAGE COMP    VALUE  8892.
009050     05  WK-806-8893-IDX   PIC S9(08) USAGE COMP    VALUE  8893.
009060     05  WK-806-8894-IDX   PIC S9(08) USAGE COMP    VALUE  8894.
009070     05  WK-806-8895-IDX   PIC S9(08) USAGE COMP    VALUE  8895.
009080     05  WK-806-8896-IDX   PIC S9(08) USAGE COMP    VALUE  8896.
009090     05  WK-806-8897-IDX   PIC S9(08) USAGE COMP    VALUE  8897.
009100     05  WK-806-8898-IDX   PIC S9(08) USAGE COMP    VALUE  8898.
009110     05  WK-806-8899-IDX   PIC S9(08) USAGE COMP    VALUE  8899.
009120     05  WK-806-8900-IDX   PIC S9(08) USAGE COMP    VALUE  8900.
009130     05  WK-806-8901-IDX   PIC S9(08) USAGE COMP    VALUE  8901.
009140     05  WK-806-8902-IDX   PIC S9(08) USAGE COMP    VALUE  8902.
009150     05  WK-806-8903-IDX   PIC S9(08) USAGE COMP    VALUE  8903.
009160     05  WK-806-8904-IDX   PIC S9(08) USAGE COMP    VALUE  8904.
009170     05  WK-806-8905-IDX   PIC S9(08) USAGE COMP    VALUE  8905.
009180     05  WK-806-8906-IDX   PIC S9(08) USAGE COMP    VALUE  8906.
009190     05  WK-806-8907-IDX   PIC S9(08) USAGE COMP    VALUE  8907.
009200     05  WK-806-8908-IDX   PIC S9(08) USAGE COMP    VALUE  8908.
009210     05  WK-806-8909-IDX   PIC S9(08) USAGE COMP    VALUE  8909.
009220     05  WK-806-8910-IDX   PIC S9(08) USAGE COMP    VALUE  8910.
009230     05  WK-806-8911-IDX   PIC S9(08) USAGE COMP    VALUE  8911.
009240     05  WK-806-8912-IDX   PIC S9(08) USAGE COMP    VALUE  8912.
009250     05  WK-806-8913-IDX   PIC S9(08) USAGE COMP    VALUE  8913.
009260     05  WK-806-8914-IDX   PIC S9(08) USAGE COMP    VALUE  8914.
009270     05  WK-806-8915-IDX   PIC S9(08) USAGE COMP    VALUE  8915.
009280     05  WK-806-8916-IDX   PIC S9(08) USAGE COMP    VALUE  8916.
009290     05  WK-806-8917-IDX   PIC S9(08) USAGE COMP    VALUE  8917.
009300     05  WK-806-8918-IDX   PIC S9(08) USAGE COMP    VALUE  8918.
009310     05  WK-806-8919-IDX   PIC S9(08) USAGE COMP    VALUE  8919.
009320     05  WK-806-8920-IDX   PIC S9(08) USAGE COMP    VALUE  8920.
009330     05  WK-806-8921-IDX   PIC S9(08) USAGE COMP    VALUE  8921.
009340     05  WK-806-8922-IDX   PIC S9(08) USAGE COMP    VALUE  8922.
009350     05  WK-806-8923-IDX   PIC S9(08) USAGE COMP    VALUE  8923.
009360     05  WK-806-8924-IDX   PIC S9(08) USAGE COMP    VALUE  8924.
009370     05  WK-806-8925-IDX   PIC S9(08) USAGE COMP    VALUE  8925.
009380     05  WK-806-8926-IDX   PIC S9(08) USAGE COMP    VALUE  8926.
009390     05  WK-806-8927-IDX   PIC S9(08) USAGE COMP    VALUE  8927.
009400     05  WK-806-8928-IDX   PIC S9(08) USAGE COMP    VALUE  8928.
009410     05  WK-806-8929-IDX   PIC S9(08) USAGE COMP    VALUE  8929.
009420     05  WK-806-8930-IDX   PIC S9(08) USAGE COMP    VALUE  8930.
009430     05  WK-806-8931-IDX   PIC S9(08) USAGE COMP    VALUE  8931.
009440     05  WK-806-8932-IDX   PIC S9(08) USAGE COMP    VALUE  8932.
009450     05  WK-806-8933-IDX   PIC S9(08) USAGE COMP    VALUE  8933.
009460     05  WK-806-8934-IDX   PIC S9(08) USAGE COMP    VALUE  8934.
009470     05  WK-806-8935-IDX   PIC S9(08) USAGE COMP    VALUE  8935.
009480     05  WK-806-8936-IDX   PIC S9(08) USAGE COMP    VALUE  8936.
009490     05  WK-806-8937-IDX   PIC S9(08) USAGE COMP    VALUE  8937.
009500     05  WK-806-8938-IDX   PIC S9(08) USAGE COMP    VALUE  8938.
009510     05  WK-806-8939-IDX   PIC S9(08) USAGE COMP    VALUE  8939.
009520     05  WK-806-8940-IDX   PIC S9(08) USAGE COMP    VALUE  8940.
009530     05  WK-806-8941-IDX   PIC S9(08) USAGE COMP    VALUE  8941.
009540     05  WK-806-8942-IDX   PIC S9(08) USAGE COMP    VALUE  8942.
009550     05  WK-806-8943-IDX   PIC S9(08) USAGE COMP    VALUE  8943.
009560     05  WK-806-8944-IDX   PIC S9(08) USAGE COMP    VALUE  8944.
009570     05  WK-806-8945-IDX   PIC S9(08) USAGE COMP    VALUE  8945.
009580     05  WK-806-8946-IDX   PIC S9(08) USAGE COMP    VALUE  8946.
009590     05  WK-806-8947-IDX   PIC S9(08) USAGE COMP    VALUE  8947.
009600     05  WK-806-8948-IDX   PIC S9(08) USAGE COMP    VALUE  8948.
009610     05  WK-806-8949-IDX   PIC S9(08) USAGE COMP    VALUE  8949.
009620     05  WK-806-8950-IDX   PIC S9(08) USAGE COMP    VALUE  8950.
009630     05  WK-806-8951-IDX   PIC S9(08) USAGE COMP    VALUE  8951.
009640     05  WK-806-8952-IDX   PIC S9(08) USAGE COMP    VALUE  8952.
009650     05  WK-806-8953-IDX   PIC S9(08) USAGE COMP    VALUE  8953.
009660     05  WK-806-8954-IDX   PIC S9(08) USAGE COMP    VALUE  8954.
009670     05  WK-806-8955-IDX   PIC S9(08) USAGE COMP    VALUE  8955.
009680     05  WK-806-8956-IDX   PIC S9(08) USAGE COMP    VALUE  8956.
009690     05  WK-806-8957-IDX   PIC S9(08) USAGE COMP    VALUE  8957.
009700     05  WK-806-8958-IDX   PIC S9(08) USAGE COMP    VALUE  8958.
009710     05  WK-806-8959-IDX   PIC S9(08) USAGE COMP    VALUE  8959.
009720     05  WK-806-8960-IDX   PIC S9(08) USAGE COMP    VALUE  8960.
009730     05  WK-806-8961-IDX   PIC S9(08) USAGE COMP    VALUE  8961.
009740     05  WK-806-8962-IDX   PIC S9(08) USAGE COMP    VALUE  8962.
009750     05  WK-806-8963-IDX   PIC S9(08) USAGE COMP    VALUE  8963.
009760     05  WK-806-8964-IDX   PIC S9(08) USAGE COMP    VALUE  8964.
009770     05  WK-806-8965-IDX   PIC S9(08) USAGE COMP    VALUE  8965.
009780     05  WK-806-8966-IDX   PIC S9(08) USAGE COMP    VALUE  8966.
009790     05  WK-806-8967-IDX   PIC S9(08) USAGE COMP    VALUE  8967.
009800     05  WK-806-8968-IDX   PIC S9(08) USAGE COMP    VALUE  8968.
009810     05  WK-806-8969-IDX   PIC S9(08) USAGE COMP    VALUE  8969.
009820     05  WK-806-8970-IDX   PIC S9(08) USAGE COMP    VALUE  8970.
009830     05  WK-806-8971-IDX   PIC S9(08) USAGE COMP    VALUE  8971.
009840     05  WK-806-8972-IDX   PIC S9(08) USAGE COMP    VALUE  8972.
009850     05  WK-806-8973-IDX   PIC S9(08) USAGE COMP    VALUE  8973.
009860     05  WK-806-8974-IDX   PIC S9(08) USAGE COMP    VALUE  8974.
009870     05  WK-806-8975-IDX   PIC S9(08) USAGE COMP    VALUE  8975.
009880     05  WK-806-8976-IDX   PIC S9(08) USAGE COMP    VALUE  8976.
009890     05  WK-806-8977-IDX   PIC S9(08) USAGE COMP    VALUE  8977.
009900     05  WK-806-8978-IDX   PIC S9(08) USAGE COMP    VALUE  8978.
009910     05  WK-806-8979-IDX   PIC S9(08) USAGE COMP    VALUE  8979.
009920     05  WK-806-8980-IDX   PIC S9(08) USAGE COMP    VALUE  8980.
009930     05  WK-806-8981-IDX   PIC S9(08) USAGE COMP    VALUE  8981.
009940     05  WK-806-8982-IDX   PIC S9(08) USAGE COMP    VALUE  8982.
009950     05  WK-806-8983-IDX   PIC S9(08) USAGE COMP    VALUE  8983.
009960     05  WK-806-8984-IDX   PIC S9(08) USAGE COMP    VALUE  8984.
009970     05  WK-806-8985-IDX   PIC S9(08) USAGE COMP    VALUE  8985.
009980     05  WK-806-8986-IDX   PIC S9(08) USAGE COMP    VALUE  8986.
009990     05  WK-806-8987-IDX   PIC S9(08) USAGE COMP    VALUE  8987.
010000     05  WK-806-8988-IDX   PIC S9(08) USAGE COMP    VALUE  8988.
010010     05  WK-806-8989-IDX   PIC S9(08) USAGE COMP    VALUE  8989.
010020     05  WK-806-8990-IDX   PIC S9(08) USAGE COMP    VALUE  8990.
010030     05  WK-806-8991-IDX   PIC S9(08) USAGE COMP    VALUE  8991.
010040     05  WK-806-8992-IDX   PIC S9(08) USAGE COMP    VALUE  8992.
010050     05  WK-806-8993-IDX   PIC S9(08) USAGE COMP    VALUE  8993.
010060     05  WK-806-8994-IDX   PIC S9(08) USAGE COMP    VALUE  8994.
010070     05  WK-806-8995-IDX   PIC S9(08) USAGE COMP    VALUE  8995.
010080     05  WK-806-8996-IDX   PIC S9(08) USAGE COMP    VALUE  8996.
010090     05  WK-806-8997-IDX   PIC S9(08) USAGE COMP    VALUE  8997.
010100     05  WK-806-8998-IDX   PIC S9(08) USAGE COMP    VALUE  8998.
010110     05  WK-806-8999-IDX   PIC S9(08) USAGE COMP    VALUE  8999.
010110     05  WK-806-9000-IDX   PIC S9(08) USAGE COMP    VALUE  9000.
000130     05  WK-806-9001-IDX   PIC S9(08) USAGE COMP    VALUE  9001.
000140     05  WK-806-9002-IDX   PIC S9(08) USAGE COMP    VALUE  9002.
000150     05  WK-806-9003-IDX   PIC S9(08) USAGE COMP    VALUE  9003.
000160     05  WK-806-9004-IDX   PIC S9(08) USAGE COMP    VALUE  9004.
000170     05  WK-806-9005-IDX   PIC S9(08) USAGE COMP    VALUE  9005.
000180     05  WK-806-9006-IDX   PIC S9(08) USAGE COMP    VALUE  9006.
000190     05  WK-806-9007-IDX   PIC S9(08) USAGE COMP    VALUE  9007.
000200     05  WK-806-9008-IDX   PIC S9(08) USAGE COMP    VALUE  9008.
000210     05  WK-806-9009-IDX   PIC S9(08) USAGE COMP    VALUE  9009.
000220     05  WK-806-9010-IDX   PIC S9(08) USAGE COMP    VALUE  9010.
000230     05  WK-806-9011-IDX   PIC S9(08) USAGE COMP    VALUE  9011.
000240     05  WK-806-9012-IDX   PIC S9(08) USAGE COMP    VALUE  9012.
000250     05  WK-806-9013-IDX   PIC S9(08) USAGE COMP    VALUE  9013.
000260     05  WK-806-9014-IDX   PIC S9(08) USAGE COMP    VALUE  9014.
000270     05  WK-806-9015-IDX   PIC S9(08) USAGE COMP    VALUE  9015.
000280     05  WK-806-9016-IDX   PIC S9(08) USAGE COMP    VALUE  9016.
000290     05  WK-806-9017-IDX   PIC S9(08) USAGE COMP    VALUE  9017.
000300     05  WK-806-9018-IDX   PIC S9(08) USAGE COMP    VALUE  9018.
000310     05  WK-806-9019-IDX   PIC S9(08) USAGE COMP    VALUE  9019.
000320     05  WK-806-9020-IDX   PIC S9(08) USAGE COMP    VALUE  9020.
000330     05  WK-806-9021-IDX   PIC S9(08) USAGE COMP    VALUE  9021.
000340     05  WK-806-9022-IDX   PIC S9(08) USAGE COMP    VALUE  9022.
000350     05  WK-806-9023-IDX   PIC S9(08) USAGE COMP    VALUE  9023.
000360     05  WK-806-9024-IDX   PIC S9(08) USAGE COMP    VALUE  9024.
000370     05  WK-806-9025-IDX   PIC S9(08) USAGE COMP    VALUE  9025.
000380     05  WK-806-9026-IDX   PIC S9(08) USAGE COMP    VALUE  9026.
000390     05  WK-806-9027-IDX   PIC S9(08) USAGE COMP    VALUE  9027.
000400     05  WK-806-9028-IDX   PIC S9(08) USAGE COMP    VALUE  9028.
000410     05  WK-806-9029-IDX   PIC S9(08) USAGE COMP    VALUE  9029.
000420     05  WK-806-9030-IDX   PIC S9(08) USAGE COMP    VALUE  9030.
000430     05  WK-806-9031-IDX   PIC S9(08) USAGE COMP    VALUE  9031.
000440     05  WK-806-9032-IDX   PIC S9(08) USAGE COMP    VALUE  9032.
000450     05  WK-806-9033-IDX   PIC S9(08) USAGE COMP    VALUE  9033.
000460     05  WK-806-9034-IDX   PIC S9(08) USAGE COMP    VALUE  9034.
000470     05  WK-806-9035-IDX   PIC S9(08) USAGE COMP    VALUE  9035.
000480     05  WK-806-9036-IDX   PIC S9(08) USAGE COMP    VALUE  9036.
000490     05  WK-806-9037-IDX   PIC S9(08) USAGE COMP    VALUE  9037.
000500     05  WK-806-9038-IDX   PIC S9(08) USAGE COMP    VALUE  9038.
000510     05  WK-806-9039-IDX   PIC S9(08) USAGE COMP    VALUE  9039.
000520     05  WK-806-9040-IDX   PIC S9(08) USAGE COMP    VALUE  9040.
000530     05  WK-806-9041-IDX   PIC S9(08) USAGE COMP    VALUE  9041.
000540     05  WK-806-9042-IDX   PIC S9(08) USAGE COMP    VALUE  9042.
000550     05  WK-806-9043-IDX   PIC S9(08) USAGE COMP    VALUE  9043.
000560     05  WK-806-9044-IDX   PIC S9(08) USAGE COMP    VALUE  9044.
000570     05  WK-806-9045-IDX   PIC S9(08) USAGE COMP    VALUE  9045.
000580     05  WK-806-9046-IDX   PIC S9(08) USAGE COMP    VALUE  9046.
000590     05  WK-806-9047-IDX   PIC S9(08) USAGE COMP    VALUE  9047.
000600     05  WK-806-9048-IDX   PIC S9(08) USAGE COMP    VALUE  9048.
000610     05  WK-806-9049-IDX   PIC S9(08) USAGE COMP    VALUE  9049.
000620     05  WK-806-9050-IDX   PIC S9(08) USAGE COMP    VALUE  9050.
000630     05  WK-806-9051-IDX   PIC S9(08) USAGE COMP    VALUE  9051.
000640     05  WK-806-9052-IDX   PIC S9(08) USAGE COMP    VALUE  9052.
000650     05  WK-806-9053-IDX   PIC S9(08) USAGE COMP    VALUE  9053.
000660     05  WK-806-9054-IDX   PIC S9(08) USAGE COMP    VALUE  9054.
000670     05  WK-806-9055-IDX   PIC S9(08) USAGE COMP    VALUE  9055.
000680     05  WK-806-9056-IDX   PIC S9(08) USAGE COMP    VALUE  9056.
000690     05  WK-806-9057-IDX   PIC S9(08) USAGE COMP    VALUE  9057.
000700     05  WK-806-9058-IDX   PIC S9(08) USAGE COMP    VALUE  9058.
000710     05  WK-806-9059-IDX   PIC S9(08) USAGE COMP    VALUE  9059.
000720     05  WK-806-9060-IDX   PIC S9(08) USAGE COMP    VALUE  9060.
000730     05  WK-806-9061-IDX   PIC S9(08) USAGE COMP    VALUE  9061.
000740     05  WK-806-9062-IDX   PIC S9(08) USAGE COMP    VALUE  9062.
000750     05  WK-806-9063-IDX   PIC S9(08) USAGE COMP    VALUE  9063.
000760     05  WK-806-9064-IDX   PIC S9(08) USAGE COMP    VALUE  9064.
000770     05  WK-806-9065-IDX   PIC S9(08) USAGE COMP    VALUE  9065.
000780     05  WK-806-9066-IDX   PIC S9(08) USAGE COMP    VALUE  9066.
000790     05  WK-806-9067-IDX   PIC S9(08) USAGE COMP    VALUE  9067.
000800     05  WK-806-9068-IDX   PIC S9(08) USAGE COMP    VALUE  9068.
000810     05  WK-806-9069-IDX   PIC S9(08) USAGE COMP    VALUE  9069.
000820     05  WK-806-9070-IDX   PIC S9(08) USAGE COMP    VALUE  9070.
000830     05  WK-806-9071-IDX   PIC S9(08) USAGE COMP    VALUE  9071.
000840     05  WK-806-9072-IDX   PIC S9(08) USAGE COMP    VALUE  9072.
000850     05  WK-806-9073-IDX   PIC S9(08) USAGE COMP    VALUE  9073.
000860     05  WK-806-9074-IDX   PIC S9(08) USAGE COMP    VALUE  9074.
000870     05  WK-806-9075-IDX   PIC S9(08) USAGE COMP    VALUE  9075.
000880     05  WK-806-9076-IDX   PIC S9(08) USAGE COMP    VALUE  9076.
000890     05  WK-806-9077-IDX   PIC S9(08) USAGE COMP    VALUE  9077.
000900     05  WK-806-9078-IDX   PIC S9(08) USAGE COMP    VALUE  9078.
000910     05  WK-806-9079-IDX   PIC S9(08) USAGE COMP    VALUE  9079.
000920     05  WK-806-9080-IDX   PIC S9(08) USAGE COMP    VALUE  9080.
000930     05  WK-806-9081-IDX   PIC S9(08) USAGE COMP    VALUE  9081.
000940     05  WK-806-9082-IDX   PIC S9(08) USAGE COMP    VALUE  9082.
000950     05  WK-806-9083-IDX   PIC S9(08) USAGE COMP    VALUE  9083.
000960     05  WK-806-9084-IDX   PIC S9(08) USAGE COMP    VALUE  9084.
000970     05  WK-806-9085-IDX   PIC S9(08) USAGE COMP    VALUE  9085.
000980     05  WK-806-9086-IDX   PIC S9(08) USAGE COMP    VALUE  9086.
000990     05  WK-806-9087-IDX   PIC S9(08) USAGE COMP    VALUE  9087.
001000     05  WK-806-9088-IDX   PIC S9(08) USAGE COMP    VALUE  9088.
001010     05  WK-806-9089-IDX   PIC S9(08) USAGE COMP    VALUE  9089.
001020     05  WK-806-9090-IDX   PIC S9(08) USAGE COMP    VALUE  9090.
001030     05  WK-806-9091-IDX   PIC S9(08) USAGE COMP    VALUE  9091.
001040     05  WK-806-9092-IDX   PIC S9(08) USAGE COMP    VALUE  9092.
001050     05  WK-806-9093-IDX   PIC S9(08) USAGE COMP    VALUE  9093.
001060     05  WK-806-9094-IDX   PIC S9(08) USAGE COMP    VALUE  9094.
001070     05  WK-806-9095-IDX   PIC S9(08) USAGE COMP    VALUE  9095.
001080     05  WK-806-9096-IDX   PIC S9(08) USAGE COMP    VALUE  9096.
001090     05  WK-806-9097-IDX   PIC S9(08) USAGE COMP    VALUE  9097.
001100     05  WK-806-9098-IDX   PIC S9(08) USAGE COMP    VALUE  9098.
001110     05  WK-806-9099-IDX   PIC S9(08) USAGE COMP    VALUE  9099.
001120     05  WK-806-9100-IDX   PIC S9(08) USAGE COMP    VALUE  9100.
001130     05  WK-806-9101-IDX   PIC S9(08) USAGE COMP    VALUE  9101.
001140     05  WK-806-9102-IDX   PIC S9(08) USAGE COMP    VALUE  9102.
001150     05  WK-806-9103-IDX   PIC S9(08) USAGE COMP    VALUE  9103.
001160     05  WK-806-9104-IDX   PIC S9(08) USAGE COMP    VALUE  9104.
001170     05  WK-806-9105-IDX   PIC S9(08) USAGE COMP    VALUE  9105.
001180     05  WK-806-9106-IDX   PIC S9(08) USAGE COMP    VALUE  9106.
001190     05  WK-806-9107-IDX   PIC S9(08) USAGE COMP    VALUE  9107.
001200     05  WK-806-9108-IDX   PIC S9(08) USAGE COMP    VALUE  9108.
001210     05  WK-806-9109-IDX   PIC S9(08) USAGE COMP    VALUE  9109.
001220     05  WK-806-9110-IDX   PIC S9(08) USAGE COMP    VALUE  9110.
001230     05  WK-806-9111-IDX   PIC S9(08) USAGE COMP    VALUE  9111.
001240     05  WK-806-9112-IDX   PIC S9(08) USAGE COMP    VALUE  9112.
001250     05  WK-806-9113-IDX   PIC S9(08) USAGE COMP    VALUE  9113.
001260     05  WK-806-9114-IDX   PIC S9(08) USAGE COMP    VALUE  9114.
001270     05  WK-806-9115-IDX   PIC S9(08) USAGE COMP    VALUE  9115.
001280     05  WK-806-9116-IDX   PIC S9(08) USAGE COMP    VALUE  9116.
001290     05  WK-806-9117-IDX   PIC S9(08) USAGE COMP    VALUE  9117.
001300     05  WK-806-9118-IDX   PIC S9(08) USAGE COMP    VALUE  9118.
001310     05  WK-806-9119-IDX   PIC S9(08) USAGE COMP    VALUE  9119.
001320     05  WK-806-9120-IDX   PIC S9(08) USAGE COMP    VALUE  9120.
001330     05  WK-806-9121-IDX   PIC S9(08) USAGE COMP    VALUE  9121.
001340     05  WK-806-9122-IDX   PIC S9(08) USAGE COMP    VALUE  9122.
001350     05  WK-806-9123-IDX   PIC S9(08) USAGE COMP    VALUE  9123.
001360     05  WK-806-9124-IDX   PIC S9(08) USAGE COMP    VALUE  9124.
001370     05  WK-806-9125-IDX   PIC S9(08) USAGE COMP    VALUE  9125.
001380     05  WK-806-9126-IDX   PIC S9(08) USAGE COMP    VALUE  9126.
001390     05  WK-806-9127-IDX   PIC S9(08) USAGE COMP    VALUE  9127.
001400     05  WK-806-9128-IDX   PIC S9(08) USAGE COMP    VALUE  9128.
001410     05  WK-806-9129-IDX   PIC S9(08) USAGE COMP    VALUE  9129.
001420     05  WK-806-9130-IDX   PIC S9(08) USAGE COMP    VALUE  9130.
001430     05  WK-806-9131-IDX   PIC S9(08) USAGE COMP    VALUE  9131.
001440     05  WK-806-9132-IDX   PIC S9(08) USAGE COMP    VALUE  9132.
001450     05  WK-806-9133-IDX   PIC S9(08) USAGE COMP    VALUE  9133.
001460     05  WK-806-9134-IDX   PIC S9(08) USAGE COMP    VALUE  9134.
001470     05  WK-806-9135-IDX   PIC S9(08) USAGE COMP    VALUE  9135.
001480     05  WK-806-9136-IDX   PIC S9(08) USAGE COMP    VALUE  9136.
001490     05  WK-806-9137-IDX   PIC S9(08) USAGE COMP    VALUE  9137.
001500     05  WK-806-9138-IDX   PIC S9(08) USAGE COMP    VALUE  9138.
001510     05  WK-806-9139-IDX   PIC S9(08) USAGE COMP    VALUE  9139.
001520     05  WK-806-9140-IDX   PIC S9(08) USAGE COMP    VALUE  9140.
001530     05  WK-806-9141-IDX   PIC S9(08) USAGE COMP    VALUE  9141.
001540     05  WK-806-9142-IDX   PIC S9(08) USAGE COMP    VALUE  9142.
001550     05  WK-806-9143-IDX   PIC S9(08) USAGE COMP    VALUE  9143.
001560     05  WK-806-9144-IDX   PIC S9(08) USAGE COMP    VALUE  9144.
001570     05  WK-806-9145-IDX   PIC S9(08) USAGE COMP    VALUE  9145.
001580     05  WK-806-9146-IDX   PIC S9(08) USAGE COMP    VALUE  9146.
001590     05  WK-806-9147-IDX   PIC S9(08) USAGE COMP    VALUE  9147.
001600     05  WK-806-9148-IDX   PIC S9(08) USAGE COMP    VALUE  9148.
001610     05  WK-806-9149-IDX   PIC S9(08) USAGE COMP    VALUE  9149.
001620     05  WK-806-9150-IDX   PIC S9(08) USAGE COMP    VALUE  9150.
001630     05  WK-806-9151-IDX   PIC S9(08) USAGE COMP    VALUE  9151.
001640     05  WK-806-9152-IDX   PIC S9(08) USAGE COMP    VALUE  9152.
001650     05  WK-806-9153-IDX   PIC S9(08) USAGE COMP    VALUE  9153.
001660     05  WK-806-9154-IDX   PIC S9(08) USAGE COMP    VALUE  9154.
001670     05  WK-806-9155-IDX   PIC S9(08) USAGE COMP    VALUE  9155.
001680     05  WK-806-9156-IDX   PIC S9(08) USAGE COMP    VALUE  9156.
001690     05  WK-806-9157-IDX   PIC S9(08) USAGE COMP    VALUE  9157.
001700     05  WK-806-9158-IDX   PIC S9(08) USAGE COMP    VALUE  9158.
001710     05  WK-806-9159-IDX   PIC S9(08) USAGE COMP    VALUE  9159.
001720     05  WK-806-9160-IDX   PIC S9(08) USAGE COMP    VALUE  9160.
001730     05  WK-806-9161-IDX   PIC S9(08) USAGE COMP    VALUE  9161.
001740     05  WK-806-9162-IDX   PIC S9(08) USAGE COMP    VALUE  9162.
001750     05  WK-806-9163-IDX   PIC S9(08) USAGE COMP    VALUE  9163.
001760     05  WK-806-9164-IDX   PIC S9(08) USAGE COMP    VALUE  9164.
001770     05  WK-806-9165-IDX   PIC S9(08) USAGE COMP    VALUE  9165.
001780     05  WK-806-9166-IDX   PIC S9(08) USAGE COMP    VALUE  9166.
001790     05  WK-806-9167-IDX   PIC S9(08) USAGE COMP    VALUE  9167.
001800     05  WK-806-9168-IDX   PIC S9(08) USAGE COMP    VALUE  9168.
001810     05  WK-806-9169-IDX   PIC S9(08) USAGE COMP    VALUE  9169.
001820     05  WK-806-9170-IDX   PIC S9(08) USAGE COMP    VALUE  9170.
001830     05  WK-806-9171-IDX   PIC S9(08) USAGE COMP    VALUE  9171.
001840     05  WK-806-9172-IDX   PIC S9(08) USAGE COMP    VALUE  9172.
001850     05  WK-806-9173-IDX   PIC S9(08) USAGE COMP    VALUE  9173.
001860     05  WK-806-9174-IDX   PIC S9(08) USAGE COMP    VALUE  9174.
001870     05  WK-806-9175-IDX   PIC S9(08) USAGE COMP    VALUE  9175.
001880     05  WK-806-9176-IDX   PIC S9(08) USAGE COMP    VALUE  9176.
001890     05  WK-806-9177-IDX   PIC S9(08) USAGE COMP    VALUE  9177.
001900     05  WK-806-9178-IDX   PIC S9(08) USAGE COMP    VALUE  9178.
001910     05  WK-806-9179-IDX   PIC S9(08) USAGE COMP    VALUE  9179.
001920     05  WK-806-9180-IDX   PIC S9(08) USAGE COMP    VALUE  9180.
001930     05  WK-806-9181-IDX   PIC S9(08) USAGE COMP    VALUE  9181.
001940     05  WK-806-9182-IDX   PIC S9(08) USAGE COMP    VALUE  9182.
001950     05  WK-806-9183-IDX   PIC S9(08) USAGE COMP    VALUE  9183.
001960     05  WK-806-9184-IDX   PIC S9(08) USAGE COMP    VALUE  9184.
001970     05  WK-806-9185-IDX   PIC S9(08) USAGE COMP    VALUE  9185.
001980     05  WK-806-9186-IDX   PIC S9(08) USAGE COMP    VALUE  9186.
001990     05  WK-806-9187-IDX   PIC S9(08) USAGE COMP    VALUE  9187.
002000     05  WK-806-9188-IDX   PIC S9(08) USAGE COMP    VALUE  9188.
002010     05  WK-806-9189-IDX   PIC S9(08) USAGE COMP    VALUE  9189.
002020     05  WK-806-9190-IDX   PIC S9(08) USAGE COMP    VALUE  9190.
002030     05  WK-806-9191-IDX   PIC S9(08) USAGE COMP    VALUE  9191.
002040     05  WK-806-9192-IDX   PIC S9(08) USAGE COMP    VALUE  9192.
002050     05  WK-806-9193-IDX   PIC S9(08) USAGE COMP    VALUE  9193.
002060     05  WK-806-9194-IDX   PIC S9(08) USAGE COMP    VALUE  9194.
002070     05  WK-806-9195-IDX   PIC S9(08) USAGE COMP    VALUE  9195.
002080     05  WK-806-9196-IDX   PIC S9(08) USAGE COMP    VALUE  9196.
002090     05  WK-806-9197-IDX   PIC S9(08) USAGE COMP    VALUE  9197.
002100     05  WK-806-9198-IDX   PIC S9(08) USAGE COMP    VALUE  9198.
002110     05  WK-806-9199-IDX   PIC S9(08) USAGE COMP    VALUE  9199.
002120     05  WK-806-9200-IDX   PIC S9(08) USAGE COMP    VALUE  9200.
002130     05  WK-806-9201-IDX   PIC S9(08) USAGE COMP    VALUE  9201.
002140     05  WK-806-9202-IDX   PIC S9(08) USAGE COMP    VALUE  9202.
002150     05  WK-806-9203-IDX   PIC S9(08) USAGE COMP    VALUE  9203.
002160     05  WK-806-9204-IDX   PIC S9(08) USAGE COMP    VALUE  9204.
002170     05  WK-806-9205-IDX   PIC S9(08) USAGE COMP    VALUE  9205.
002180     05  WK-806-9206-IDX   PIC S9(08) USAGE COMP    VALUE  9206.
002190     05  WK-806-9207-IDX   PIC S9(08) USAGE COMP    VALUE  9207.
002200     05  WK-806-9208-IDX   PIC S9(08) USAGE COMP    VALUE  9208.
002210     05  WK-806-9209-IDX   PIC S9(08) USAGE COMP    VALUE  9209.
002220     05  WK-806-9210-IDX   PIC S9(08) USAGE COMP    VALUE  9210.
002230     05  WK-806-9211-IDX   PIC S9(08) USAGE COMP    VALUE  9211.
002240     05  WK-806-9212-IDX   PIC S9(08) USAGE COMP    VALUE  9212.
002250     05  WK-806-9213-IDX   PIC S9(08) USAGE COMP    VALUE  9213.
002260     05  WK-806-9214-IDX   PIC S9(08) USAGE COMP    VALUE  9214.
002270     05  WK-806-9215-IDX   PIC S9(08) USAGE COMP    VALUE  9215.
002280     05  WK-806-9216-IDX   PIC S9(08) USAGE COMP    VALUE  9216.
002290     05  WK-806-9217-IDX   PIC S9(08) USAGE COMP    VALUE  9217.
002300     05  WK-806-9218-IDX   PIC S9(08) USAGE COMP    VALUE  9218.
002310     05  WK-806-9219-IDX   PIC S9(08) USAGE COMP    VALUE  9219.
002320     05  WK-806-9220-IDX   PIC S9(08) USAGE COMP    VALUE  9220.
002330     05  WK-806-9221-IDX   PIC S9(08) USAGE COMP    VALUE  9221.
002340     05  WK-806-9222-IDX   PIC S9(08) USAGE COMP    VALUE  9222.
002350     05  WK-806-9223-IDX   PIC S9(08) USAGE COMP    VALUE  9223.
002360     05  WK-806-9224-IDX   PIC S9(08) USAGE COMP    VALUE  9224.
002370     05  WK-806-9225-IDX   PIC S9(08) USAGE COMP    VALUE  9225.
002380     05  WK-806-9226-IDX   PIC S9(08) USAGE COMP    VALUE  9226.
002390     05  WK-806-9227-IDX   PIC S9(08) USAGE COMP    VALUE  9227.
002400     05  WK-806-9228-IDX   PIC S9(08) USAGE COMP    VALUE  9228.
002410     05  WK-806-9229-IDX   PIC S9(08) USAGE COMP    VALUE  9229.
002420     05  WK-806-9230-IDX   PIC S9(08) USAGE COMP    VALUE  9230.
002430     05  WK-806-9231-IDX   PIC S9(08) USAGE COMP    VALUE  9231.
002440     05  WK-806-9232-IDX   PIC S9(08) USAGE COMP    VALUE  9232.
002450     05  WK-806-9233-IDX   PIC S9(08) USAGE COMP    VALUE  9233.
002460     05  WK-806-9234-IDX   PIC S9(08) USAGE COMP    VALUE  9234.
002470     05  WK-806-9235-IDX   PIC S9(08) USAGE COMP    VALUE  9235.
002480     05  WK-806-9236-IDX   PIC S9(08) USAGE COMP    VALUE  9236.
002490     05  WK-806-9237-IDX   PIC S9(08) USAGE COMP    VALUE  9237.
002500     05  WK-806-9238-IDX   PIC S9(08) USAGE COMP    VALUE  9238.
002510     05  WK-806-9239-IDX   PIC S9(08) USAGE COMP    VALUE  9239.
002520     05  WK-806-9240-IDX   PIC S9(08) USAGE COMP    VALUE  9240.
002530     05  WK-806-9241-IDX   PIC S9(08) USAGE COMP    VALUE  9241.
002540     05  WK-806-9242-IDX   PIC S9(08) USAGE COMP    VALUE  9242.
002550     05  WK-806-9243-IDX   PIC S9(08) USAGE COMP    VALUE  9243.
002560     05  WK-806-9244-IDX   PIC S9(08) USAGE COMP    VALUE  9244.
002570     05  WK-806-9245-IDX   PIC S9(08) USAGE COMP    VALUE  9245.
002580     05  WK-806-9246-IDX   PIC S9(08) USAGE COMP    VALUE  9246.
002590     05  WK-806-9247-IDX   PIC S9(08) USAGE COMP    VALUE  9247.
002600     05  WK-806-9248-IDX   PIC S9(08) USAGE COMP    VALUE  9248.
002610     05  WK-806-9249-IDX   PIC S9(08) USAGE COMP    VALUE  9249.
002620     05  WK-806-9250-IDX   PIC S9(08) USAGE COMP    VALUE  9250.
002630     05  WK-806-9251-IDX   PIC S9(08) USAGE COMP    VALUE  9251.
002640     05  WK-806-9252-IDX   PIC S9(08) USAGE COMP    VALUE  9252.
002650     05  WK-806-9253-IDX   PIC S9(08) USAGE COMP    VALUE  9253.
002660     05  WK-806-9254-IDX   PIC S9(08) USAGE COMP    VALUE  9254.
002670     05  WK-806-9255-IDX   PIC S9(08) USAGE COMP    VALUE  9255.
002680     05  WK-806-9256-IDX   PIC S9(08) USAGE COMP    VALUE  9256.
002690     05  WK-806-9257-IDX   PIC S9(08) USAGE COMP    VALUE  9257.
002700     05  WK-806-9258-IDX   PIC S9(08) USAGE COMP    VALUE  9258.
002710     05  WK-806-9259-IDX   PIC S9(08) USAGE COMP    VALUE  9259.
002720     05  WK-806-9260-IDX   PIC S9(08) USAGE COMP    VALUE  9260.
002730     05  WK-806-9261-IDX   PIC S9(08) USAGE COMP    VALUE  9261.
002740     05  WK-806-9262-IDX   PIC S9(08) USAGE COMP    VALUE  9262.
002750     05  WK-806-9263-IDX   PIC S9(08) USAGE COMP    VALUE  9263.
002760     05  WK-806-9264-IDX   PIC S9(08) USAGE COMP    VALUE  9264.
002770     05  WK-806-9265-IDX   PIC S9(08) USAGE COMP    VALUE  9265.
002780     05  WK-806-9266-IDX   PIC S9(08) USAGE COMP    VALUE  9266.
002790     05  WK-806-9267-IDX   PIC S9(08) USAGE COMP    VALUE  9267.
002800     05  WK-806-9268-IDX   PIC S9(08) USAGE COMP    VALUE  9268.
002810     05  WK-806-9269-IDX   PIC S9(08) USAGE COMP    VALUE  9269.
002820     05  WK-806-9270-IDX   PIC S9(08) USAGE COMP    VALUE  9270.
002830     05  WK-806-9271-IDX   PIC S9(08) USAGE COMP    VALUE  9271.
002840     05  WK-806-9272-IDX   PIC S9(08) USAGE COMP    VALUE  9272.
002850     05  WK-806-9273-IDX   PIC S9(08) USAGE COMP    VALUE  9273.
002860     05  WK-806-9274-IDX   PIC S9(08) USAGE COMP    VALUE  9274.
002870     05  WK-806-9275-IDX   PIC S9(08) USAGE COMP    VALUE  9275.
002880     05  WK-806-9276-IDX   PIC S9(08) USAGE COMP    VALUE  9276.
002890     05  WK-806-9277-IDX   PIC S9(08) USAGE COMP    VALUE  9277.
002900     05  WK-806-9278-IDX   PIC S9(08) USAGE COMP    VALUE  9278.
002910     05  WK-806-9279-IDX   PIC S9(08) USAGE COMP    VALUE  9279.
002920     05  WK-806-9280-IDX   PIC S9(08) USAGE COMP    VALUE  9280.
002930     05  WK-806-9281-IDX   PIC S9(08) USAGE COMP    VALUE  9281.
002940     05  WK-806-9282-IDX   PIC S9(08) USAGE COMP    VALUE  9282.
002950     05  WK-806-9283-IDX   PIC S9(08) USAGE COMP    VALUE  9283.
002960     05  WK-806-9284-IDX   PIC S9(08) USAGE COMP    VALUE  9284.
002970     05  WK-806-9285-IDX   PIC S9(08) USAGE COMP    VALUE  9285.
002980     05  WK-806-9286-IDX   PIC S9(08) USAGE COMP    VALUE  9286.
002990     05  WK-806-9287-IDX   PIC S9(08) USAGE COMP    VALUE  9287.
003000     05  WK-806-9288-IDX   PIC S9(08) USAGE COMP    VALUE  9288.
003010     05  WK-806-9289-IDX   PIC S9(08) USAGE COMP    VALUE  9289.
003020     05  WK-806-9290-IDX   PIC S9(08) USAGE COMP    VALUE  9290.
003030     05  WK-806-9291-IDX   PIC S9(08) USAGE COMP    VALUE  9291.
003040     05  WK-806-9292-IDX   PIC S9(08) USAGE COMP    VALUE  9292.
003050     05  WK-806-9293-IDX   PIC S9(08) USAGE COMP    VALUE  9293.
003060     05  WK-806-9294-IDX   PIC S9(08) USAGE COMP    VALUE  9294.
003070     05  WK-806-9295-IDX   PIC S9(08) USAGE COMP    VALUE  9295.
003080     05  WK-806-9296-IDX   PIC S9(08) USAGE COMP    VALUE  9296.
003090     05  WK-806-9297-IDX   PIC S9(08) USAGE COMP    VALUE  9297.
003100     05  WK-806-9298-IDX   PIC S9(08) USAGE COMP    VALUE  9298.
003110     05  WK-806-9299-IDX   PIC S9(08) USAGE COMP    VALUE  9299.
003120     05  WK-806-9300-IDX   PIC S9(08) USAGE COMP    VALUE  9300.
003130     05  WK-806-9301-IDX   PIC S9(08) USAGE COMP    VALUE  9301.
003140     05  WK-806-9302-IDX   PIC S9(08) USAGE COMP    VALUE  9302.
003150     05  WK-806-9303-IDX   PIC S9(08) USAGE COMP    VALUE  9303.
003160     05  WK-806-9304-IDX   PIC S9(08) USAGE COMP    VALUE  9304.
003170     05  WK-806-9305-IDX   PIC S9(08) USAGE COMP    VALUE  9305.
003180     05  WK-806-9306-IDX   PIC S9(08) USAGE COMP    VALUE  9306.
003190     05  WK-806-9307-IDX   PIC S9(08) USAGE COMP    VALUE  9307.
003200     05  WK-806-9308-IDX   PIC S9(08) USAGE COMP    VALUE  9308.
003210     05  WK-806-9309-IDX   PIC S9(08) USAGE COMP    VALUE  9309.
003220     05  WK-806-9310-IDX   PIC S9(08) USAGE COMP    VALUE  9310.
003230     05  WK-806-9311-IDX   PIC S9(08) USAGE COMP    VALUE  9311.
003240     05  WK-806-9312-IDX   PIC S9(08) USAGE COMP    VALUE  9312.
003250     05  WK-806-9313-IDX   PIC S9(08) USAGE COMP    VALUE  9313.
003260     05  WK-806-9314-IDX   PIC S9(08) USAGE COMP    VALUE  9314.
003270     05  WK-806-9315-IDX   PIC S9(08) USAGE COMP    VALUE  9315.
003280     05  WK-806-9316-IDX   PIC S9(08) USAGE COMP    VALUE  9316.
003290     05  WK-806-9317-IDX   PIC S9(08) USAGE COMP    VALUE  9317.
003300     05  WK-806-9318-IDX   PIC S9(08) USAGE COMP    VALUE  9318.
003310     05  WK-806-9319-IDX   PIC S9(08) USAGE COMP    VALUE  9319.
003320     05  WK-806-9320-IDX   PIC S9(08) USAGE COMP    VALUE  9320.
003330     05  WK-806-9321-IDX   PIC S9(08) USAGE COMP    VALUE  9321.
003340     05  WK-806-9322-IDX   PIC S9(08) USAGE COMP    VALUE  9322.
003350     05  WK-806-9323-IDX   PIC S9(08) USAGE COMP    VALUE  9323.
003360     05  WK-806-9324-IDX   PIC S9(08) USAGE COMP    VALUE  9324.
003370     05  WK-806-9325-IDX   PIC S9(08) USAGE COMP    VALUE  9325.
003380     05  WK-806-9326-IDX   PIC S9(08) USAGE COMP    VALUE  9326.
003390     05  WK-806-9327-IDX   PIC S9(08) USAGE COMP    VALUE  9327.
003400     05  WK-806-9328-IDX   PIC S9(08) USAGE COMP    VALUE  9328.
003410     05  WK-806-9329-IDX   PIC S9(08) USAGE COMP    VALUE  9329.
003420     05  WK-806-9330-IDX   PIC S9(08) USAGE COMP    VALUE  9330.
003430     05  WK-806-9331-IDX   PIC S9(08) USAGE COMP    VALUE  9331.
003440     05  WK-806-9332-IDX   PIC S9(08) USAGE COMP    VALUE  9332.
003450     05  WK-806-9333-IDX   PIC S9(08) USAGE COMP    VALUE  9333.
003460     05  WK-806-9334-IDX   PIC S9(08) USAGE COMP    VALUE  9334.
003470     05  WK-806-9335-IDX   PIC S9(08) USAGE COMP    VALUE  9335.
003480     05  WK-806-9336-IDX   PIC S9(08) USAGE COMP    VALUE  9336.
003490     05  WK-806-9337-IDX   PIC S9(08) USAGE COMP    VALUE  9337.
003500     05  WK-806-9338-IDX   PIC S9(08) USAGE COMP    VALUE  9338.
003510     05  WK-806-9339-IDX   PIC S9(08) USAGE COMP    VALUE  9339.
003520     05  WK-806-9340-IDX   PIC S9(08) USAGE COMP    VALUE  9340.
003530     05  WK-806-9341-IDX   PIC S9(08) USAGE COMP    VALUE  9341.
003540     05  WK-806-9342-IDX   PIC S9(08) USAGE COMP    VALUE  9342.
003550     05  WK-806-9343-IDX   PIC S9(08) USAGE COMP    VALUE  9343.
003560     05  WK-806-9344-IDX   PIC S9(08) USAGE COMP    VALUE  9344.
003570     05  WK-806-9345-IDX   PIC S9(08) USAGE COMP    VALUE  9345.
003580     05  WK-806-9346-IDX   PIC S9(08) USAGE COMP    VALUE  9346.
003590     05  WK-806-9347-IDX   PIC S9(08) USAGE COMP    VALUE  9347.
003600     05  WK-806-9348-IDX   PIC S9(08) USAGE COMP    VALUE  9348.
003610     05  WK-806-9349-IDX   PIC S9(08) USAGE COMP    VALUE  9349.
003620     05  WK-806-9350-IDX   PIC S9(08) USAGE COMP    VALUE  9350.
003630     05  WK-806-9351-IDX   PIC S9(08) USAGE COMP    VALUE  9351.
003640     05  WK-806-9352-IDX   PIC S9(08) USAGE COMP    VALUE  9352.
003650     05  WK-806-9353-IDX   PIC S9(08) USAGE COMP    VALUE  9353.
003660     05  WK-806-9354-IDX   PIC S9(08) USAGE COMP    VALUE  9354.
003670     05  WK-806-9355-IDX   PIC S9(08) USAGE COMP    VALUE  9355.
003680     05  WK-806-9356-IDX   PIC S9(08) USAGE COMP    VALUE  9356.
003690     05  WK-806-9357-IDX   PIC S9(08) USAGE COMP    VALUE  9357.
003700     05  WK-806-9358-IDX   PIC S9(08) USAGE COMP    VALUE  9358.
003710     05  WK-806-9359-IDX   PIC S9(08) USAGE COMP    VALUE  9359.
003720     05  WK-806-9360-IDX   PIC S9(08) USAGE COMP    VALUE  9360.
003730     05  WK-806-9361-IDX   PIC S9(08) USAGE COMP    VALUE  9361.
003740     05  WK-806-9362-IDX   PIC S9(08) USAGE COMP    VALUE  9362.
003750     05  WK-806-9363-IDX   PIC S9(08) USAGE COMP    VALUE  9363.
003760     05  WK-806-9364-IDX   PIC S9(08) USAGE COMP    VALUE  9364.
003770     05  WK-806-9365-IDX   PIC S9(08) USAGE COMP    VALUE  9365.
003780     05  WK-806-9366-IDX   PIC S9(08) USAGE COMP    VALUE  9366.
003790     05  WK-806-9367-IDX   PIC S9(08) USAGE COMP    VALUE  9367.
003800     05  WK-806-9368-IDX   PIC S9(08) USAGE COMP    VALUE  9368.
003810     05  WK-806-9369-IDX   PIC S9(08) USAGE COMP    VALUE  9369.
003820     05  WK-806-9370-IDX   PIC S9(08) USAGE COMP    VALUE  9370.
003830     05  WK-806-9371-IDX   PIC S9(08) USAGE COMP    VALUE  9371.
003840     05  WK-806-9372-IDX   PIC S9(08) USAGE COMP    VALUE  9372.
003850     05  WK-806-9373-IDX   PIC S9(08) USAGE COMP    VALUE  9373.
003860     05  WK-806-9374-IDX   PIC S9(08) USAGE COMP    VALUE  9374.
003870     05  WK-806-9375-IDX   PIC S9(08) USAGE COMP    VALUE  9375.
003880     05  WK-806-9376-IDX   PIC S9(08) USAGE COMP    VALUE  9376.
003890     05  WK-806-9377-IDX   PIC S9(08) USAGE COMP    VALUE  9377.
003900     05  WK-806-9378-IDX   PIC S9(08) USAGE COMP    VALUE  9378.
003910     05  WK-806-9379-IDX   PIC S9(08) USAGE COMP    VALUE  9379.
003920     05  WK-806-9380-IDX   PIC S9(08) USAGE COMP    VALUE  9380.
003930     05  WK-806-9381-IDX   PIC S9(08) USAGE COMP    VALUE  9381.
003940     05  WK-806-9382-IDX   PIC S9(08) USAGE COMP    VALUE  9382.
003950     05  WK-806-9383-IDX   PIC S9(08) USAGE COMP    VALUE  9383.
003960     05  WK-806-9384-IDX   PIC S9(08) USAGE COMP    VALUE  9384.
003970     05  WK-806-9385-IDX   PIC S9(08) USAGE COMP    VALUE  9385.
003980     05  WK-806-9386-IDX   PIC S9(08) USAGE COMP    VALUE  9386.
003990     05  WK-806-9387-IDX   PIC S9(08) USAGE COMP    VALUE  9387.
004000     05  WK-806-9388-IDX   PIC S9(08) USAGE COMP    VALUE  9388.
004010     05  WK-806-9389-IDX   PIC S9(08) USAGE COMP    VALUE  9389.
004020     05  WK-806-9390-IDX   PIC S9(08) USAGE COMP    VALUE  9390.
004030     05  WK-806-9391-IDX   PIC S9(08) USAGE COMP    VALUE  9391.
004040     05  WK-806-9392-IDX   PIC S9(08) USAGE COMP    VALUE  9392.
004050     05  WK-806-9393-IDX   PIC S9(08) USAGE COMP    VALUE  9393.
004060     05  WK-806-9394-IDX   PIC S9(08) USAGE COMP    VALUE  9394.
004070     05  WK-806-9395-IDX   PIC S9(08) USAGE COMP    VALUE  9395.
004080     05  WK-806-9396-IDX   PIC S9(08) USAGE COMP    VALUE  9396.
004090     05  WK-806-9397-IDX   PIC S9(08) USAGE COMP    VALUE  9397.
004100     05  WK-806-9398-IDX   PIC S9(08) USAGE COMP    VALUE  9398.
004110     05  WK-806-9399-IDX   PIC S9(08) USAGE COMP    VALUE  9399.
004120     05  WK-806-9400-IDX   PIC S9(08) USAGE COMP    VALUE  9400.
004130     05  WK-806-9401-IDX   PIC S9(08) USAGE COMP    VALUE  9401.
004140     05  WK-806-9402-IDX   PIC S9(08) USAGE COMP    VALUE  9402.
004150     05  WK-806-9403-IDX   PIC S9(08) USAGE COMP    VALUE  9403.
004160     05  WK-806-9404-IDX   PIC S9(08) USAGE COMP    VALUE  9404.
004170     05  WK-806-9405-IDX   PIC S9(08) USAGE COMP    VALUE  9405.
004180     05  WK-806-9406-IDX   PIC S9(08) USAGE COMP    VALUE  9406.
004190     05  WK-806-9407-IDX   PIC S9(08) USAGE COMP    VALUE  9407.
004200     05  WK-806-9408-IDX   PIC S9(08) USAGE COMP    VALUE  9408.
004210     05  WK-806-9409-IDX   PIC S9(08) USAGE COMP    VALUE  9409.
004220     05  WK-806-9410-IDX   PIC S9(08) USAGE COMP    VALUE  9410.
004230     05  WK-806-9411-IDX   PIC S9(08) USAGE COMP    VALUE  9411.
004240     05  WK-806-9412-IDX   PIC S9(08) USAGE COMP    VALUE  9412.
004250     05  WK-806-9413-IDX   PIC S9(08) USAGE COMP    VALUE  9413.
004260     05  WK-806-9414-IDX   PIC S9(08) USAGE COMP    VALUE  9414.
004270     05  WK-806-9415-IDX   PIC S9(08) USAGE COMP    VALUE  9415.
004280     05  WK-806-9416-IDX   PIC S9(08) USAGE COMP    VALUE  9416.
004290     05  WK-806-9417-IDX   PIC S9(08) USAGE COMP    VALUE  9417.
004300     05  WK-806-9418-IDX   PIC S9(08) USAGE COMP    VALUE  9418.
004310     05  WK-806-9419-IDX   PIC S9(08) USAGE COMP    VALUE  9419.
004320     05  WK-806-9420-IDX   PIC S9(08) USAGE COMP    VALUE  9420.
004330     05  WK-806-9421-IDX   PIC S9(08) USAGE COMP    VALUE  9421.
004340     05  WK-806-9422-IDX   PIC S9(08) USAGE COMP    VALUE  9422.
004350     05  WK-806-9423-IDX   PIC S9(08) USAGE COMP    VALUE  9423.
004360     05  WK-806-9424-IDX   PIC S9(08) USAGE COMP    VALUE  9424.
004370     05  WK-806-9425-IDX   PIC S9(08) USAGE COMP    VALUE  9425.
004380     05  WK-806-9426-IDX   PIC S9(08) USAGE COMP    VALUE  9426.
004390     05  WK-806-9427-IDX   PIC S9(08) USAGE COMP    VALUE  9427.
004400     05  WK-806-9428-IDX   PIC S9(08) USAGE COMP    VALUE  9428.
004410     05  WK-806-9429-IDX   PIC S9(08) USAGE COMP    VALUE  9429.
004420     05  WK-806-9430-IDX   PIC S9(08) USAGE COMP    VALUE  9430.
004430     05  WK-806-9431-IDX   PIC S9(08) USAGE COMP    VALUE  9431.
004440     05  WK-806-9432-IDX   PIC S9(08) USAGE COMP    VALUE  9432.
004450     05  WK-806-9433-IDX   PIC S9(08) USAGE COMP    VALUE  9433.
004460     05  WK-806-9434-IDX   PIC S9(08) USAGE COMP    VALUE  9434.
004470     05  WK-806-9435-IDX   PIC S9(08) USAGE COMP    VALUE  9435.
004480     05  WK-806-9436-IDX   PIC S9(08) USAGE COMP    VALUE  9436.
004490     05  WK-806-9437-IDX   PIC S9(08) USAGE COMP    VALUE  9437.
004500     05  WK-806-9438-IDX   PIC S9(08) USAGE COMP    VALUE  9438.
004510     05  WK-806-9439-IDX   PIC S9(08) USAGE COMP    VALUE  9439.
004520     05  WK-806-9440-IDX   PIC S9(08) USAGE COMP    VALUE  9440.
004530     05  WK-806-9441-IDX   PIC S9(08) USAGE COMP    VALUE  9441.
004540     05  WK-806-9442-IDX   PIC S9(08) USAGE COMP    VALUE  9442.
004550     05  WK-806-9443-IDX   PIC S9(08) USAGE COMP    VALUE  9443.
004560     05  WK-806-9444-IDX   PIC S9(08) USAGE COMP    VALUE  9444.
004570     05  WK-806-9445-IDX   PIC S9(08) USAGE COMP    VALUE  9445.
004580     05  WK-806-9446-IDX   PIC S9(08) USAGE COMP    VALUE  9446.
004590     05  WK-806-9447-IDX   PIC S9(08) USAGE COMP    VALUE  9447.
004600     05  WK-806-9448-IDX   PIC S9(08) USAGE COMP    VALUE  9448.
004610     05  WK-806-9449-IDX   PIC S9(08) USAGE COMP    VALUE  9449.
004620     05  WK-806-9450-IDX   PIC S9(08) USAGE COMP    VALUE  9450.
004630     05  WK-806-9451-IDX   PIC S9(08) USAGE COMP    VALUE  9451.
004640     05  WK-806-9452-IDX   PIC S9(08) USAGE COMP    VALUE  9452.
004650     05  WK-806-9453-IDX   PIC S9(08) USAGE COMP    VALUE  9453.
004660     05  WK-806-9454-IDX   PIC S9(08) USAGE COMP    VALUE  9454.
004670     05  WK-806-9455-IDX   PIC S9(08) USAGE COMP    VALUE  9455.
004680     05  WK-806-9456-IDX   PIC S9(08) USAGE COMP    VALUE  9456.
004690     05  WK-806-9457-IDX   PIC S9(08) USAGE COMP    VALUE  9457.
004700     05  WK-806-9458-IDX   PIC S9(08) USAGE COMP    VALUE  9458.
004710     05  WK-806-9459-IDX   PIC S9(08) USAGE COMP    VALUE  9459.
004720     05  WK-806-9460-IDX   PIC S9(08) USAGE COMP    VALUE  9460.
004730     05  WK-806-9461-IDX   PIC S9(08) USAGE COMP    VALUE  9461.
004740     05  WK-806-9462-IDX   PIC S9(08) USAGE COMP    VALUE  9462.
004750     05  WK-806-9463-IDX   PIC S9(08) USAGE COMP    VALUE  9463.
004760     05  WK-806-9464-IDX   PIC S9(08) USAGE COMP    VALUE  9464.
004770     05  WK-806-9465-IDX   PIC S9(08) USAGE COMP    VALUE  9465.
004780     05  WK-806-9466-IDX   PIC S9(08) USAGE COMP    VALUE  9466.
004790     05  WK-806-9467-IDX   PIC S9(08) USAGE COMP    VALUE  9467.
004800     05  WK-806-9468-IDX   PIC S9(08) USAGE COMP    VALUE  9468.
004810     05  WK-806-9469-IDX   PIC S9(08) USAGE COMP    VALUE  9469.
004820     05  WK-806-9470-IDX   PIC S9(08) USAGE COMP    VALUE  9470.
004830     05  WK-806-9471-IDX   PIC S9(08) USAGE COMP    VALUE  9471.
004840     05  WK-806-9472-IDX   PIC S9(08) USAGE COMP    VALUE  9472.
004850     05  WK-806-9473-IDX   PIC S9(08) USAGE COMP    VALUE  9473.
004860     05  WK-806-9474-IDX   PIC S9(08) USAGE COMP    VALUE  9474.
004870     05  WK-806-9475-IDX   PIC S9(08) USAGE COMP    VALUE  9475.
004880     05  WK-806-9476-IDX   PIC S9(08) USAGE COMP    VALUE  9476.
004890     05  WK-806-9477-IDX   PIC S9(08) USAGE COMP    VALUE  9477.
004900     05  WK-806-9478-IDX   PIC S9(08) USAGE COMP    VALUE  9478.
004910     05  WK-806-9479-IDX   PIC S9(08) USAGE COMP    VALUE  9479.
004920     05  WK-806-9480-IDX   PIC S9(08) USAGE COMP    VALUE  9480.
004930     05  WK-806-9481-IDX   PIC S9(08) USAGE COMP    VALUE  9481.
004940     05  WK-806-9482-IDX   PIC S9(08) USAGE COMP    VALUE  9482.
004950     05  WK-806-9483-IDX   PIC S9(08) USAGE COMP    VALUE  9483.
004960     05  WK-806-9484-IDX   PIC S9(08) USAGE COMP    VALUE  9484.
004970     05  WK-806-9485-IDX   PIC S9(08) USAGE COMP    VALUE  9485.
004980     05  WK-806-9486-IDX   PIC S9(08) USAGE COMP    VALUE  9486.
004990     05  WK-806-9487-IDX   PIC S9(08) USAGE COMP    VALUE  9487.
005000     05  WK-806-9488-IDX   PIC S9(08) USAGE COMP    VALUE  9488.
005010     05  WK-806-9489-IDX   PIC S9(08) USAGE COMP    VALUE  9489.
005020     05  WK-806-9490-IDX   PIC S9(08) USAGE COMP    VALUE  9490.
005030     05  WK-806-9491-IDX   PIC S9(08) USAGE COMP    VALUE  9491.
005040     05  WK-806-9492-IDX   PIC S9(08) USAGE COMP    VALUE  9492.
005050     05  WK-806-9493-IDX   PIC S9(08) USAGE COMP    VALUE  9493.
005060     05  WK-806-9494-IDX   PIC S9(08) USAGE COMP    VALUE  9494.
005070     05  WK-806-9495-IDX   PIC S9(08) USAGE COMP    VALUE  9495.
005080     05  WK-806-9496-IDX   PIC S9(08) USAGE COMP    VALUE  9496.
005090     05  WK-806-9497-IDX   PIC S9(08) USAGE COMP    VALUE  9497.
005100     05  WK-806-9498-IDX   PIC S9(08) USAGE COMP    VALUE  9498.
005110     05  WK-806-9499-IDX   PIC S9(08) USAGE COMP    VALUE  9499.
005120     05  WK-806-9500-IDX   PIC S9(08) USAGE COMP    VALUE  9500.
005130     05  WK-806-9501-IDX   PIC S9(08) USAGE COMP    VALUE  9501.
005140     05  WK-806-9502-IDX   PIC S9(08) USAGE COMP    VALUE  9502.
005150     05  WK-806-9503-IDX   PIC S9(08) USAGE COMP    VALUE  9503.
005160     05  WK-806-9504-IDX   PIC S9(08) USAGE COMP    VALUE  9504.
005170     05  WK-806-9505-IDX   PIC S9(08) USAGE COMP    VALUE  9505.
005180     05  WK-806-9506-IDX   PIC S9(08) USAGE COMP    VALUE  9506.
005190     05  WK-806-9507-IDX   PIC S9(08) USAGE COMP    VALUE  9507.
005200     05  WK-806-9508-IDX   PIC S9(08) USAGE COMP    VALUE  9508.
005210     05  WK-806-9509-IDX   PIC S9(08) USAGE COMP    VALUE  9509.
005220     05  WK-806-9510-IDX   PIC S9(08) USAGE COMP    VALUE  9510.
005230     05  WK-806-9511-IDX   PIC S9(08) USAGE COMP    VALUE  9511.
005240     05  WK-806-9512-IDX   PIC S9(08) USAGE COMP    VALUE  9512.
005250     05  WK-806-9513-IDX   PIC S9(08) USAGE COMP    VALUE  9513.
005260     05  WK-806-9514-IDX   PIC S9(08) USAGE COMP    VALUE  9514.
005270     05  WK-806-9515-IDX   PIC S9(08) USAGE COMP    VALUE  9515.
005280     05  WK-806-9516-IDX   PIC S9(08) USAGE COMP    VALUE  9516.
005290     05  WK-806-9517-IDX   PIC S9(08) USAGE COMP    VALUE  9517.
005300     05  WK-806-9518-IDX   PIC S9(08) USAGE COMP    VALUE  9518.
005310     05  WK-806-9519-IDX   PIC S9(08) USAGE COMP    VALUE  9519.
005320     05  WK-806-9520-IDX   PIC S9(08) USAGE COMP    VALUE  9520.
005330     05  WK-806-9521-IDX   PIC S9(08) USAGE COMP    VALUE  9521.
005340     05  WK-806-9522-IDX   PIC S9(08) USAGE COMP    VALUE  9522.
005350     05  WK-806-9523-IDX   PIC S9(08) USAGE COMP    VALUE  9523.
005360     05  WK-806-9524-IDX   PIC S9(08) USAGE COMP    VALUE  9524.
005370     05  WK-806-9525-IDX   PIC S9(08) USAGE COMP    VALUE  9525.
005380     05  WK-806-9526-IDX   PIC S9(08) USAGE COMP    VALUE  9526.
005390     05  WK-806-9527-IDX   PIC S9(08) USAGE COMP    VALUE  9527.
005400     05  WK-806-9528-IDX   PIC S9(08) USAGE COMP    VALUE  9528.
005410     05  WK-806-9529-IDX   PIC S9(08) USAGE COMP    VALUE  9529.
005420     05  WK-806-9530-IDX   PIC S9(08) USAGE COMP    VALUE  9530.
005430     05  WK-806-9531-IDX   PIC S9(08) USAGE COMP    VALUE  9531.
005440     05  WK-806-9532-IDX   PIC S9(08) USAGE COMP    VALUE  9532.
005450     05  WK-806-9533-IDX   PIC S9(08) USAGE COMP    VALUE  9533.
005460     05  WK-806-9534-IDX   PIC S9(08) USAGE COMP    VALUE  9534.
005470     05  WK-806-9535-IDX   PIC S9(08) USAGE COMP    VALUE  9535.
005480     05  WK-806-9536-IDX   PIC S9(08) USAGE COMP    VALUE  9536.
005490     05  WK-806-9537-IDX   PIC S9(08) USAGE COMP    VALUE  9537.
005500     05  WK-806-9538-IDX   PIC S9(08) USAGE COMP    VALUE  9538.
005510     05  WK-806-9539-IDX   PIC S9(08) USAGE COMP    VALUE  9539.
005520     05  WK-806-9540-IDX   PIC S9(08) USAGE COMP    VALUE  9540.
005530     05  WK-806-9541-IDX   PIC S9(08) USAGE COMP    VALUE  9541.
005540     05  WK-806-9542-IDX   PIC S9(08) USAGE COMP    VALUE  9542.
005550     05  WK-806-9543-IDX   PIC S9(08) USAGE COMP    VALUE  9543.
005560     05  WK-806-9544-IDX   PIC S9(08) USAGE COMP    VALUE  9544.
005570     05  WK-806-9545-IDX   PIC S9(08) USAGE COMP    VALUE  9545.
005580     05  WK-806-9546-IDX   PIC S9(08) USAGE COMP    VALUE  9546.
005590     05  WK-806-9547-IDX   PIC S9(08) USAGE COMP    VALUE  9547.
005600     05  WK-806-9548-IDX   PIC S9(08) USAGE COMP    VALUE  9548.
005610     05  WK-806-9549-IDX   PIC S9(08) USAGE COMP    VALUE  9549.
005620     05  WK-806-9550-IDX   PIC S9(08) USAGE COMP    VALUE  9550.
005630     05  WK-806-9551-IDX   PIC S9(08) USAGE COMP    VALUE  9551.
005640     05  WK-806-9552-IDX   PIC S9(08) USAGE COMP    VALUE  9552.
005650     05  WK-806-9553-IDX   PIC S9(08) USAGE COMP    VALUE  9553.
005660     05  WK-806-9554-IDX   PIC S9(08) USAGE COMP    VALUE  9554.
005670     05  WK-806-9555-IDX   PIC S9(08) USAGE COMP    VALUE  9555.
005680     05  WK-806-9556-IDX   PIC S9(08) USAGE COMP    VALUE  9556.
005690     05  WK-806-9557-IDX   PIC S9(08) USAGE COMP    VALUE  9557.
005700     05  WK-806-9558-IDX   PIC S9(08) USAGE COMP    VALUE  9558.
005710     05  WK-806-9559-IDX   PIC S9(08) USAGE COMP    VALUE  9559.
005720     05  WK-806-9560-IDX   PIC S9(08) USAGE COMP    VALUE  9560.
005730     05  WK-806-9561-IDX   PIC S9(08) USAGE COMP    VALUE  9561.
005740     05  WK-806-9562-IDX   PIC S9(08) USAGE COMP    VALUE  9562.
005750     05  WK-806-9563-IDX   PIC S9(08) USAGE COMP    VALUE  9563.
005760     05  WK-806-9564-IDX   PIC S9(08) USAGE COMP    VALUE  9564.
005770     05  WK-806-9565-IDX   PIC S9(08) USAGE COMP    VALUE  9565.
005780     05  WK-806-9566-IDX   PIC S9(08) USAGE COMP    VALUE  9566.
005790     05  WK-806-9567-IDX   PIC S9(08) USAGE COMP    VALUE  9567.
005800     05  WK-806-9568-IDX   PIC S9(08) USAGE COMP    VALUE  9568.
005810     05  WK-806-9569-IDX   PIC S9(08) USAGE COMP    VALUE  9569.
005820     05  WK-806-9570-IDX   PIC S9(08) USAGE COMP    VALUE  9570.
005830     05  WK-806-9571-IDX   PIC S9(08) USAGE COMP    VALUE  9571.
005840     05  WK-806-9572-IDX   PIC S9(08) USAGE COMP    VALUE  9572.
005850     05  WK-806-9573-IDX   PIC S9(08) USAGE COMP    VALUE  9573.
005860     05  WK-806-9574-IDX   PIC S9(08) USAGE COMP    VALUE  9574.
005870     05  WK-806-9575-IDX   PIC S9(08) USAGE COMP    VALUE  9575.
005880     05  WK-806-9576-IDX   PIC S9(08) USAGE COMP    VALUE  9576.
005890     05  WK-806-9577-IDX   PIC S9(08) USAGE COMP    VALUE  9577.
005900     05  WK-806-9578-IDX   PIC S9(08) USAGE COMP    VALUE  9578.
005910     05  WK-806-9579-IDX   PIC S9(08) USAGE COMP    VALUE  9579.
005920     05  WK-806-9580-IDX   PIC S9(08) USAGE COMP    VALUE  9580.
005930     05  WK-806-9581-IDX   PIC S9(08) USAGE COMP    VALUE  9581.
005940     05  WK-806-9582-IDX   PIC S9(08) USAGE COMP    VALUE  9582.
005950     05  WK-806-9583-IDX   PIC S9(08) USAGE COMP    VALUE  9583.
005960     05  WK-806-9584-IDX   PIC S9(08) USAGE COMP    VALUE  9584.
005970     05  WK-806-9585-IDX   PIC S9(08) USAGE COMP    VALUE  9585.
005980     05  WK-806-9586-IDX   PIC S9(08) USAGE COMP    VALUE  9586.
005990     05  WK-806-9587-IDX   PIC S9(08) USAGE COMP    VALUE  9587.
006000     05  WK-806-9588-IDX   PIC S9(08) USAGE COMP    VALUE  9588.
006010     05  WK-806-9589-IDX   PIC S9(08) USAGE COMP    VALUE  9589.
006020     05  WK-806-9590-IDX   PIC S9(08) USAGE COMP    VALUE  9590.
006030     05  WK-806-9591-IDX   PIC S9(08) USAGE COMP    VALUE  9591.
006040     05  WK-806-9592-IDX   PIC S9(08) USAGE COMP    VALUE  9592.
006050     05  WK-806-9593-IDX   PIC S9(08) USAGE COMP    VALUE  9593.
006060     05  WK-806-9594-IDX   PIC S9(08) USAGE COMP    VALUE  9594.
006070     05  WK-806-9595-IDX   PIC S9(08) USAGE COMP    VALUE  9595.
006080     05  WK-806-9596-IDX   PIC S9(08) USAGE COMP    VALUE  9596.
006090     05  WK-806-9597-IDX   PIC S9(08) USAGE COMP    VALUE  9597.
006100     05  WK-806-9598-IDX   PIC S9(08) USAGE COMP    VALUE  9598.
006110     05  WK-806-9599-IDX   PIC S9(08) USAGE COMP    VALUE  9599.
006120     05  WK-806-9600-IDX   PIC S9(08) USAGE COMP    VALUE  9600.
006130     05  WK-806-9601-IDX   PIC S9(08) USAGE COMP    VALUE  9601.
006140     05  WK-806-9602-IDX   PIC S9(08) USAGE COMP    VALUE  9602.
006150     05  WK-806-9603-IDX   PIC S9(08) USAGE COMP    VALUE  9603.
006160     05  WK-806-9604-IDX   PIC S9(08) USAGE COMP    VALUE  9604.
006170     05  WK-806-9605-IDX   PIC S9(08) USAGE COMP    VALUE  9605.
006180     05  WK-806-9606-IDX   PIC S9(08) USAGE COMP    VALUE  9606.
006190     05  WK-806-9607-IDX   PIC S9(08) USAGE COMP    VALUE  9607.
006200     05  WK-806-9608-IDX   PIC S9(08) USAGE COMP    VALUE  9608.
006210     05  WK-806-9609-IDX   PIC S9(08) USAGE COMP    VALUE  9609.
006220     05  WK-806-9610-IDX   PIC S9(08) USAGE COMP    VALUE  9610.
006230     05  WK-806-9611-IDX   PIC S9(08) USAGE COMP    VALUE  9611.
006240     05  WK-806-9612-IDX   PIC S9(08) USAGE COMP    VALUE  9612.
006250     05  WK-806-9613-IDX   PIC S9(08) USAGE COMP    VALUE  9613.
006260     05  WK-806-9614-IDX   PIC S9(08) USAGE COMP    VALUE  9614.
006270     05  WK-806-9615-IDX   PIC S9(08) USAGE COMP    VALUE  9615.
006280     05  WK-806-9616-IDX   PIC S9(08) USAGE COMP    VALUE  9616.
006290     05  WK-806-9617-IDX   PIC S9(08) USAGE COMP    VALUE  9617.
006300     05  WK-806-9618-IDX   PIC S9(08) USAGE COMP    VALUE  9618.
006310     05  WK-806-9619-IDX   PIC S9(08) USAGE COMP    VALUE  9619.
006320     05  WK-806-9620-IDX   PIC S9(08) USAGE COMP    VALUE  9620.
006330     05  WK-806-9621-IDX   PIC S9(08) USAGE COMP    VALUE  9621.
006340     05  WK-806-9622-IDX   PIC S9(08) USAGE COMP    VALUE  9622.
006350     05  WK-806-9623-IDX   PIC S9(08) USAGE COMP    VALUE  9623.
006360     05  WK-806-9624-IDX   PIC S9(08) USAGE COMP    VALUE  9624.
006370     05  WK-806-9625-IDX   PIC S9(08) USAGE COMP    VALUE  9625.
006380     05  WK-806-9626-IDX   PIC S9(08) USAGE COMP    VALUE  9626.
006390     05  WK-806-9627-IDX   PIC S9(08) USAGE COMP    VALUE  9627.
006400     05  WK-806-9628-IDX   PIC S9(08) USAGE COMP    VALUE  9628.
006410     05  WK-806-9629-IDX   PIC S9(08) USAGE COMP    VALUE  9629.
006420     05  WK-806-9630-IDX   PIC S9(08) USAGE COMP    VALUE  9630.
006430     05  WK-806-9631-IDX   PIC S9(08) USAGE COMP    VALUE  9631.
006440     05  WK-806-9632-IDX   PIC S9(08) USAGE COMP    VALUE  9632.
006450     05  WK-806-9633-IDX   PIC S9(08) USAGE COMP    VALUE  9633.
006460     05  WK-806-9634-IDX   PIC S9(08) USAGE COMP    VALUE  9634.
006470     05  WK-806-9635-IDX   PIC S9(08) USAGE COMP    VALUE  9635.
006480     05  WK-806-9636-IDX   PIC S9(08) USAGE COMP    VALUE  9636.
006490     05  WK-806-9637-IDX   PIC S9(08) USAGE COMP    VALUE  9637.
006500     05  WK-806-9638-IDX   PIC S9(08) USAGE COMP    VALUE  9638.
006510     05  WK-806-9639-IDX   PIC S9(08) USAGE COMP    VALUE  9639.
006520     05  WK-806-9640-IDX   PIC S9(08) USAGE COMP    VALUE  9640.
006530     05  WK-806-9641-IDX   PIC S9(08) USAGE COMP    VALUE  9641.
006540     05  WK-806-9642-IDX   PIC S9(08) USAGE COMP    VALUE  9642.
006550     05  WK-806-9643-IDX   PIC S9(08) USAGE COMP    VALUE  9643.
006560     05  WK-806-9644-IDX   PIC S9(08) USAGE COMP    VALUE  9644.
006570     05  WK-806-9645-IDX   PIC S9(08) USAGE COMP    VALUE  9645.
006580     05  WK-806-9646-IDX   PIC S9(08) USAGE COMP    VALUE  9646.
006590     05  WK-806-9647-IDX   PIC S9(08) USAGE COMP    VALUE  9647.
006600     05  WK-806-9648-IDX   PIC S9(08) USAGE COMP    VALUE  9648.
006610     05  WK-806-9649-IDX   PIC S9(08) USAGE COMP    VALUE  9649.
006620     05  WK-806-9650-IDX   PIC S9(08) USAGE COMP    VALUE  9650.
006630     05  WK-806-9651-IDX   PIC S9(08) USAGE COMP    VALUE  9651.
006640     05  WK-806-9652-IDX   PIC S9(08) USAGE COMP    VALUE  9652.
006650     05  WK-806-9653-IDX   PIC S9(08) USAGE COMP    VALUE  9653.
006660     05  WK-806-9654-IDX   PIC S9(08) USAGE COMP    VALUE  9654.
006670     05  WK-806-9655-IDX   PIC S9(08) USAGE COMP    VALUE  9655.
006680     05  WK-806-9656-IDX   PIC S9(08) USAGE COMP    VALUE  9656.
006690     05  WK-806-9657-IDX   PIC S9(08) USAGE COMP    VALUE  9657.
006700     05  WK-806-9658-IDX   PIC S9(08) USAGE COMP    VALUE  9658.
006710     05  WK-806-9659-IDX   PIC S9(08) USAGE COMP    VALUE  9659.
006720     05  WK-806-9660-IDX   PIC S9(08) USAGE COMP    VALUE  9660.
006730     05  WK-806-9661-IDX   PIC S9(08) USAGE COMP    VALUE  9661.
006740     05  WK-806-9662-IDX   PIC S9(08) USAGE COMP    VALUE  9662.
006750     05  WK-806-9663-IDX   PIC S9(08) USAGE COMP    VALUE  9663.
006760     05  WK-806-9664-IDX   PIC S9(08) USAGE COMP    VALUE  9664.
006770     05  WK-806-9665-IDX   PIC S9(08) USAGE COMP    VALUE  9665.
006780     05  WK-806-9666-IDX   PIC S9(08) USAGE COMP    VALUE  9666.
006790     05  WK-806-9667-IDX   PIC S9(08) USAGE COMP    VALUE  9667.
006800     05  WK-806-9668-IDX   PIC S9(08) USAGE COMP    VALUE  9668.
006810     05  WK-806-9669-IDX   PIC S9(08) USAGE COMP    VALUE  9669.
006820     05  WK-806-9670-IDX   PIC S9(08) USAGE COMP    VALUE  9670.
006830     05  WK-806-9671-IDX   PIC S9(08) USAGE COMP    VALUE  9671.
006840     05  WK-806-9672-IDX   PIC S9(08) USAGE COMP    VALUE  9672.
006850     05  WK-806-9673-IDX   PIC S9(08) USAGE COMP    VALUE  9673.
006860     05  WK-806-9674-IDX   PIC S9(08) USAGE COMP    VALUE  9674.
006870     05  WK-806-9675-IDX   PIC S9(08) USAGE COMP    VALUE  9675.
006880     05  WK-806-9676-IDX   PIC S9(08) USAGE COMP    VALUE  9676.
006890     05  WK-806-9677-IDX   PIC S9(08) USAGE COMP    VALUE  9677.
006900     05  WK-806-9678-IDX   PIC S9(08) USAGE COMP    VALUE  9678.
006910     05  WK-806-9679-IDX   PIC S9(08) USAGE COMP    VALUE  9679.
006920     05  WK-806-9680-IDX   PIC S9(08) USAGE COMP    VALUE  9680.
006930     05  WK-806-9681-IDX   PIC S9(08) USAGE COMP    VALUE  9681.
006940     05  WK-806-9682-IDX   PIC S9(08) USAGE COMP    VALUE  9682.
006950     05  WK-806-9683-IDX   PIC S9(08) USAGE COMP    VALUE  9683.
006960     05  WK-806-9684-IDX   PIC S9(08) USAGE COMP    VALUE  9684.
006970     05  WK-806-9685-IDX   PIC S9(08) USAGE COMP    VALUE  9685.
006980     05  WK-806-9686-IDX   PIC S9(08) USAGE COMP    VALUE  9686.
006990     05  WK-806-9687-IDX   PIC S9(08) USAGE COMP    VALUE  9687.
007000     05  WK-806-9688-IDX   PIC S9(08) USAGE COMP    VALUE  9688.
007010     05  WK-806-9689-IDX   PIC S9(08) USAGE COMP    VALUE  9689.
007020     05  WK-806-9690-IDX   PIC S9(08) USAGE COMP    VALUE  9690.
007030     05  WK-806-9691-IDX   PIC S9(08) USAGE COMP    VALUE  9691.
007040     05  WK-806-9692-IDX   PIC S9(08) USAGE COMP    VALUE  9692.
007050     05  WK-806-9693-IDX   PIC S9(08) USAGE COMP    VALUE  9693.
007060     05  WK-806-9694-IDX   PIC S9(08) USAGE COMP    VALUE  9694.
007070     05  WK-806-9695-IDX   PIC S9(08) USAGE COMP    VALUE  9695.
007080     05  WK-806-9696-IDX   PIC S9(08) USAGE COMP    VALUE  9696.
007090     05  WK-806-9697-IDX   PIC S9(08) USAGE COMP    VALUE  9697.
007100     05  WK-806-9698-IDX   PIC S9(08) USAGE COMP    VALUE  9698.
007110     05  WK-806-9699-IDX   PIC S9(08) USAGE COMP    VALUE  9699.
007120     05  WK-806-9700-IDX   PIC S9(08) USAGE COMP    VALUE  9700.
007130     05  WK-806-9701-IDX   PIC S9(08) USAGE COMP    VALUE  9701.
007140     05  WK-806-9702-IDX   PIC S9(08) USAGE COMP    VALUE  9702.
007150     05  WK-806-9703-IDX   PIC S9(08) USAGE COMP    VALUE  9703.
007160     05  WK-806-9704-IDX   PIC S9(08) USAGE COMP    VALUE  9704.
007170     05  WK-806-9705-IDX   PIC S9(08) USAGE COMP    VALUE  9705.
007180     05  WK-806-9706-IDX   PIC S9(08) USAGE COMP    VALUE  9706.
007190     05  WK-806-9707-IDX   PIC S9(08) USAGE COMP    VALUE  9707.
007200     05  WK-806-9708-IDX   PIC S9(08) USAGE COMP    VALUE  9708.
007210     05  WK-806-9709-IDX   PIC S9(08) USAGE COMP    VALUE  9709.
007220     05  WK-806-9710-IDX   PIC S9(08) USAGE COMP    VALUE  9710.
007230     05  WK-806-9711-IDX   PIC S9(08) USAGE COMP    VALUE  9711.
007240     05  WK-806-9712-IDX   PIC S9(08) USAGE COMP    VALUE  9712.
007250     05  WK-806-9713-IDX   PIC S9(08) USAGE COMP    VALUE  9713.
007260     05  WK-806-9714-IDX   PIC S9(08) USAGE COMP    VALUE  9714.
007270     05  WK-806-9715-IDX   PIC S9(08) USAGE COMP    VALUE  9715.
007280     05  WK-806-9716-IDX   PIC S9(08) USAGE COMP    VALUE  9716.
007290     05  WK-806-9717-IDX   PIC S9(08) USAGE COMP    VALUE  9717.
007300     05  WK-806-9718-IDX   PIC S9(08) USAGE COMP    VALUE  9718.
007310     05  WK-806-9719-IDX   PIC S9(08) USAGE COMP    VALUE  9719.
007320     05  WK-806-9720-IDX   PIC S9(08) USAGE COMP    VALUE  9720.
007330     05  WK-806-9721-IDX   PIC S9(08) USAGE COMP    VALUE  9721.
007340     05  WK-806-9722-IDX   PIC S9(08) USAGE COMP    VALUE  9722.
007350     05  WK-806-9723-IDX   PIC S9(08) USAGE COMP    VALUE  9723.
007360     05  WK-806-9724-IDX   PIC S9(08) USAGE COMP    VALUE  9724.
007370     05  WK-806-9725-IDX   PIC S9(08) USAGE COMP    VALUE  9725.
007380     05  WK-806-9726-IDX   PIC S9(08) USAGE COMP    VALUE  9726.
007390     05  WK-806-9727-IDX   PIC S9(08) USAGE COMP    VALUE  9727.
007400     05  WK-806-9728-IDX   PIC S9(08) USAGE COMP    VALUE  9728.
007410     05  WK-806-9729-IDX   PIC S9(08) USAGE COMP    VALUE  9729.
007420     05  WK-806-9730-IDX   PIC S9(08) USAGE COMP    VALUE  9730.
007430     05  WK-806-9731-IDX   PIC S9(08) USAGE COMP    VALUE  9731.
007440     05  WK-806-9732-IDX   PIC S9(08) USAGE COMP    VALUE  9732.
007450     05  WK-806-9733-IDX   PIC S9(08) USAGE COMP    VALUE  9733.
007460     05  WK-806-9734-IDX   PIC S9(08) USAGE COMP    VALUE  9734.
007470     05  WK-806-9735-IDX   PIC S9(08) USAGE COMP    VALUE  9735.
007480     05  WK-806-9736-IDX   PIC S9(08) USAGE COMP    VALUE  9736.
007490     05  WK-806-9737-IDX   PIC S9(08) USAGE COMP    VALUE  9737.
007500     05  WK-806-9738-IDX   PIC S9(08) USAGE COMP    VALUE  9738.
007510     05  WK-806-9739-IDX   PIC S9(08) USAGE COMP    VALUE  9739.
007520     05  WK-806-9740-IDX   PIC S9(08) USAGE COMP    VALUE  9740.
007530     05  WK-806-9741-IDX   PIC S9(08) USAGE COMP    VALUE  9741.
007540     05  WK-806-9742-IDX   PIC S9(08) USAGE COMP    VALUE  9742.
007550     05  WK-806-9743-IDX   PIC S9(08) USAGE COMP    VALUE  9743.
007560     05  WK-806-9744-IDX   PIC S9(08) USAGE COMP    VALUE  9744.
007570     05  WK-806-9745-IDX   PIC S9(08) USAGE COMP    VALUE  9745.
007580     05  WK-806-9746-IDX   PIC S9(08) USAGE COMP    VALUE  9746.
007590     05  WK-806-9747-IDX   PIC S9(08) USAGE COMP    VALUE  9747.
007600     05  WK-806-9748-IDX   PIC S9(08) USAGE COMP    VALUE  9748.
007610     05  WK-806-9749-IDX   PIC S9(08) USAGE COMP    VALUE  9749.
007620     05  WK-806-9750-IDX   PIC S9(08) USAGE COMP    VALUE  9750.
007630     05  WK-806-9751-IDX   PIC S9(08) USAGE COMP    VALUE  9751.
007640     05  WK-806-9752-IDX   PIC S9(08) USAGE COMP    VALUE  9752.
007650     05  WK-806-9753-IDX   PIC S9(08) USAGE COMP    VALUE  9753.
007660     05  WK-806-9754-IDX   PIC S9(08) USAGE COMP    VALUE  9754.
007670     05  WK-806-9755-IDX   PIC S9(08) USAGE COMP    VALUE  9755.
007680     05  WK-806-9756-IDX   PIC S9(08) USAGE COMP    VALUE  9756.
007690     05  WK-806-9757-IDX   PIC S9(08) USAGE COMP    VALUE  9757.
007700     05  WK-806-9758-IDX   PIC S9(08) USAGE COMP    VALUE  9758.
007710     05  WK-806-9759-IDX   PIC S9(08) USAGE COMP    VALUE  9759.
007720     05  WK-806-9760-IDX   PIC S9(08) USAGE COMP    VALUE  9760.
007730     05  WK-806-9761-IDX   PIC S9(08) USAGE COMP    VALUE  9761.
007740     05  WK-806-9762-IDX   PIC S9(08) USAGE COMP    VALUE  9762.
007750     05  WK-806-9763-IDX   PIC S9(08) USAGE COMP    VALUE  9763.
007760     05  WK-806-9764-IDX   PIC S9(08) USAGE COMP    VALUE  9764.
007770     05  WK-806-9765-IDX   PIC S9(08) USAGE COMP    VALUE  9765.
007780     05  WK-806-9766-IDX   PIC S9(08) USAGE COMP    VALUE  9766.
007790     05  WK-806-9767-IDX   PIC S9(08) USAGE COMP    VALUE  9767.
007800     05  WK-806-9768-IDX   PIC S9(08) USAGE COMP    VALUE  9768.
007810     05  WK-806-9769-IDX   PIC S9(08) USAGE COMP    VALUE  9769.
007820     05  WK-806-9770-IDX   PIC S9(08) USAGE COMP    VALUE  9770.
007830     05  WK-806-9771-IDX   PIC S9(08) USAGE COMP    VALUE  9771.
007840     05  WK-806-9772-IDX   PIC S9(08) USAGE COMP    VALUE  9772.
007850     05  WK-806-9773-IDX   PIC S9(08) USAGE COMP    VALUE  9773.
007860     05  WK-806-9774-IDX   PIC S9(08) USAGE COMP    VALUE  9774.
007870     05  WK-806-9775-IDX   PIC S9(08) USAGE COMP    VALUE  9775.
007880     05  WK-806-9776-IDX   PIC S9(08) USAGE COMP    VALUE  9776.
007890     05  WK-806-9777-IDX   PIC S9(08) USAGE COMP    VALUE  9777.
007900     05  WK-806-9778-IDX   PIC S9(08) USAGE COMP    VALUE  9778.
007910     05  WK-806-9779-IDX   PIC S9(08) USAGE COMP    VALUE  9779.
007920     05  WK-806-9780-IDX   PIC S9(08) USAGE COMP    VALUE  9780.
007930     05  WK-806-9781-IDX   PIC S9(08) USAGE COMP    VALUE  9781.
007940     05  WK-806-9782-IDX   PIC S9(08) USAGE COMP    VALUE  9782.
007950     05  WK-806-9783-IDX   PIC S9(08) USAGE COMP    VALUE  9783.
007960     05  WK-806-9784-IDX   PIC S9(08) USAGE COMP    VALUE  9784.
007970     05  WK-806-9785-IDX   PIC S9(08) USAGE COMP    VALUE  9785.
007980     05  WK-806-9786-IDX   PIC S9(08) USAGE COMP    VALUE  9786.
007990     05  WK-806-9787-IDX   PIC S9(08) USAGE COMP    VALUE  9787.
008000     05  WK-806-9788-IDX   PIC S9(08) USAGE COMP    VALUE  9788.
008010     05  WK-806-9789-IDX   PIC S9(08) USAGE COMP    VALUE  9789.
008020     05  WK-806-9790-IDX   PIC S9(08) USAGE COMP    VALUE  9790.
008030     05  WK-806-9791-IDX   PIC S9(08) USAGE COMP    VALUE  9791.
008040     05  WK-806-9792-IDX   PIC S9(08) USAGE COMP    VALUE  9792.
008050     05  WK-806-9793-IDX   PIC S9(08) USAGE COMP    VALUE  9793.
008060     05  WK-806-9794-IDX   PIC S9(08) USAGE COMP    VALUE  9794.
008070     05  WK-806-9795-IDX   PIC S9(08) USAGE COMP    VALUE  9795.
008080     05  WK-806-9796-IDX   PIC S9(08) USAGE COMP    VALUE  9796.
008090     05  WK-806-9797-IDX   PIC S9(08) USAGE COMP    VALUE  9797.
008100     05  WK-806-9798-IDX   PIC S9(08) USAGE COMP    VALUE  9798.
008110     05  WK-806-9799-IDX   PIC S9(08) USAGE COMP    VALUE  9799.
008120     05  WK-806-9800-IDX   PIC S9(08) USAGE COMP    VALUE  9800.
008130     05  WK-806-9801-IDX   PIC S9(08) USAGE COMP    VALUE  9801.
008140     05  WK-806-9802-IDX   PIC S9(08) USAGE COMP    VALUE  9802.
008150     05  WK-806-9803-IDX   PIC S9(08) USAGE COMP    VALUE  9803.
008160     05  WK-806-9804-IDX   PIC S9(08) USAGE COMP    VALUE  9804.
008170     05  WK-806-9805-IDX   PIC S9(08) USAGE COMP    VALUE  9805.
008180     05  WK-806-9806-IDX   PIC S9(08) USAGE COMP    VALUE  9806.
008190     05  WK-806-9807-IDX   PIC S9(08) USAGE COMP    VALUE  9807.
008200     05  WK-806-9808-IDX   PIC S9(08) USAGE COMP    VALUE  9808.
008210     05  WK-806-9809-IDX   PIC S9(08) USAGE COMP    VALUE  9809.
008220     05  WK-806-9810-IDX   PIC S9(08) USAGE COMP    VALUE  9810.
008230     05  WK-806-9811-IDX   PIC S9(08) USAGE COMP    VALUE  9811.
008240     05  WK-806-9812-IDX   PIC S9(08) USAGE COMP    VALUE  9812.
008250     05  WK-806-9813-IDX   PIC S9(08) USAGE COMP    VALUE  9813.
008260     05  WK-806-9814-IDX   PIC S9(08) USAGE COMP    VALUE  9814.
008270     05  WK-806-9815-IDX   PIC S9(08) USAGE COMP    VALUE  9815.
008280     05  WK-806-9816-IDX   PIC S9(08) USAGE COMP    VALUE  9816.
008290     05  WK-806-9817-IDX   PIC S9(08) USAGE COMP    VALUE  9817.
008300     05  WK-806-9818-IDX   PIC S9(08) USAGE COMP    VALUE  9818.
008310     05  WK-806-9819-IDX   PIC S9(08) USAGE COMP    VALUE  9819.
008320     05  WK-806-9820-IDX   PIC S9(08) USAGE COMP    VALUE  9820.
008330     05  WK-806-9821-IDX   PIC S9(08) USAGE COMP    VALUE  9821.
008340     05  WK-806-9822-IDX   PIC S9(08) USAGE COMP    VALUE  9822.
008350     05  WK-806-9823-IDX   PIC S9(08) USAGE COMP    VALUE  9823.
008360     05  WK-806-9824-IDX   PIC S9(08) USAGE COMP    VALUE  9824.
008370     05  WK-806-9825-IDX   PIC S9(08) USAGE COMP    VALUE  9825.
008380     05  WK-806-9826-IDX   PIC S9(08) USAGE COMP    VALUE  9826.
008390     05  WK-806-9827-IDX   PIC S9(08) USAGE COMP    VALUE  9827.
008400     05  WK-806-9828-IDX   PIC S9(08) USAGE COMP    VALUE  9828.
008410     05  WK-806-9829-IDX   PIC S9(08) USAGE COMP    VALUE  9829.
008420     05  WK-806-9830-IDX   PIC S9(08) USAGE COMP    VALUE  9830.
008430     05  WK-806-9831-IDX   PIC S9(08) USAGE COMP    VALUE  9831.
008440     05  WK-806-9832-IDX   PIC S9(08) USAGE COMP    VALUE  9832.
008450     05  WK-806-9833-IDX   PIC S9(08) USAGE COMP    VALUE  9833.
008460     05  WK-806-9834-IDX   PIC S9(08) USAGE COMP    VALUE  9834.
008470     05  WK-806-9835-IDX   PIC S9(08) USAGE COMP    VALUE  9835.
008480     05  WK-806-9836-IDX   PIC S9(08) USAGE COMP    VALUE  9836.
008490     05  WK-806-9837-IDX   PIC S9(08) USAGE COMP    VALUE  9837.
008500     05  WK-806-9838-IDX   PIC S9(08) USAGE COMP    VALUE  9838.
008510     05  WK-806-9839-IDX   PIC S9(08) USAGE COMP    VALUE  9839.
008520     05  WK-806-9840-IDX   PIC S9(08) USAGE COMP    VALUE  9840.
008530     05  WK-806-9841-IDX   PIC S9(08) USAGE COMP    VALUE  9841.
008540     05  WK-806-9842-IDX   PIC S9(08) USAGE COMP    VALUE  9842.
008550     05  WK-806-9843-IDX   PIC S9(08) USAGE COMP    VALUE  9843.
008560     05  WK-806-9844-IDX   PIC S9(08) USAGE COMP    VALUE  9844.
008570     05  WK-806-9845-IDX   PIC S9(08) USAGE COMP    VALUE  9845.
008580     05  WK-806-9846-IDX   PIC S9(08) USAGE COMP    VALUE  9846.
008590     05  WK-806-9847-IDX   PIC S9(08) USAGE COMP    VALUE  9847.
008600     05  WK-806-9848-IDX   PIC S9(08) USAGE COMP    VALUE  9848.
008610     05  WK-806-9849-IDX   PIC S9(08) USAGE COMP    VALUE  9849.
008620     05  WK-806-9850-IDX   PIC S9(08) USAGE COMP    VALUE  9850.
008630     05  WK-806-9851-IDX   PIC S9(08) USAGE COMP    VALUE  9851.
008640     05  WK-806-9852-IDX   PIC S9(08) USAGE COMP    VALUE  9852.
008650     05  WK-806-9853-IDX   PIC S9(08) USAGE COMP    VALUE  9853.
008660     05  WK-806-9854-IDX   PIC S9(08) USAGE COMP    VALUE  9854.
008670     05  WK-806-9855-IDX   PIC S9(08) USAGE COMP    VALUE  9855.
008680     05  WK-806-9856-IDX   PIC S9(08) USAGE COMP    VALUE  9856.
008690     05  WK-806-9857-IDX   PIC S9(08) USAGE COMP    VALUE  9857.
008700     05  WK-806-9858-IDX   PIC S9(08) USAGE COMP    VALUE  9858.
008710     05  WK-806-9859-IDX   PIC S9(08) USAGE COMP    VALUE  9859.
008720     05  WK-806-9860-IDX   PIC S9(08) USAGE COMP    VALUE  9860.
008730     05  WK-806-9861-IDX   PIC S9(08) USAGE COMP    VALUE  9861.
008740     05  WK-806-9862-IDX   PIC S9(08) USAGE COMP    VALUE  9862.
008750     05  WK-806-9863-IDX   PIC S9(08) USAGE COMP    VALUE  9863.
008760     05  WK-806-9864-IDX   PIC S9(08) USAGE COMP    VALUE  9864.
008770     05  WK-806-9865-IDX   PIC S9(08) USAGE COMP    VALUE  9865.
008780     05  WK-806-9866-IDX   PIC S9(08) USAGE COMP    VALUE  9866.
008790     05  WK-806-9867-IDX   PIC S9(08) USAGE COMP    VALUE  9867.
008800     05  WK-806-9868-IDX   PIC S9(08) USAGE COMP    VALUE  9868.
008810     05  WK-806-9869-IDX   PIC S9(08) USAGE COMP    VALUE  9869.
008820     05  WK-806-9870-IDX   PIC S9(08) USAGE COMP    VALUE  9870.
008830     05  WK-806-9871-IDX   PIC S9(08) USAGE COMP    VALUE  9871.
008840     05  WK-806-9872-IDX   PIC S9(08) USAGE COMP    VALUE  9872.
008850     05  WK-806-9873-IDX   PIC S9(08) USAGE COMP    VALUE  9873.
008860     05  WK-806-9874-IDX   PIC S9(08) USAGE COMP    VALUE  9874.
008870     05  WK-806-9875-IDX   PIC S9(08) USAGE COMP    VALUE  9875.
008880     05  WK-806-9876-IDX   PIC S9(08) USAGE COMP    VALUE  9876.
008890     05  WK-806-9877-IDX   PIC S9(08) USAGE COMP    VALUE  9877.
008900     05  WK-806-9878-IDX   PIC S9(08) USAGE COMP    VALUE  9878.
008910     05  WK-806-9879-IDX   PIC S9(08) USAGE COMP    VALUE  9879.
008920     05  WK-806-9880-IDX   PIC S9(08) USAGE COMP    VALUE  9880.
008930     05  WK-806-9881-IDX   PIC S9(08) USAGE COMP    VALUE  9881.
008940     05  WK-806-9882-IDX   PIC S9(08) USAGE COMP    VALUE  9882.
008950     05  WK-806-9883-IDX   PIC S9(08) USAGE COMP    VALUE  9883.
008960     05  WK-806-9884-IDX   PIC S9(08) USAGE COMP    VALUE  9884.
008970     05  WK-806-9885-IDX   PIC S9(08) USAGE COMP    VALUE  9885.
008980     05  WK-806-9886-IDX   PIC S9(08) USAGE COMP    VALUE  9886.
008990     05  WK-806-9887-IDX   PIC S9(08) USAGE COMP    VALUE  9887.
009000     05  WK-806-9888-IDX   PIC S9(08) USAGE COMP    VALUE  9888.
009010     05  WK-806-9889-IDX   PIC S9(08) USAGE COMP    VALUE  9889.
009020     05  WK-806-9890-IDX   PIC S9(08) USAGE COMP    VALUE  9890.
009030     05  WK-806-9891-IDX   PIC S9(08) USAGE COMP    VALUE  9891.
009040     05  WK-806-9892-IDX   PIC S9(08) USAGE COMP    VALUE  9892.
009050     05  WK-806-9893-IDX   PIC S9(08) USAGE COMP    VALUE  9893.
009060     05  WK-806-9894-IDX   PIC S9(08) USAGE COMP    VALUE  9894.
009070     05  WK-806-9895-IDX   PIC S9(08) USAGE COMP    VALUE  9895.
009080     05  WK-806-9896-IDX   PIC S9(08) USAGE COMP    VALUE  9896.
009090     05  WK-806-9897-IDX   PIC S9(08) USAGE COMP    VALUE  9897.
009100     05  WK-806-9898-IDX   PIC S9(08) USAGE COMP    VALUE  9898.
009110     05  WK-806-9899-IDX   PIC S9(08) USAGE COMP    VALUE  9899.
009120     05  WK-806-9900-IDX   PIC S9(08) USAGE COMP    VALUE  9900.
009130     05  WK-806-9901-IDX   PIC S9(08) USAGE COMP    VALUE  9901.
009140     05  WK-806-9902-IDX   PIC S9(08) USAGE COMP    VALUE  9902.
009150     05  WK-806-9903-IDX   PIC S9(08) USAGE COMP    VALUE  9903.
009160     05  WK-806-9904-IDX   PIC S9(08) USAGE COMP    VALUE  9904.
009170     05  WK-806-9905-IDX   PIC S9(08) USAGE COMP    VALUE  9905.
009180     05  WK-806-9906-IDX   PIC S9(08) USAGE COMP    VALUE  9906.
009190     05  WK-806-9907-IDX   PIC S9(08) USAGE COMP    VALUE  9907.
009200     05  WK-806-9908-IDX   PIC S9(08) USAGE COMP    VALUE  9908.
009210     05  WK-806-9909-IDX   PIC S9(08) USAGE COMP    VALUE  9909.
009220     05  WK-806-9910-IDX   PIC S9(08) USAGE COMP    VALUE  9910.
009230     05  WK-806-9911-IDX   PIC S9(08) USAGE COMP    VALUE  9911.
009240     05  WK-806-9912-IDX   PIC S9(08) USAGE COMP    VALUE  9912.
009250     05  WK-806-9913-IDX   PIC S9(08) USAGE COMP    VALUE  9913.
009260     05  WK-806-9914-IDX   PIC S9(08) USAGE COMP    VALUE  9914.
009270     05  WK-806-9915-IDX   PIC S9(08) USAGE COMP    VALUE  9915.
009280     05  WK-806-9916-IDX   PIC S9(08) USAGE COMP    VALUE  9916.
009290     05  WK-806-9917-IDX   PIC S9(08) USAGE COMP    VALUE  9917.
009300     05  WK-806-9918-IDX   PIC S9(08) USAGE COMP    VALUE  9918.
009310     05  WK-806-9919-IDX   PIC S9(08) USAGE COMP    VALUE  9919.
009320     05  WK-806-9920-IDX   PIC S9(08) USAGE COMP    VALUE  9920.
009330     05  WK-806-9921-IDX   PIC S9(08) USAGE COMP    VALUE  9921.
009340     05  WK-806-9922-IDX   PIC S9(08) USAGE COMP    VALUE  9922.
009350     05  WK-806-9923-IDX   PIC S9(08) USAGE COMP    VALUE  9923.
009360     05  WK-806-9924-IDX   PIC S9(08) USAGE COMP    VALUE  9924.
009370     05  WK-806-9925-IDX   PIC S9(08) USAGE COMP    VALUE  9925.
009380     05  WK-806-9926-IDX   PIC S9(08) USAGE COMP    VALUE  9926.
009390     05  WK-806-9927-IDX   PIC S9(08) USAGE COMP    VALUE  9927.
009400     05  WK-806-9928-IDX   PIC S9(08) USAGE COMP    VALUE  9928.
009410     05  WK-806-9929-IDX   PIC S9(08) USAGE COMP    VALUE  9929.
009420     05  WK-806-9930-IDX   PIC S9(08) USAGE COMP    VALUE  9930.
009430     05  WK-806-9931-IDX   PIC S9(08) USAGE COMP    VALUE  9931.
009440     05  WK-806-9932-IDX   PIC S9(08) USAGE COMP    VALUE  9932.
009450     05  WK-806-9933-IDX   PIC S9(08) USAGE COMP    VALUE  9933.
009460     05  WK-806-9934-IDX   PIC S9(08) USAGE COMP    VALUE  9934.
009470     05  WK-806-9935-IDX   PIC S9(08) USAGE COMP    VALUE  9935.
009480     05  WK-806-9936-IDX   PIC S9(08) USAGE COMP    VALUE  9936.
009490     05  WK-806-9937-IDX   PIC S9(08) USAGE COMP    VALUE  9937.
009500     05  WK-806-9938-IDX   PIC S9(08) USAGE COMP    VALUE  9938.
009510     05  WK-806-9939-IDX   PIC S9(08) USAGE COMP    VALUE  9939.
009520     05  WK-806-9940-IDX   PIC S9(08) USAGE COMP    VALUE  9940.
009530     05  WK-806-9941-IDX   PIC S9(08) USAGE COMP    VALUE  9941.
009540     05  WK-806-9942-IDX   PIC S9(08) USAGE COMP    VALUE  9942.
009550     05  WK-806-9943-IDX   PIC S9(08) USAGE COMP    VALUE  9943.
009560     05  WK-806-9944-IDX   PIC S9(08) USAGE COMP    VALUE  9944.
009570     05  WK-806-9945-IDX   PIC S9(08) USAGE COMP    VALUE  9945.
009580     05  WK-806-9946-IDX   PIC S9(08) USAGE COMP    VALUE  9946.
009590     05  WK-806-9947-IDX   PIC S9(08) USAGE COMP    VALUE  9947.
009600     05  WK-806-9948-IDX   PIC S9(08) USAGE COMP    VALUE  9948.
009610     05  WK-806-9949-IDX   PIC S9(08) USAGE COMP    VALUE  9949.
009620     05  WK-806-9950-IDX   PIC S9(08) USAGE COMP    VALUE  9950.
009630     05  WK-806-9951-IDX   PIC S9(08) USAGE COMP    VALUE  9951.
009640     05  WK-806-9952-IDX   PIC S9(08) USAGE COMP    VALUE  9952.
009650     05  WK-806-9953-IDX   PIC S9(08) USAGE COMP    VALUE  9953.
009660     05  WK-806-9954-IDX   PIC S9(08) USAGE COMP    VALUE  9954.
009670     05  WK-806-9955-IDX   PIC S9(08) USAGE COMP    VALUE  9955.
009680     05  WK-806-9956-IDX   PIC S9(08) USAGE COMP    VALUE  9956.
009690     05  WK-806-9957-IDX   PIC S9(08) USAGE COMP    VALUE  9957.
009700     05  WK-806-9958-IDX   PIC S9(08) USAGE COMP    VALUE  9958.
009710     05  WK-806-9959-IDX   PIC S9(08) USAGE COMP    VALUE  9959.
009720     05  WK-806-9960-IDX   PIC S9(08) USAGE COMP    VALUE  9960.
009730     05  WK-806-9961-IDX   PIC S9(08) USAGE COMP    VALUE  9961.
009740     05  WK-806-9962-IDX   PIC S9(08) USAGE COMP    VALUE  9962.
009750     05  WK-806-9963-IDX   PIC S9(08) USAGE COMP    VALUE  9963.
009760     05  WK-806-9964-IDX   PIC S9(08) USAGE COMP    VALUE  9964.
009770     05  WK-806-9965-IDX   PIC S9(08) USAGE COMP    VALUE  9965.
009780     05  WK-806-9966-IDX   PIC S9(08) USAGE COMP    VALUE  9966.
009790     05  WK-806-9967-IDX   PIC S9(08) USAGE COMP    VALUE  9967.
009800     05  WK-806-9968-IDX   PIC S9(08) USAGE COMP    VALUE  9968.
009810     05  WK-806-9969-IDX   PIC S9(08) USAGE COMP    VALUE  9969.
009820     05  WK-806-9970-IDX   PIC S9(08) USAGE COMP    VALUE  9970.
009830     05  WK-806-9971-IDX   PIC S9(08) USAGE COMP    VALUE  9971.
009840     05  WK-806-9972-IDX   PIC S9(08) USAGE COMP    VALUE  9972.
009850     05  WK-806-9973-IDX   PIC S9(08) USAGE COMP    VALUE  9973.
009860     05  WK-806-9974-IDX   PIC S9(08) USAGE COMP    VALUE  9974.
009870     05  WK-806-9975-IDX   PIC S9(08) USAGE COMP    VALUE  9975.
009880     05  WK-806-9976-IDX   PIC S9(08) USAGE COMP    VALUE  9976.
009890     05  WK-806-9977-IDX   PIC S9(08) USAGE COMP    VALUE  9977.
009900     05  WK-806-9978-IDX   PIC S9(08) USAGE COMP    VALUE  9978.
009910     05  WK-806-9979-IDX   PIC S9(08) USAGE COMP    VALUE  9979.
009920     05  WK-806-9980-IDX   PIC S9(08) USAGE COMP    VALUE  9980.
009930     05  WK-806-9981-IDX   PIC S9(08) USAGE COMP    VALUE  9981.
009940     05  WK-806-9982-IDX   PIC S9(08) USAGE COMP    VALUE  9982.
009950     05  WK-806-9983-IDX   PIC S9(08) USAGE COMP    VALUE  9983.
009960     05  WK-806-9984-IDX   PIC S9(08) USAGE COMP    VALUE  9984.
009970     05  WK-806-9985-IDX   PIC S9(08) USAGE COMP    VALUE  9985.
009980     05  WK-806-9986-IDX   PIC S9(08) USAGE COMP    VALUE  9986.
009990     05  WK-806-9987-IDX   PIC S9(08) USAGE COMP    VALUE  9987.
010000     05  WK-806-9988-IDX   PIC S9(08) USAGE COMP    VALUE  9988.
010010     05  WK-806-9989-IDX   PIC S9(08) USAGE COMP    VALUE  9989.
010020     05  WK-806-9990-IDX   PIC S9(08) USAGE COMP    VALUE  9990.
010030     05  WK-806-9991-IDX   PIC S9(08) USAGE COMP    VALUE  9991.
010040     05  WK-806-9992-IDX   PIC S9(08) USAGE COMP    VALUE  9992.
010050     05  WK-806-9993-IDX   PIC S9(08) USAGE COMP    VALUE  9993.
010060     05  WK-806-9994-IDX   PIC S9(08) USAGE COMP    VALUE  9994.
010070     05  WK-806-9995-IDX   PIC S9(08) USAGE COMP    VALUE  9995.
010080     05  WK-806-9996-IDX   PIC S9(08) USAGE COMP    VALUE  9996.
010090     05  WK-806-9997-IDX   PIC S9(08) USAGE COMP    VALUE  9997.
010100     05  WK-806-9998-IDX   PIC S9(08) USAGE COMP    VALUE  9998.
010110     05  WK-806-9999-IDX   PIC S9(08) USAGE COMP    VALUE  9999.
010120
010130
